package com.fchj.czglgz.chengzhangguanli_high.vocation;

import java.util.List;

public class VocationModel {


    /**
     * code : 1
     * msg : 获取职业列表成功
     * data : [{"vctid":"VOT-573-INFO","vocatype":"教育","vocaname":"初级职业教育教师","vocasummary":"在中学教授与职业技能相关的课程。","vocavista":"近年来，伴随着国家有关经济社会以及职业教育发展改革一系列重大方针、政策的出台，伴随着我国职业教育事业的持续发展和职业教育发展战略地位的进一步确立，职业教育科学研究工作的指向更加明确，对于职业教育事业发展的推动作用日益增强，专家指出，随着经济结构的调整和技术进步，我国劳动力结构将发生深刻变化，未来社会对未受过职业教育和培训的劳动力的需求将逐步减少，而对受过职业教育和培训的技能工、技术工和熟练工的需求将不断增大。 职业教育教师可以内部晋升为教务处主任等行政职位，可以转向培训机构任教。在良好的职业技能支撑下，他们还可以转到企业就业。","edubg":"高中及以上学历。","abtmajor":"教育学,教育技术学,艺术教育","handson":"2年以上相关工作经验。","jobcontent":"监督和指导学生正确使用和保养学习材料及器具，避免发生破毁器具的行为或由于使用不当而造成的人身伤害。 建立维护学生权益在学生行为准则，并使之生效。 采用灵活的教学方法和丰富的教学材料以满足不同学生的需求和兴趣。 采用讲座、讨论和示范等多种方法指导学生的学习。 准备课堂活动的相关材料。 根据国家法律及地方行政法规要求建立准确完整的学生档案。 为所有的课程、活动和项目制定明确的目标，并将目标传达给学生。 执行所有管理学生的政策及守则。 用电脑、视听器材等进行辅助教学。 与学生的父母或监护人、教师、辅导员和管理员一起共同解决学生的学业和行为问题。","isfollow":0},{"vctid":"VOT-574-INFO","vocatype":"教育","vocaname":"大学计算机科学教师","vocasummary":"执教计算机科学的课程。专研计算机科学领域，例如，计算机或操作研究分析的设计和运行。","vocavista":"随着计算机教育的继续普及和深入，师资来源成为关键问题，我国对于专兼职计算机教师的需求越来越大，在未来一段时期内，全国对计算机教育的师资将存在一个巨大的缺口。综合来说，大学计算机科学教师还是一个非常有前景的职业，尤其是高素质的计算机教师将会成为未来十分紧缺的人才。","edubg":"一般要求计算机专业硕士及以上学历，部分学校要求具备博士学历。","abtmajor":"计算机科学与技术,计算机应用技术","handson":"2年以上计算机教学工作经验","jobcontent":"依据教学大纲的要求，明确教学目的，备课并撰写教案，制定教学实施计划，安排讲授习题、实验和上机时间。 按照教学大纲和课程组负责人的安排，把握课程实施的深度、广度，突出重点、突破难点，重视学生能力的培养，批改一定数量的作业，并安排适当的答疑时间，和学生进行交流，了解学生的学习情况，改进教学方法。 研究教材内容和教学规律，改进教学方法，采用先进的教学手段，改进教学质量。 按照课程组负责人的安排，参与考试命题、试卷评阅、参考答案和评分标准的编写等工作，撰写课程实施情况小结。","isfollow":0},{"vctid":"VOT-575-INFO","vocatype":"教育","vocaname":"大学外语与文学教师","vocasummary":"教授外语（中文之外）和文学。","vocavista":"随着越来越多的人进入高校学习，学校需要更多的师资力量。因此市场对高校教师的需求量大，大学外语与文学教师具有较为广阔的就业前景。","edubg":"西班牙语、汉语言文学、匈牙利语、捷克语等相关专业博士及以上学历。","abtmajor":"英语,英语教育,语文教育","handson":"无需工作经验。","jobcontent":"根据学校和学院的安排，制定教学计划以及研究计划。 教学计划包括制定学时、指定授课教材等课程；研究计划包括申报课题项目、申请研究资金等。 备课、准备授课课件以及制定授课中的各种实践的安排。 定期组织安排学生与留学生进行语言交流。 培养学生的口语能力和实际交流中的应用能力。 安排学生进行外语短剧或小品的表演，以增进学生对外语的兴趣和理解能力，并对短剧或小品的优劣评定合适的等级、分数。 定期在相关的学术期刊上发表文章，并争取在专业领域内的研究方向上有所突破或发展。 制定并保持定期计划办公时间，以方便学生答疑。 阅读相关书籍、研讨及参加专业会议，不断地获取新的信息和知识，以促进自己在专业领域方面的发展。","isfollow":0},{"vctid":"VOT-576-INFO","vocatype":"教育","vocaname":"大学艺术、戏剧或音乐系教师","vocasummary":"教授话剧、音乐和艺术，包括美术和艺术应用，比如绘画、雕塑设计和手工。","vocavista":"随着越来越多的人进入高校学习，学校需要更多的师资力量。因此市场对高校教师的需求量大，大学艺术、戏剧或音乐系教师具有较为广阔的就业前景。","edubg":"音乐、美术、表演等相关专业博士以上学历。","abtmajor":"艺术史论,音乐表演,音乐学,戏剧学,戏曲表演,表演艺术","handson":"无需工作经验。","jobcontent":"根据学校和学院的安排，做出本学期的教学计划以及研究计划。 教学计划包括制定学时，指定授课教材等工作。 研究计划包括报课题项目，申请研究资金等。 根据教学计划，备课、准备授课课件以及制定授课过程中的实习表演安排等。 为学生上课，按教学计划教授表演艺术的理论知识。 在课后抽时间为学生进行指导。 组织学生进行专门的表演艺术研究以及讨论，同时为学生提供该专题的参考阅读书目、录像带、视频等指导学生进行正确的表演艺术研究。 重视教材的合理安排，分阶段教学，结合影视创作的特点，课堂使用摄像设备进行教学，使表演教学更系统、更规范、更科学。 组织学生进行表演实习，通过实际表演培养和提高学生的演才能和创造性艺术思维，提高学生的表演素质。 发掘和提高学生自身的个性魅力，解放天性。 在教学基础训练中，打开学生们的想象力、让学生自由展现自身的魅力和性格特点，为学生成材打下坚实的基础。 根据学校和学院的安排，做好自己的课题研究。 发表自己的研究成果或学术论文。 通过演讲的方式来继续完善研究成果或学术论文。 通过与同事协作、参加表演艺术专业会议等方式使自己不断地学习充电。 帮助指导学生正确的完成表演艺术研究。 帮助指导学生做毕业汇报表演等。","isfollow":0},{"vctid":"VOT-577-INFO","vocatype":"教育","vocaname":"高等教育管理者","vocasummary":"计划、指导或协调高等学校的科研、教学、学生管理及服务，如大学、本科学院和高职学院的教学活动。","vocavista":"高等教育管理者一般都是由教育行政部门甄选出具有一定行政级别和学术成就的合适人选再派遣到大学担任校长，近年来，这种以司局级干部身份\u201c空降\u201d升任公立高等教育管理者的情形越来越普遍。教育行政部门会在各大学之间进行校长的调动，或把大学其它稍低职位的管理者升任为高等教育管理者。私立大学可面向社会招聘高等教育管理者，或有针对性地邀请教育名流特聘为管理者。","edubg":"本科以上学历，不限专业。","abtmajor":"行政管理,行政管理","handson":"一般需要至少十年以上大学教育或管理经验","jobcontent":"依据教学大纲的要求，明确教学目标，备课并撰写教案，制定教学计划，讲授习题、指导学生实践活动。 研究教材内容和教学规律，釆用先进的教学手段，提升教学质量。 按照课程组负责人的安排，参与考试命题、试卷评阅、参考答案和评分标准的编写等工作。 撰写课程实施情况，对于学生毕业论文的选题、撰写等工作进行指导。 按照教学大纲和课程组负责人的安排，把握课程实施的深度、广度，突出重点、突破难点，重视学生能力的培养。 批改一定数量的作业，并安排适当的答疑时间，和学生进行交流，了解学生学习情况，改进教学方法。","isfollow":0},{"vctid":"VOT-578-INFO","vocatype":"教育","vocaname":"高校辅导员","vocasummary":"高校辅导员是学校教师队伍的重要组成部分，是开展大学生思想政治教育的骨干力量，是大学生健康成长的指导者和引路人。随着时代和社会的变革与发展，大学生群体不断出现新的情况和问题，党和国家对大学生思想政治教育工作更加重视，明确高校辅导员的角色定位与工作职责，探讨今后高校辅导员工作的发展趋向，对于国家、社会和学校，都成为一项紧迫而重大的战略任务。","vocavista":"职业化发展使辅导员工作成为一个相对独立又十分开放的系统。相对独立意味着辅导员工作不再是高校中的一个工作岗位，而是一种得到广泛认可的社会职业，进而意味着这支队伍要形成一种行业生存方式，即同业人员具有共同的身份感，共同的话语系统，共同的价值观，清晰的社会边界，同业协会、专业社团在行业管理方面起主要协调作用。其内部有行业人员发展和升迁的独立通道。","edubg":"\u2014\u2014","abtmajor":"教育学,社会学,社会工作,心理学,应用心理学,行政管理,思想政治教育,计算机科学与技术","handson":"\u2014\u2014","jobcontent":"帮助大学生树立正确的世界观、人生观、价值观，确立在中国共产党领导下走中国特色社会主义道路、实现中华民族伟大复兴的共同理想和坚定信念要积极引导大学生不断追求更高的目标，使他们中的先进分子树立共产主义的远大理想，确立马克思主义的坚定信念。 帮助大学生养成良好的道德品质，经常性地开展谈心活动。引导大学生养成良好的心理品质和自尊、自爱、自律、自强的优良品格，树立社会主义荣辱观。增强大学生克服困难的意识、经受考验、承受挫折的能力。有针对性地帮助大学生处理好学习成才、择业交友、健康生活等方面的具体问题，提高思想认识和精神境界。 动态教育：了解和掌握大学生思想政治状况。了解大学生关心的热点问题，如食堂物价、口味宿舍水电外出请假入党评优奖学金评定超市问题校医室问题等。了解大学生关心的焦点问题：如教学质量、学历性质、招生承诺、升本问题、就业问题、实习问题、技能考试、安全问题等。及时进行教育和引导，化解矛盾冲突，参与处理有关突发事件，维护好校园安全和稳定。 落实好对经济困难大学生资助的有关工作，组织好大学生勤工助学，积极帮助经济困难大学生完成学业。积极争取政策帮助。提高对勤工助学的认识，将其列入导员的日常工作，对助学对象了如指掌。有针对性的做好对助学对象的思想工作，明确穷则思学的道理。 积极开展就业指导和服务工作，为大学生提供高效优质的就业指导和信息服务，帮助大学生树立正确的就业观念。 以班级为基础，以学生为主体，发挥学生班集体在大学生思想政治教育中的组织力量： ①选好配好班主任、班委干部、团支部干部。 ②按需要高标准开好主题班会、班委会、团支委会，注意解决学习和日常生活中反映出来的各种实际问题，弘扬正气，培养集体荣誉感，营造优良班风。 ③对学习、工作等各项活动实施目标管理，争先创优，增强班级凝聚力。 组织、协调班主任和思想政治理论课教师等工作骨干共同做好经常性的思想政治工作，在大学生中间开展形式多样的教育活动。 做好学生党支部工作，建好班委会，做好学生骨干培养工作，激发学生的积极性、主动性，形成大学生自我管理、自我监督、自我完善的机制。","isfollow":0},{"vctid":"VOT-579-INFO","vocatype":"教育","vocaname":"高校教师","vocasummary":"高校教师两个主要的工作就是教学和学术研究。教学的工作性质决定了他们的主要工作地点就是教室，工作时间也不是很长，有很固定的休息时间和节假日。学术研究时工作地点也是室内，但学术研究时常常需要参加专业的研讨会，出差的频率较大，此时是比较辛苦的。高校教师面临着越来越大的压力，高校的扩招以及人才的增加对高校教师的要求也越来越高，这就迫使高校教师不得不进一步深造学习，伴随着高校毕业生就业的困难，高校教师也受到了一定质疑，这些都导致了高校教师压力增大。","vocavista":"高等教育是我国教育事业的重要组成部分。作为高等人才的主要培养者，大学教师的社会需求也会随之增长，当然薪水也会随之水涨船高。大学教育教师的晋升途径主要是做学术，从大学的讲师做起，如果能够在研究上有很深的造诣并且在专业的学术期刊上发表较多学术文章，讲师很快就能晋升为副教授，再晋升至教授的职位。当然，也有部分教师转行，进入企业，从事具体的技术开发或研究工作。","edubg":"一般要求教育学或相关学科硕士毕业，部分知名大学/学院则要求具备博士学历。","abtmajor":"教育学,教育技术学,心理学,社会学,社会工作","handson":"一般要求2年以上高等教育教学工作经验。","jobcontent":"根据学校和学院的安排，做出本学期的教学计划以及研究计划。教学计划包括制定学时，指定授课教材等工作。研究计划包括报课题项目，申请研究资金等。 根据教学计划，备课、准备授课课件以及制定授课过程中的实习安排等。 为学生上课，按教学计划教授相关学科知识。在课后抽时间为学生答疑。组织学生进行专题的研究以及讨论，同时为学生提供该专题的参考阅读书目，指导学生进行正确的学习研究。 根据学校和学院的安排，进行相关学科调查以及研究，做好自己的课题研究。发表自己的研究成果或学术论文。通过演讲的方式来继续完善研究成果或学术论文。 按照课程组负责人的安排，参与考试命题、试卷评阅、参考答案和评分标准的编写等工作，撰写课程实施情况小结。 对于学生毕业论文的选题、撰写等工作进行指导。 指导学生参加社会实践，评议社会实践的成果。 对于学生毕业论文的选题、撰写等工作进行指导。","isfollow":0},{"vctid":"VOT-580-INFO","vocatype":"教育","vocaname":"教学主管","vocasummary":"教学主管是指在主管教学副校长领导下，具体负责教育教学管理工作的学校中层管理者。","vocavista":"在各级各类学校有用武之地。另外，随着教育产业的发展，许多教育类公司不断涌现，也成为教学主管的主要需求方向，其具体要求参考相关公司招聘信息。","edubg":"大学本科以上学历，学士及以上学位，具有中级以上教育系列专业技术职称（高校也可为副教授以上）。","abtmajor":"教育学,心理学,应用心理学,科学社会主义,思想政治教育,中国共产党历史,特殊教育,应用语言学,秘书学,哲学,社会学经济学,教育技术学,人文教育","handson":"有较强的学科建设、教学管理和学生管理的能力，有制定教学计划和教学大纲的经验。","jobcontent":"在校长或教学副校长的领导下全面主持日常教学行政工作，组织编制学年（学期）教学工作计划，教学实施性计划、教学进程计划，并组织实施。 审核修订教学大纲。 审批学生文、体、科技等课外活动计划。 领导教学研究工作，布置各阶段教学工作，安排任课教师。 检查教师教学情况，做好师资力量的安排和调整工作，做好师资规划和培养。 协助学校其他部门做好教师的思想政治教育工作。 组织检查学生学习情况，组织学生各阶段的考试工作，指导命题，督促阅卷并指导质量分析。","isfollow":0},{"vctid":"VOT-581-INFO","vocatype":"教育","vocaname":"教育、职业和校园顾问","vocasummary":"给个体提供咨询，给团体提供教育或职业指导服务。","vocavista":"在未来十年内，市场对教育、职业和校园顾问的需求量将稳定增长，求职者将有较为广阔的就业前景。","edubg":"心理学、教育学等相关专业硕士及以上学历。","abtmajor":"行政管理,行政管理","handson":"1\u20142年的咨询或教育等相关工作经验。","jobcontent":"帮助来访者解决在教育和职业中遇到的个体的、社会的和行为方面的问题。 对在校遇到困难情境的学生提供危机干预。 和孩子的父母亲、监护人、教师及管理者和其它专业人士就孩子取得的进步、如何化解问题行为和学业问题进行协商，来确定孩子所需资源的优先次序。 完成法律、地区政策和行政法规要求的准确且细致的学生记录。 鼓励学生探索各种学习机会、坚持一些具有挑战性的任务，为以后的深造做准备。 通过测验、记录、面试或职业资源，评估学生的能力、兴趣和个性特点。 识别家庭虐待和其它家庭问题，鼓励学生和家长向心理健康指导师寻求额外的援助。 就学生的教育问题提供咨询，如选课、课程安排和登记、学校适应、逃学、学习习惯和职业规划等。 为学生提供特别的服务，如酒精和药物滥用预防项目，教会学生如何在不使用暴力的情况下解决冲突。 与来访者进行面对面的交谈，以确定他们的需求是否得到满足。","isfollow":0},{"vctid":"VOT-582-INFO","vocatype":"教育","vocaname":"就业指导老师","vocasummary":"主要从事就业指导课程教学和统筹管理工作。","vocavista":"很多高校的就业指导基本上采取以教师为中心的教学模式，讲什么、以什么方式讲都由教师决定，忽视了学生的主体地位。同时缺乏对地方经济发展与人才需求变化趋势的了解，就业指导工作缺乏有效性和针对性。 在就业指导的队伍建设上，素质参差不齐，总体水平亟待提高高校毕业生就业服务机构忙于应付大量的与就业相关的事物性工作，难以有固定的时间和精力开展有针对性的就业指导工作。就业指导工作是一项专业性很强的工作，需要从事此项工作的人员掌握就业政策、就业指导、职业生涯规划、心理学、教育学、人力资源开发与管理、法律等多方面的知识，就业指导人员缺乏系统的业务培训，素质参差不齐，难以达到就业指导应有的效果。专业优秀的就业指导教师工作前景较好。","edubg":"从事职业指导工作并具有大专（含大专）以上学历的人员，可以申报职业指导员。","abtmajor":"心理学,教育学,社会学,经济学,行政管理,计算机科学与技术,行政管理,心理咨询,思想政治教育","handson":"\u2014\u2014","jobcontent":"配合就业领导小组、就业工作小组的工作要求，贯彻落实毕业生就业政策。 协助班导师加强对毕业生人生观、择业观、职业道德观教育，了解就业政策、就业形势，关注学生求职意向，有针对性地指导求职技巧、撰写求职简历，做好日常就业指导工作。 收集用人单位需求信息，畅通就业渠道，及时向毕业生反馈。 加强与用人单位的联系与合作，不断开发毕业生就业渠道建设。 组织毕业生参加校园招聘洽谈活动，做好向用人单位推荐、介绍毕业生的工作。 随时掌握所指导毕业生的异动情况，协助系就业指导小组准确掌握毕业生就业状况，重点做好未就业学生的帮助指导服务工作。 负责对毕业生进行追踪调查，了解反馈毕业生表现和培养质量。对用人单位开展跟踪调查，搜集就业需求及与教学相关信息，做好社会人才需求的预测及分析，为促进学校的教学改革提供建设性意见。 组织毕业生电子图像采集工作，打印制作毕业生登记表，毕业生离校手续的审核，发放毕业证书等。","isfollow":0},{"vctid":"VOT-583-INFO","vocatype":"教育","vocaname":"特殊教育教师","vocasummary":"特殊教育教师主要面对残疾学生，包括视力、听力言语、智力有障碍的人或心理障碍者。他们针对不同的学生设计和修改训练方法，以便适合个体需要；具体教授文化知识、基本生活自理能力、情感培养、社会交往能力等。为了培养特殊需要学生，特殊教育教师他们还需要与学校心理学家、社会工作者、家长以及专业的治疗专家合作，为孩子制定个性化的教育训练计划。","vocavista":"随着国家投入力度的加大和社会各界的普遍重视，我国残疾人教育事业发展步伐大大加快。截止到2004年底，我国特殊教育学校已达1560所，从业教师3.1万人，在校生接近38万人。国家对特殊教育的经费投入不仅有了较大幅度增加，还设立了专项补助费；法律法规建设力度也不断增强，国家相继颁布了教育法、义务教育法、残疾人保障法、残疾人教育条例等法律、法规，特殊教育开始走上依法治教的轨道。随着特殊教育地位的提高，社会对于受过专业学习的特殊教育教师和有经验的特教教师需求很大。特殊教育工作者未来的就业状况比较看好。特殊教育这个行业的流动性相比普通教师要高，通常情况下，特殊教育教师可以晋升到教务处主任、校长助理、校长等行政职位，但由于有些特殊教育教师发现工作太紧张会转到主流教学领域或完全改变工作。","edubg":"特殊教育、教育学、心理学等专业大专及以上学历。","abtmajor":"特殊教育,教育学,教育技术学,心理学,应用心理学,运动康复,华文教育,人文教育,特殊教育,特殊教育,心理咨询青少年工作与管理","handson":"具有人道主义精神，关心特殊儿童，掌握特殊教育的专业知识和技能，遵守职业道德，完成教育教学工作，能吃苦、有爱心、耐心、会沟通。","jobcontent":"根据学生的个人需要，学习方式和能力来确定教学内容和使用特定的技巧。 对于一些学生需要在教室里运用特殊的设备或技术来克服他们的残疾，以达到预期的就教学效果。 为各种课程和活动准备教室并且提供多种材料和资源让学生探索、操作、使用。 教授包括语言（包括手语）、艺术、科学、健康等课程。 对学生进行测试以评价学生的发展。 帮助学生培养感情和社交能力，教学生生活的技能，使其尽可能的独立。 照顾学生生活，保障学生在学习期间的安全。 与学校心理学家、社会工作者、家长以及专业的治疗专家合作，以改善学生的生理及心理状况。 定期与学生的父母或监护人会谈，告诉他们学生的发展和家庭教育建议，并且记录每个学生的进步。","isfollow":0},{"vctid":"VOT-584-INFO","vocatype":"教育","vocaname":"小学及中学教育管理者","vocasummary":"计划、指导并协调中小学教学、行政或配套活动。","vocavista":"以往的小学及中学教育管理者一般由教师或中小学某方面负责人如教务主任等晋升而来，现在许多学校都实行管理者外聘制，进行社会招聘，但也要求有一定教学管理经验。小学及中学教育管理者可以晋升至教育行政部门任职，或从事其他的教育管理工作。现在，我国长期以来实行的校长职位与行政级别挂钩的校长管理制度已经被新的校长职级制所取代。职级制依据小学及中学教育管理者水平，对学校的管理能力，所取得的实际成绩，对小学及中学教育管理者进行职级的评定，作为晋升的指标，十分科学。","edubg":"教育部要求乡（镇）所有小学以上的管理者应有中专及以上学历，初级中学管理者应具备大专及以上学历，所有中学、高级中学校长应具备本科及以上学历。","abtmajor":"行政管理,青少年工作与管理","handson":"从事教育教学工作5年以上，小学及中学教育管理者应分别具备中学一级、小学高级及以上的教师职称。","jobcontent":"领导和组织德育工作，制定德育工作计划，加强对学生的思想、政治、品德教育。 领导和组织教学工作。 建立和完善教学管理制度，搞好教学常规管理，指导教师进行教学活动。 领导和组织体育、卫生、美育、劳动教育工作及课外教育活动。 领导和组织总务工作。 严格管理校产和财务。 搞好校园建设。 关心学生和教职工的生活。 逐步改善办学条件和群众福利。 配合党组织，支持和指导群众组织开展工作。 充分发挥工会、共青团、少先队等群众组织在办学育人各项工作中的积极作用。 密切与家长和社区的联系，发挥学校教育的主导作用，努力促进学校教育、家庭教育、社会教育的相互协调与发展。 组织教师学习政治与钻研业务，做好教师和职工的思想政治工作。 对教职员工实施考核与奖惩，聘任或解聘教职员工。","isfollow":0},{"vctid":"VOT-585-INFO","vocatype":"教育","vocaname":"小学教师","vocasummary":"在公立或私立小学授课，向小学生传播基本知识，以及社交等基本技能。","vocavista":"小学教师是儿童的启蒙老师，对儿童今后的成长和人生道路选择有重要的影响。小学教师一直受到人们的尊重，随着社会对孩子的关注越来越多，更提高了小学教师的学历、水平、待遇和社会地位。不管社会如何发展，对孩子的教育也不会放松，小学教师的工作也将越来越重要。小学教师在学校内可以晋升为教导主任、教学主管等行政管理职位。如通过更高级别的考试或者培训，有丰富的教学经验，可获得小学高级教师、特级教师职称。","edubg":"教育学、中文、数学、音乐、绘画、心理学、英语等相关专业大专以上学历。","abtmajor":"小学教育,小学教育","handson":"无需工作经验。","jobcontent":"教授学校开设的各种课程，学习教学大纲，认真备课，按时保质完成学校的教学任务。批改和讲解学生作业，解答学生疑问。 组织考试，选择或编写考卷，批改试卷并登记学生成绩。 对学生进行个别辅导，必要的时候进行家访。 组织学生开展课外活动，并与学生一起参与，保护学生的人身安全。 开展学生的思想道德教育，树立儿童正确积极的世界观、人生观。 发展儿童的兴趣，指导儿童加入学校的兴趣组，促进学生身心的健康发展。 及时发现儿童生活中的困难和思想上的问题，在家访中与家长沟通，一方面反映儿童的情况，另一方面将家长的意见结合到教学中。 如实对学生的成绩、表现、思想情况作出客观公正的评价。","isfollow":0},{"vctid":"VOT-586-INFO","vocatype":"教育","vocaname":"学前班教师","vocasummary":"学前班教育仅要达到为幼儿入小学做适当准备的目的，确切地说是为幼儿做好心理、能力方面的准备。学前班教师教授与幼儿生活紧密相关的浅显知识，借助这些浅显知识达对发展幼儿与以后的正规学习有关的心理能力的目的，发展幼儿的观察、比较、概括等能力；教授科技常识、生活常识、看图说话、课外活动、语文、数学等与小学教育相接轨的相关课程。作为辅助，他们还要教授学生基本的生活自理能力，如洗衣服、系鞋带、穿衣等。作为学前班老师要求具有扎实的专业知识，理解幼儿的心理特点，还必须具有极大的耐心，以母爱般的关怀来帮助幼儿成长。","vocavista":"学前教育的可行性一方面得到了社会的肯定，一方面也存在很多的问题。但是，大多数家长和教育学家认为开设学前班是必要的，关键在于要改革目前的弊端。教育界越来越重视学前班的教育工作，对从事学前班教学的教师的要求提高了，并且社会也在积极改善学前班的教育环境以及教师的工作环境。但是学前班教师的责任重大，待遇和社会地位又相对的较低，从事学前班教师一定要有决心和恒心。具备一定经验的学前班教师可以向高级教师及资深幼教专家发展，可以转为幼儿园教师，晋升为园长等管理职位，也可以转向小学教师、教育咨询、图书出版等行业。","edubg":"学前教育、幼儿教育、心理、艺术类专业中专以上学历。","abtmajor":"学前教育,学前教育,小学教育,科学教育,心理学,应用心理学,绘画,华文教育,艺术教育,书法学,美术学,音乐学,艺术史论音乐表演,人文教育,学前教育,学前教育,特殊教育,语文教育,英语教育,美术教育,音乐教育,体育教育,心理咨询","handson":"不限","jobcontent":"根据教学大纲要求，结合幼儿的年龄特点和实际情况，按时制定好本班的教育工作计划。 选材备课、准备好教具，为教学工作做准备。 教授语文、数学、体育、音乐等课程和浅显的科学知识，为幼儿入小学进行知识准备。 辅导儿童完成作业，总结检查教学效果。 教授学生基本的生活自理能力。 组织课外活动，全面培养学生的观察、想象、语言表达、逻辑思维等能力。 负责本班活动室的布置，根据教育上的要求，季节性的特点，努力做好绿化、美化、儿童化、教育化、科学化。 经常与家长联系，交换意见，掌握幼儿的个性和特点。每期召开家长会议，对家长汇报幼儿的学习、生活情况，宣传幼儿的科学教养知识，争取家长配合，教育好儿童。","isfollow":0},{"vctid":"VOT-587-INFO","vocatype":"教育","vocaname":"幼儿园教师","vocasummary":"在儿童看护中心或其它儿童成长机构中工作，组织各种活动来增强（5岁及以下）孩子必需的社交能力、身体素质，并帮助他们的心智成长。","vocavista":"随着我国对教育事业的重视程度越来越高，教育体制的逐渐完备，社会各界和家长对幼儿教育给予越来越多的关注、帮助和支持，现在幼儿园教师的职业前景相当不错，特别是男教师的加入也受到热烈的欢迎。但是由于还处在转型时期，幼儿教育也面临着相当的困难，比如说责任重大而待遇相对偏低等问题。幼儿园教师通过努力，可以向高级教师甚至幼教专家方向发展，可以晋升至幼儿园园长等管理职位。他们还可以转向教育咨询等行业。","edubg":"幼师、学前教育、幼儿教育、艺术等相关专业中专及以上学历。","abtmajor":"学前教育,学前教育","handson":"需要幼儿教育相关工作经验。","jobcontent":"承担一个班的教育工作，根据国家规定的幼儿园课程标准，做好备课方案、教学计划等前期准备工作。 观察了解幼儿，结合本班幼儿的具体情况，创设良好的教育环境，完成教育任务。 采用以游戏为主的教学方式，对学生进行启蒙教育。 严格执行幼儿安全、卫生保健制度，指导并配合保育员管理本班幼儿生活和做好卫生保健工作，照顾学生生活。 正确评估幼儿发展。 与家长保持经常联系，了解幼儿家庭的教育环境，商讨符合幼儿特点的教育措施，共同配合完成教育任务。 参加业务学习和幼儿教育研究活动。 定期向园长汇报，接受其检查和指导。","isfollow":0},{"vctid":"VOT-588-INFO","vocatype":"教育","vocaname":"职业教育学教师","vocasummary":"教授和指导职业课程。包括函授学校教师，工业、商业以及政府机关培训教师，成人教育教师以及教会学生使用工业机器设备。教学可以在从事教育活动的公立或私立学校进行，也可在非教育性机构附属的学校中进行教学活动。","vocavista":"职业教育是我国教育事业的重要组成部分。大力发展职业教育，是提高劳动者素质，培养大量应用人才的重要途径。改革开放以来，我国的职业教育有了较大的发展，随着\u201c国家技能型人才培养培训工程\u201d、\u201c农村实用人才培训工程\u201d的逐步推进，社会对于职业技术人才的需求将继续增加，作为这些人才的主要培养者，职业教育学教师的社会需求也会随之增长，当然薪水也会随之水涨船高。","edubg":"教育学博士及以上学历。","abtmajor":"教育学,教育技术学,现代教育技术","handson":"2年以上职业教育教学工作经验。","jobcontent":"依据教学大纲的要求，明确教学目的，备课并撰写教案，制定教学实施计划，安排讲授习题、实践时间。 按照教学大纲和课程组负责人的安排，把握课程实施的深度、广度，突出重点、突破难点，重视学生能力的培养。 批改一定数量的作业，并安排适当的答疑时间，和学生进行交流，了解学生学习情况，改进教学方法。 研究教材内容和教学规律，改进教学万法，采用先进的教学手段，改进教学质量。 按照课程组负责人的安排，参与考试命题、试卷评阅、参考答案和评分标准的编写等工作，撰写课程实施情况小结。 对于学生毕业论文的选题、撰写等工作进行指导。","isfollow":0},{"vctid":"VOT-589-INFO","vocatype":"教育","vocaname":"中学教师","vocasummary":"我国的中学教师分初中教师和高中教师。初中教师为九年制义务教育服务，高中教师为高校培养预备人才。中学教师一般都在教学一线工作，教授语文、数学、外语等课程。在教学过程中，他们不仅要上课，还要作相关的备课，组织考试，答疑，管理课堂纪律等活动。中学教师不能简单地把知识传授作为自己的主要任务和目的，而应成为学生学习的激发者、辅导者、各种能力和积极个性的培养者。","vocavista":"由于教师工作具有一定的稳定性，每年有固定的两个假期，且薪水相对有保障，故在人们心目中的地位越来越高，有越来越多的人愿意从事这项职业。中国加入WTO后，随着产业结构的调整，将有数千万人需重新就业，有几亿在岗人员需要知识更新。因此，教育事业将有更大发展，教师地位将进一步提高。一般中学老师随资历的增加和工作能力的提升可以由一级教师向高级教师、特级教师方向发展。具备管理才能的老师可以晋升到学校各部门行政主管的位置，还可以向政府的教育部门寻求更有竞争力的职位。许多中学老师会在培训机构寻找兼职。","edubg":"心理学、教育学、数学、物理、化学、语文、英语等相关专业专科以上学历。","abtmajor":"教育学,心理学,应用心理学,科学教育,思想政治教育,数学与应用数学,计算机科学与技术,物理学,应用物理学,化学,应用化学书法学,地理科学,英语,生物科学,汉语言文学,历史学,世界史,体育教育,艺术教育,人文教育,华文教育,语文教育生物教育,数学教育,英语教育,语文教育,数学教育,历史教育,地理教育,英语教育,音乐教育,体育教育,美术教育,物理教育化学教育,现代教育技术,心理咨询","handson":"\u2014\u2014","jobcontent":"安排教学进度，按照大纲要求备课并作好备课笔记，按时提交教务处检查。 课堂讲课，教授所在学科知识，在条件允许的情况下尽可能采取多媒体教学、电化教学等现代化教学手段，提高授课质量。 批改和讲解学生作业。 组织考试，选择或编写考卷，批改试卷并登记学生成绩。 做好辅导、答疑工作，安排好辅导时间和地点。 对学生进行个别辅导，必要的时候进行家访，指导学生形成健康的身体和心理素质。 积极参与课程建设和课程改革，参加教学研究，不断总结和改进教学方法，跟踪本学科理论和技术发展，并运用到教学过程中。 完成教研室主任安排的其它工作。","isfollow":0},{"vctid":"VOT-590-INFO","vocatype":"教育","vocaname":"中学心理教师","vocasummary":"学校心理辅导是指，由经过专门培训的教师运用心理学和教育学的原理和方法，对在校学生的学习、适应、发展、择业等方面给予直接的指导和帮胁，并对学生中出现的一般心理问题或轻微心理障碍给予鉴别和矫治的过程。学校心理辅导员不是一般的职业，在中国，他(她)必须首先是一名教师，具备教师所应该具备的一切条件。同时，他(她)还必须具备作为一个心理辅导师所必须具备的特殊素养。他们辅导工作的主要对象是心理正常的学生，处理的问题主要是发展性问题。辅导的主要目标是帮助学生发展良好的自我，促进自我实现，解决学生心理成熟不成熟，健康不健康的问题，发展学生的判断能力，选择能力，为学生确立正确的生活方向和崇高的理想追求准备好心理基础。","vocavista":"近年来，学校心理辅导在我国发展很快。媒体报道我国中小学心理问题比率占30%，学生中有障碍性心理疾患的人占总数的1%，大多数是适应不良的发展性问题。学校心理健康教育是素质教育的基础之一，中国学校心理辅导的发展在未来将呈现出更成熟稳重的趋势，而学校心理辅导员的就业前景也将更为广阔。","edubg":"具有教育学或心理学本科以上学历者。","abtmajor":"教育学,心理学,应用心理学,华文教育,人文教育,心理咨询,心理健康教育","handson":"1年以上学生心理辅导及相关工作经验。","jobcontent":"自然聊天谈话，了解学生的生活背景和学习成绩或学业状况等。 用心倾听，稳定学生的心理情绪。 以心理测验方式或询问的方式了解学生的心理状况。 引导学生宣泄情绪，缓解心理紧张与冲突。 帮助学生理清事实，澄清其价值观念体系中的矛盾，培养其抉择能力，由学生自己作合理的判断。 心理辅导过程中作好辅导记录，录音或者笔录，但需征得来访学生的同意。 对学生的有关资料、案例予以保密，单独保管，不列入学校其他档案。 在研究和写作中需要引用学生的资料时，必须隐去可能辨认出来访学生的有关信息。 帮助学生过程中，努力动员与争取教师和家长的配合与支持，建立有利于学生发展的理性社会支持系统。 向教师和家长提供资料、建议及分析学生情况时，以保护学生、促进学生发展为出发点。","isfollow":0},{"vctid":"VOT-591-INFO","vocatype":"教育","vocaname":"中学职业教育教师","vocasummary":"职业教育教师通常包括普通教育课程教师、专业教育课程教师和实训课程教师等三大类职业性、专业性职教师资队伍。中学职业教育教师主要从事高中阶段的职业教育，其定位是在九年义务教育的基础上培养技能型人才和高素质劳动者。他们按照教育部颁布的中等职业学校文化基础课程教学大纲，进行高中文化知识教育，并根据职业岗位的要求有针对性地开设职业教育课程，传授职业知识，培养职业技能，进行职业指导，对受教育者进行思想政治教育和职业道德教育，全面提高受教育者的素质","vocavista":"近年来，伴随着国家有关经济社会以及职业教育发展改革一系列重大方针、政策的出台，伴随着我国职业教育事业的持续发展和职业教育发展战略地位的进一步确立，职业教育科学研究工作的指向更加明确，对于职业教育事业发展的推动作用日益增强专家指出，随着经济结构的调整和技术进步，我国劳动力结构将发生深刻变化，未来社会对未受过职业教育和培训的劳动力的需求将逐步减少，而对受过职业教育和培训的技能工、技术工和熟练工的需求将不断增大。职业教育教师可以内部晋升为教务处主任等行政职位，可以转向培训机构任教。在良好的职业技能支撑下，他们还可以转到企业就业。","edubg":"教育学、机电一体化、汽修与驾驶等师范类或非师范类专业专科以上学历。","abtmajor":"应用心理学,心理学,教育学,科学教育,数学与应用数学,计算机科学与技术,物理学,应用物理学,化学,应用化学,书法学地理科学,英语,生物科学,汉语言文学,历史学,世界史,体育教育,艺术教育,人文教育,华文教育,音乐教育,心理咨询生物教育,美术教育,体育教育,语文教育,数学教育,舞蹈教育,历史教育,地理教育,英语教育,音乐教育,体育教育,美术教育物理教育,化学教育,现代教育技术","handson":"\u2014\u2014","jobcontent":"教授文化基础课程，如语文、数学、英语等。 教授所在职业方向的专业知识，培养职业技能、创新精神和创业能力。 通过组织笔试和实践等方式对学生成绩进行考核。 组织学生实习，通过现场或模拟职场的真实、逼真的环境，深化和拓展专业的学习，培养学生模仿、操作、实践、制作产品的应用性能力，从而使学生顺利完成从\u201c学校到工作\u201d的过渡。 对学生进行思想政治教育和职业道德教育，培养学生的职业态度。 定期到企业进行考察、开展调研，了解企业的生产情况及其对职业教育的需求，不断改进职业学校的教育教学工作。","isfollow":0},{"vctid":"VOT-592-INFO","vocatype":"教育","vocaname":"中专职业教育教师","vocasummary":"教授与职业技能有关的课程。","vocavista":"职业教育是我国教育事业的重要组成部分。在市场经济条件下，劳动者的素质对经济、社会发展的影响日益重要，发展经济需要依靠先进的科学技术，但是，要把先进的科学技术转化为现实的生产力，还需要大量能够掌握先进技术的熟练工人。因此大力发展职业教育，是提高劳动者素质，培养大量应用人才的重要途径。改革开放以来，我国的职业教育有了较大的发展，随着\u201c国家技能型人才培养培训工程\u201d、\u201c农村实用人才培训工程\u201d的逐步推进，社会对于职业技术人才的需求将继续增加，作为这些人才的主要培养者，中专职业教育教师的社会需求也会随之增长，当然薪水也会随之水涨船高。","edubg":"教育学硕士及以上学历。","abtmajor":"教育学,教育技术学,现代教育技术","handson":"2年以上职业教育教学工作经验。","jobcontent":"教授文化基础课程，如语文、数学、英语等。 教授所在职业方向的专业知识，培养职业技能、创新精神和创业能力。 通过组织笔试和社会实践等方式对学生成绩进行考核。 组织学生实习，通过现场或模拟职场的真实、逼真的环境，深化和拓展专业的学习，培养学生模仿、操作、实践、制作产品的应用性能力，从而使学生顺利完成从\u201c学校到工作\u201d的过渡。 对学生进行思想政治教育和职业道德教育，培养学生的职业态度。 定期到企业进行考察、开展调研，了解企业的生产情况及其对职业教育的需求，不断改进职业学校的教育教学工作。","isfollow":0}]
     * value : null
     */

    private int code;
    private String msg;
    private Object value;
    private List<DataBean> data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public Object getValue() {
        return value;
    }

    public void setValue(Object value) {
        this.value = value;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * vctid : VOT-573-INFO
         * vocatype : 教育
         * vocaname : 初级职业教育教师
         * vocasummary : 在中学教授与职业技能相关的课程。
         * vocavista : 近年来，伴随着国家有关经济社会以及职业教育发展改革一系列重大方针、政策的出台，伴随着我国职业教育事业的持续发展和职业教育发展战略地位的进一步确立，职业教育科学研究工作的指向更加明确，对于职业教育事业发展的推动作用日益增强，专家指出，随着经济结构的调整和技术进步，我国劳动力结构将发生深刻变化，未来社会对未受过职业教育和培训的劳动力的需求将逐步减少，而对受过职业教育和培训的技能工、技术工和熟练工的需求将不断增大。 职业教育教师可以内部晋升为教务处主任等行政职位，可以转向培训机构任教。在良好的职业技能支撑下，他们还可以转到企业就业。
         * edubg : 高中及以上学历。
         * abtmajor : 教育学,教育技术学,艺术教育
         * handson : 2年以上相关工作经验。
         * jobcontent : 监督和指导学生正确使用和保养学习材料及器具，避免发生破毁器具的行为或由于使用不当而造成的人身伤害。 建立维护学生权益在学生行为准则，并使之生效。 采用灵活的教学方法和丰富的教学材料以满足不同学生的需求和兴趣。 采用讲座、讨论和示范等多种方法指导学生的学习。 准备课堂活动的相关材料。 根据国家法律及地方行政法规要求建立准确完整的学生档案。 为所有的课程、活动和项目制定明确的目标，并将目标传达给学生。 执行所有管理学生的政策及守则。 用电脑、视听器材等进行辅助教学。 与学生的父母或监护人、教师、辅导员和管理员一起共同解决学生的学业和行为问题。
         * isfollow : 0
         */

        private String vctid;
        private String vocatype;
        private String vocaname;
        private String vocasummary;
        private String vocavista;
        private String edubg;
        private String abtmajor;
        private String handson;
        private String jobcontent;
        private int isfollow;

        public String getVctid() {
            return vctid;
        }

        public void setVctid(String vctid) {
            this.vctid = vctid;
        }

        public String getVocatype() {
            return vocatype;
        }

        public void setVocatype(String vocatype) {
            this.vocatype = vocatype;
        }

        public String getVocaname() {
            return vocaname;
        }

        public void setVocaname(String vocaname) {
            this.vocaname = vocaname;
        }

        public String getVocasummary() {
            return vocasummary;
        }

        public void setVocasummary(String vocasummary) {
            this.vocasummary = vocasummary;
        }

        public String getVocavista() {
            return vocavista;
        }

        public void setVocavista(String vocavista) {
            this.vocavista = vocavista;
        }

        public String getEdubg() {
            return edubg;
        }

        public void setEdubg(String edubg) {
            this.edubg = edubg;
        }

        public String getAbtmajor() {
            return abtmajor;
        }

        public void setAbtmajor(String abtmajor) {
            this.abtmajor = abtmajor;
        }

        public String getHandson() {
            return handson;
        }

        public void setHandson(String handson) {
            this.handson = handson;
        }

        public String getJobcontent() {
            return jobcontent;
        }

        public void setJobcontent(String jobcontent) {
            this.jobcontent = jobcontent;
        }

        public int getIsfollow() {
            return isfollow;
        }

        public void setIsfollow(int isfollow) {
            this.isfollow = isfollow;
        }
    }
}
