package com.fchj.czglgz.chengzhangguanli_high.mysc;

import java.util.List;

public class TestsModel {

    /**
     * code : 1
     * msg : 获取专业结构成功
     * data : {"农学":{"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]},"医学":{"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]},"教育学":{"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]},"文学":{"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]},"艺术学":{"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]},"工学":{"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]},"法学":{"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]},"历史学":{"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]},"哲学":{"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]},"理学":{"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]},"经济学":{"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]},"管理学":{"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]}}
     * value : null
     */

    private int code;
    private String msg;
    private DataBean data;
    private Object value;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public Object getValue() {
        return value;
    }

    public void setValue(Object value) {
        this.value = value;
    }

    public static class DataBean {
        /**
         * 农学 : {"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]}
         * 医学 : {"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]}
         * 教育学 : {"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]}
         * 文学 : {"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]}
         * 艺术学 : {"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]}
         * 工学 : {"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]}
         * 法学 : {"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]}
         * 历史学 : {"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]}
         * 哲学 : {"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]}
         * 理学 : {"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]}
         * 经济学 : {"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]}
         * 管理学 : {"中国语言文学类":["中国少数民族语言文学","古典文献学","应用语言学","汉语国际教育","汉语言","汉语言文学","秘书学"],"测绘类":["地理国情监测","导航工程","测绘工程","遥感科学与技术"],"水利类":["水利水电工程","水务工程","水文与水资源工程","港口航道与海岸工程"],"林业工程类":["木材科学与工程","林产化工","森林工程","水质科学与技术","环保设备工程","环境工程","环境生态工程","环境科学","环境科学与工程","资源环境科学"],"海洋科学类":["军事海洋学","海洋技术","海洋科学","海洋资源与环境"],"音乐与舞蹈学类":["作曲与作曲技术理论查看详细","舞蹈学","舞蹈编导","舞蹈表演","音乐学","音乐表演"],"植物生产类":["农学","农艺教育","园艺","园艺教育","应用生物科学","植物保护","植物科学与技术","烟草","种子科学与工程","茶学","设施农业科学与工程"],"哲学类":["伦理学","哲学","宗教学","逻辑学"],"教育学类":["人文教育","华文教育","学前教育","小学教育","教育学","教育技术学","特殊教育","科学教育","艺术教育"],"海洋工程类":["海洋工程与技术","海洋资源开发技术","船舶与海洋工程"],"公安技术类":["交通管理工程","公安试听技术","刑事科学与技术","刑事科学技术","安全防范工程","抢险救援指挥与技术","核生化消防","消防工程","火灾勘查","网络安全与执法","警犬技术"],"物理学类":["声学","应用物理学","核物理","物理学"],"机械类":["工业设计","微机电系统工程","机械工程","机械工艺技术","机械电子工程","机械设计制造及其自动化","机电技术教育","材料成型及控制工程","汽车服务工程","汽车维修工程教育","测控技术与仪器","车辆工程","过程装备与控制工程"],"工业工程类":["工业工程","标准化工程","质量管理工程"],"政治学类":["国际事务与国际关系","国际政治","外交学","政治学、经济学与哲学","政治学与行政学"],"电气类":["信息工程","光源与照明","光电信息科学与工程","医学信息工程","广播电视工程","应用电子技术教育","微电子科学与工程","智能电网信息工程","水声工程","电信工程及管理","电子信息工程","电子信息科学与技术","电子封装技术","电子科学与技术","电气工程与智能控制","电气工程及其自动化","电波传播与天线","电磁场与无线技术","通信工程","集成电路设计与集成系统"],"物流管理与工程类":["物流工程","物流管理","采购管理"],"民族学类":["民族学"],"社会学类":["人类学","女性学","家政学","社会学","社会工作"],"护理学类":["护理学"],"自然保护与环境生态类":["农业资源与环境","水土保持与荒漠化防治","野生动物与自然保护区管理"],"纺织类":["服装设计与工程","服装设计与工艺教育","纺织工程","非织造材料与工程"],"新闻传播学类":["传播学","广告学","广播电视学","数字出版","新闻学","编辑出版学","网络与新媒体"],"设计学类":["产品设计","公共艺术","工艺美术","数字媒体艺术","服装与服饰设计","环境设计","艺术与科技","艺术设计学","视觉传达设计"],"草学类":["草业科学"],"基础医学类":["基础医学"],"食品科学与工程类":["乳品工程","烹饪与营养教育","粮食工程","葡萄与葡萄酒工程","酿酒工程","食品科学与工程","食品营养与检验教育","食品质量与安全"],"医学技术类":["医学实验技术","医学影像技术","医学检验技术","医学生物技术","医学美容技术","卫生检验与检疫","卫生检验与检疫技术","口腔医学技术","听力与言语康复学","呼吸治疗技术","康复治疗学","放射治疗技术","眼视光学","眼视光技术"],"建筑类学":["历史建筑保护工程","城乡规划","建筑学","风景园林"],"化学类":["分子科学与工程","化学","化学生物学","应用化学"],"体育学类":["休闲体育","体育教育","武术与民族传统体育","社会体育指导与管理","运动人体学","运动康复","运动训练"],"矿业类":["油气储运工程","海洋油气工程","石油工程","矿物加工工程","矿物资源工程","采矿工程"],"工商管理类":["人力资源管理","会计学","体育经济与管理","劳动关系","品牌代理经营","商务管理","商检技术","国际商务","审计学","工商企业管理","工商管理","市场管理与服务","市场营销","市场营销教育","文化产业管理","物业管理","财务会计教育","财务管理","资产评估","连锁经营管理"],"统计学类":["应用统计学","统计学"],"公共管理类":["交通管理","人力资源管理","公共事业管理","公共事务管理","公共关系学","劳动与社会保障","土地资源管理","城市管理","民政管理","海事管理","海关管理","知识产权管理","网络舆情监测","行政管理","质量管理与认证"],"中药学类":["中草药栽培与鉴定","中药制药","中药学","中药资源与开发","蒙药学","藏药学"],"生物科学类":["生态学","生物信息学","生物技术","生物科学"],"旅游管理类":["会展经济与管理","旅游管理","旅游管理与服务教育","酒店管理"],"外国语言文学类":["世界语","丹麦语","乌克兰语","乌孜别克语","乌尔都语","俄语","保加利亚语","僧伽罗语","克罗地亚语","冰岛语","匈牙利语","印地语","印度尼西亚语","哈萨克语","商务英语","土耳其语","塞尔维亚语","孟加拉语","尼泊尔语","希伯来语","希腊语","德语","意大利语","拉丁语","拉脱维亚语","挪威语","捷克语","斯洛伐克语","斯洛文尼亚语","斯瓦希里语","日语","普什图语","朝鲜语","柬埔寨语","梵语巴利语","法语","波兰语","波斯语","泰米尔语","泰语","爱尔兰语","爱沙尼亚语","瑞典语","祖鲁语","立陶宛语","缅甸语","罗纳尼亚语","翻译","老挝语","芬兰语","英语","荷兰语","菲律宾语","葡萄牙语","蒙古语","西班牙语","豪萨语","越南语","阿尔巴尼亚语","阿拉伯语","马来语","马耳他语"],"动物生产类":["动物科学","蚕学","蜂学"],"林学类":["园林","林学","森林保护"],"安全科学与工程类":["安全工程"],"交通运输类":["交通工程","交通设备与控制工程","交通运输","救助与打捞工程","航海技术","船舶电子电气工程","轮机工程","飞行技术"],"地球物理学类":["地球物理学","空间科学与技术"],"大气科学类":["大气科学","应用气象学"],"经济学类":["商务经济学","国民经济管理","经济学","经济统计学","能源经济","资源与环境经济学"],"历史学类":["世界史","历史学","外国语言与外国历史","文物与博物馆学","文物保护技术","考古学"],"农业工程类":["农业工程","农业建筑环境与能源工程","农业机械化及其自动化","农业水利工程","农业电气化"],"材料类":["冶金工程","功能材料","复合材料与工程","宝石及材料工艺学","新能源材料与器件","无机非金属材料工程","材料化学","材料物理","材料科学与工程","焊接技术与工程","粉体材料科学与工程","纳米材料与技术","金属材料工程","高分子材料与工程"],"计算机类":["云计算技术与应用","信息安全","信息安全与管理","动漫制作技术","嵌入式技术与应用","数字媒体应用技术","数字媒体技术","数字展示技术","智能科学与技术","物联网工程","电子与计算机工程","电子商务技术","移动应用开发","空间信息与数字技术","网络工程","计算机信息管理","计算机应用技术","计算机科学与技术","计算机系统与维护","计算机网络技术","软件与信息服务","软件工程","软件技术"],"天文学类":["天文学"],"中西医结合类":["中西医临床医学"],"图书情报与档案管理类":["信息资源管理","图书馆学","档案学"],"水产类":["水产养殖学","水族科学与技术","海洋渔业科学与技术"],"化工与制药类":["制药工程","化学工程与工业生物工程","化学工程与工艺","能源化学工程","资源循环科学与工程"],"数学类":["信息与计算科学","数学与应用数学","数理基础科学"],"中医学类":["中医学","哈医学","壮医学","维医学","蒙医学","藏医学","针灸推拿学"],"法学类":["法学","监狱学","知识产权"],"公共卫生与预防医学类":["全球健康学","卫生监督","妇幼保健医学","预防医学","食品卫生与营养学"],"马克思主义理论类":["中国共产党历史","思想政治教育","科学社会主义"],"电子商务类":["电子商务","电子商务及法律","移动商务","网络营销"],"经济与贸易类":["国际经济与贸易","贸易经济"],"生物医学工程类":["假肢矫形工程","生物医学工程"],"公安学类":["侦查学","公安情报学","公安管理学","国内安全保卫","治安学","消防指挥","涉外警务","犯罪学","禁毒学","经济犯罪侦查","警务指挥与战术","警卫学","警犬技术","边防指挥","边防管理"],"戏剧与影视学类":["动画","广播电视编导","录音艺术","影视摄影与制作","戏剧学","戏剧影视导演","戏剧影视文学","戏剧影视美术设计","播音与主持艺术","电影学","表演"],"轻工类":["包装工程","印刷工程","轻化工程"],"艺术学理论类":["艺术史论查看详细"],"地质类":["勘查技术与工程","地下水科学与工程","地球物理勘探技术","地质工程","地质灾害调查与防治","岩土工程技术","工程地质勘查","水文与工程地质","环境地质工程","矿山地质","资源勘查工程","钻探技术"],"财政学类":["税收学","财政学"],"金融学类":["保险学","信用管理","投资学","经济与金融","金融学","金融工程","金融数学"],"动物医学类":["动植物检疫","动物医学","动物药学"],"地理科学类":["人文地理与城乡规划","地理信息科学","地理科学","自然地理与资源环境"],"能源动力类":["新能源科学与工程","能源与动力工程","能源与环境系统工程"],"土木类":["土木工程","城市地下空间工程","建筑环境与能源应用工程","建筑电气与智能化","给排水科学与工程","道路桥梁与渡河工程"],"法医学类":["法医学"],"自动化类":["工业机器人技术","工业网络技术","工业自动化仪表","工业过程自动化技术","智能控制技术","机电一体化技术","液压与气动技术","电梯工程技术","电气自动化技术","自动化","轨道交通信号与控制"],"航空航天类":["航空航天工程","飞行器制造工程","飞行器动力工程","飞行器环境与生命保障工程","飞行器设计与工程","飞行器质量与可靠性","飞行器适航技术"],"生物工程类":["生物制药","生物工程"],"力学类":["工程力学","理论与应用力学"],"核工程类":["工程物理","核化工与核燃料工程","核工程与核技术","辐射防护与核安全"],"地质学类":["古生物学","地球信息科学与技术","地球化学","地质学"],"口腔医学类":["口腔医学"],"兵器类":["信息对抗技术","弹药工程与爆炸技术","探测制导与控制技术","武器发射工程","武器系统与工程","特种能源技术与工程","装甲车辆工程"],"农业经济管理类":["农村区域发展","农林经济管理"],"管理科学与工程类":["保密管理","信息管理与信息系统","工程管理","工程造价","房地产开发与管理","管理科学"],"临床医学类":["中医学","中医骨伤","临床医学","傣医学","医学影像学","口腔医学","哈医学","放射医学","眼视光医学","精神医学","维医学","蒙医学","藏医学","针灸推拿","麻醉学"],"药学类":["中药学","临床药学","海洋药学","维药学","药事管理","药学","药物分析","药物制剂","药物化学","蒙药学","藏药学"],"美术学类":["中国画","书法学","摄影","绘画","美术学","雕塑"],"心理学类":["应用心理学","心理学"]}
         */

        private 农学Bean 农学;
        private 医学Bean 医学;
        private 教育学Bean 教育学;
        private 文学Bean 文学;
        private 艺术学Bean 艺术学;
        private 工学Bean 工学;
        private 法学Bean 法学;
        private 历史学Bean 历史学;
        private 哲学Bean 哲学;
        private 理学Bean 理学;
        private 经济学Bean 经济学;
        private 管理学Bean 管理学;

        public 农学Bean get农学() {
            return 农学;
        }

        public void set农学(农学Bean 农学) {
            this.农学 = 农学;
        }

        public 医学Bean get医学() {
            return 医学;
        }

        public void set医学(医学Bean 医学) {
            this.医学 = 医学;
        }

        public 教育学Bean get教育学() {
            return 教育学;
        }

        public void set教育学(教育学Bean 教育学) {
            this.教育学 = 教育学;
        }

        public 文学Bean get文学() {
            return 文学;
        }

        public void set文学(文学Bean 文学) {
            this.文学 = 文学;
        }

        public 艺术学Bean get艺术学() {
            return 艺术学;
        }

        public void set艺术学(艺术学Bean 艺术学) {
            this.艺术学 = 艺术学;
        }

        public 工学Bean get工学() {
            return 工学;
        }

        public void set工学(工学Bean 工学) {
            this.工学 = 工学;
        }

        public 法学Bean get法学() {
            return 法学;
        }

        public void set法学(法学Bean 法学) {
            this.法学 = 法学;
        }

        public 历史学Bean get历史学() {
            return 历史学;
        }

        public void set历史学(历史学Bean 历史学) {
            this.历史学 = 历史学;
        }

        public 哲学Bean get哲学() {
            return 哲学;
        }

        public void set哲学(哲学Bean 哲学) {
            this.哲学 = 哲学;
        }

        public 理学Bean get理学() {
            return 理学;
        }

        public void set理学(理学Bean 理学) {
            this.理学 = 理学;
        }

        public 经济学Bean get经济学() {
            return 经济学;
        }

        public void set经济学(经济学Bean 经济学) {
            this.经济学 = 经济学;
        }

        public 管理学Bean get管理学() {
            return 管理学;
        }

        public void set管理学(管理学Bean 管理学) {
            this.管理学 = 管理学;
        }

        public static class 农学Bean {
            private List<String> 中国语言文学类;
            private List<String> 测绘类;
            private List<String> 水利类;
            private List<String> 林业工程类;
            private List<String> 海洋科学类;
            private List<String> 音乐与舞蹈学类;
            private List<String> 植物生产类;
            private List<String> 哲学类;
            private List<String> 教育学类;
            private List<String> 海洋工程类;
            private List<String> 公安技术类;
            private List<String> 物理学类;
            private List<String> 机械类;
            private List<String> 工业工程类;
            private List<String> 政治学类;
            private List<String> 电气类;
            private List<String> 物流管理与工程类;
            private List<String> 民族学类;
            private List<String> 社会学类;
            private List<String> 护理学类;
            private List<String> 自然保护与环境生态类;
            private List<String> 纺织类;
            private List<String> 新闻传播学类;
            private List<String> 设计学类;
            private List<String> 草学类;
            private List<String> 基础医学类;
            private List<String> 食品科学与工程类;
            private List<String> 医学技术类;
            private List<String> 建筑类学;
            private List<String> 化学类;
            private List<String> 体育学类;
            private List<String> 矿业类;
            private List<String> 工商管理类;
            private List<String> 统计学类;
            private List<String> 公共管理类;
            private List<String> 中药学类;
            private List<String> 生物科学类;
            private List<String> 旅游管理类;
            private List<String> 外国语言文学类;
            private List<String> 动物生产类;
            private List<String> 林学类;
            private List<String> 安全科学与工程类;
            private List<String> 交通运输类;
            private List<String> 地球物理学类;
            private List<String> 大气科学类;
            private List<String> 经济学类;
            private List<String> 历史学类;
            private List<String> 农业工程类;
            private List<String> 材料类;
            private List<String> 计算机类;
            private List<String> 天文学类;
            private List<String> 中西医结合类;
            private List<String> 图书情报与档案管理类;
            private List<String> 水产类;
            private List<String> 化工与制药类;
            private List<String> 数学类;
            private List<String> 中医学类;
            private List<String> 法学类;
            private List<String> 公共卫生与预防医学类;
            private List<String> 马克思主义理论类;
            private List<String> 电子商务类;
            private List<String> 经济与贸易类;
            private List<String> 生物医学工程类;
            private List<String> 公安学类;
            private List<String> 戏剧与影视学类;
            private List<String> 轻工类;
            private List<String> 艺术学理论类;
            private List<String> 地质类;
            private List<String> 财政学类;
            private List<String> 金融学类;
            private List<String> 动物医学类;
            private List<String> 地理科学类;
            private List<String> 能源动力类;
            private List<String> 土木类;
            private List<String> 法医学类;
            private List<String> 自动化类;
            private List<String> 航空航天类;
            private List<String> 生物工程类;
            private List<String> 力学类;
            private List<String> 核工程类;
            private List<String> 地质学类;
            private List<String> 口腔医学类;
            private List<String> 兵器类;
            private List<String> 农业经济管理类;
            private List<String> 管理科学与工程类;
            private List<String> 临床医学类;
            private List<String> 药学类;
            private List<String> 美术学类;
            private List<String> 心理学类;

            public List<String> get中国语言文学类() {
                return 中国语言文学类;
            }

            public void set中国语言文学类(List<String> 中国语言文学类) {
                this.中国语言文学类 = 中国语言文学类;
            }

            public List<String> get测绘类() {
                return 测绘类;
            }

            public void set测绘类(List<String> 测绘类) {
                this.测绘类 = 测绘类;
            }

            public List<String> get水利类() {
                return 水利类;
            }

            public void set水利类(List<String> 水利类) {
                this.水利类 = 水利类;
            }

            public List<String> get林业工程类() {
                return 林业工程类;
            }

            public void set林业工程类(List<String> 林业工程类) {
                this.林业工程类 = 林业工程类;
            }

            public List<String> get海洋科学类() {
                return 海洋科学类;
            }

            public void set海洋科学类(List<String> 海洋科学类) {
                this.海洋科学类 = 海洋科学类;
            }

            public List<String> get音乐与舞蹈学类() {
                return 音乐与舞蹈学类;
            }

            public void set音乐与舞蹈学类(List<String> 音乐与舞蹈学类) {
                this.音乐与舞蹈学类 = 音乐与舞蹈学类;
            }

            public List<String> get植物生产类() {
                return 植物生产类;
            }

            public void set植物生产类(List<String> 植物生产类) {
                this.植物生产类 = 植物生产类;
            }

            public List<String> get哲学类() {
                return 哲学类;
            }

            public void set哲学类(List<String> 哲学类) {
                this.哲学类 = 哲学类;
            }

            public List<String> get教育学类() {
                return 教育学类;
            }

            public void set教育学类(List<String> 教育学类) {
                this.教育学类 = 教育学类;
            }

            public List<String> get海洋工程类() {
                return 海洋工程类;
            }

            public void set海洋工程类(List<String> 海洋工程类) {
                this.海洋工程类 = 海洋工程类;
            }

            public List<String> get公安技术类() {
                return 公安技术类;
            }

            public void set公安技术类(List<String> 公安技术类) {
                this.公安技术类 = 公安技术类;
            }

            public List<String> get物理学类() {
                return 物理学类;
            }

            public void set物理学类(List<String> 物理学类) {
                this.物理学类 = 物理学类;
            }

            public List<String> get机械类() {
                return 机械类;
            }

            public void set机械类(List<String> 机械类) {
                this.机械类 = 机械类;
            }

            public List<String> get工业工程类() {
                return 工业工程类;
            }

            public void set工业工程类(List<String> 工业工程类) {
                this.工业工程类 = 工业工程类;
            }

            public List<String> get政治学类() {
                return 政治学类;
            }

            public void set政治学类(List<String> 政治学类) {
                this.政治学类 = 政治学类;
            }

            public List<String> get电气类() {
                return 电气类;
            }

            public void set电气类(List<String> 电气类) {
                this.电气类 = 电气类;
            }

            public List<String> get物流管理与工程类() {
                return 物流管理与工程类;
            }

            public void set物流管理与工程类(List<String> 物流管理与工程类) {
                this.物流管理与工程类 = 物流管理与工程类;
            }

            public List<String> get民族学类() {
                return 民族学类;
            }

            public void set民族学类(List<String> 民族学类) {
                this.民族学类 = 民族学类;
            }

            public List<String> get社会学类() {
                return 社会学类;
            }

            public void set社会学类(List<String> 社会学类) {
                this.社会学类 = 社会学类;
            }

            public List<String> get护理学类() {
                return 护理学类;
            }

            public void set护理学类(List<String> 护理学类) {
                this.护理学类 = 护理学类;
            }

            public List<String> get自然保护与环境生态类() {
                return 自然保护与环境生态类;
            }

            public void set自然保护与环境生态类(List<String> 自然保护与环境生态类) {
                this.自然保护与环境生态类 = 自然保护与环境生态类;
            }

            public List<String> get纺织类() {
                return 纺织类;
            }

            public void set纺织类(List<String> 纺织类) {
                this.纺织类 = 纺织类;
            }

            public List<String> get新闻传播学类() {
                return 新闻传播学类;
            }

            public void set新闻传播学类(List<String> 新闻传播学类) {
                this.新闻传播学类 = 新闻传播学类;
            }

            public List<String> get设计学类() {
                return 设计学类;
            }

            public void set设计学类(List<String> 设计学类) {
                this.设计学类 = 设计学类;
            }

            public List<String> get草学类() {
                return 草学类;
            }

            public void set草学类(List<String> 草学类) {
                this.草学类 = 草学类;
            }

            public List<String> get基础医学类() {
                return 基础医学类;
            }

            public void set基础医学类(List<String> 基础医学类) {
                this.基础医学类 = 基础医学类;
            }

            public List<String> get食品科学与工程类() {
                return 食品科学与工程类;
            }

            public void set食品科学与工程类(List<String> 食品科学与工程类) {
                this.食品科学与工程类 = 食品科学与工程类;
            }

            public List<String> get医学技术类() {
                return 医学技术类;
            }

            public void set医学技术类(List<String> 医学技术类) {
                this.医学技术类 = 医学技术类;
            }

            public List<String> get建筑类学() {
                return 建筑类学;
            }

            public void set建筑类学(List<String> 建筑类学) {
                this.建筑类学 = 建筑类学;
            }

            public List<String> get化学类() {
                return 化学类;
            }

            public void set化学类(List<String> 化学类) {
                this.化学类 = 化学类;
            }

            public List<String> get体育学类() {
                return 体育学类;
            }

            public void set体育学类(List<String> 体育学类) {
                this.体育学类 = 体育学类;
            }

            public List<String> get矿业类() {
                return 矿业类;
            }

            public void set矿业类(List<String> 矿业类) {
                this.矿业类 = 矿业类;
            }

            public List<String> get工商管理类() {
                return 工商管理类;
            }

            public void set工商管理类(List<String> 工商管理类) {
                this.工商管理类 = 工商管理类;
            }

            public List<String> get统计学类() {
                return 统计学类;
            }

            public void set统计学类(List<String> 统计学类) {
                this.统计学类 = 统计学类;
            }

            public List<String> get公共管理类() {
                return 公共管理类;
            }

            public void set公共管理类(List<String> 公共管理类) {
                this.公共管理类 = 公共管理类;
            }

            public List<String> get中药学类() {
                return 中药学类;
            }

            public void set中药学类(List<String> 中药学类) {
                this.中药学类 = 中药学类;
            }

            public List<String> get生物科学类() {
                return 生物科学类;
            }

            public void set生物科学类(List<String> 生物科学类) {
                this.生物科学类 = 生物科学类;
            }

            public List<String> get旅游管理类() {
                return 旅游管理类;
            }

            public void set旅游管理类(List<String> 旅游管理类) {
                this.旅游管理类 = 旅游管理类;
            }

            public List<String> get外国语言文学类() {
                return 外国语言文学类;
            }

            public void set外国语言文学类(List<String> 外国语言文学类) {
                this.外国语言文学类 = 外国语言文学类;
            }

            public List<String> get动物生产类() {
                return 动物生产类;
            }

            public void set动物生产类(List<String> 动物生产类) {
                this.动物生产类 = 动物生产类;
            }

            public List<String> get林学类() {
                return 林学类;
            }

            public void set林学类(List<String> 林学类) {
                this.林学类 = 林学类;
            }

            public List<String> get安全科学与工程类() {
                return 安全科学与工程类;
            }

            public void set安全科学与工程类(List<String> 安全科学与工程类) {
                this.安全科学与工程类 = 安全科学与工程类;
            }

            public List<String> get交通运输类() {
                return 交通运输类;
            }

            public void set交通运输类(List<String> 交通运输类) {
                this.交通运输类 = 交通运输类;
            }

            public List<String> get地球物理学类() {
                return 地球物理学类;
            }

            public void set地球物理学类(List<String> 地球物理学类) {
                this.地球物理学类 = 地球物理学类;
            }

            public List<String> get大气科学类() {
                return 大气科学类;
            }

            public void set大气科学类(List<String> 大气科学类) {
                this.大气科学类 = 大气科学类;
            }

            public List<String> get经济学类() {
                return 经济学类;
            }

            public void set经济学类(List<String> 经济学类) {
                this.经济学类 = 经济学类;
            }

            public List<String> get历史学类() {
                return 历史学类;
            }

            public void set历史学类(List<String> 历史学类) {
                this.历史学类 = 历史学类;
            }

            public List<String> get农业工程类() {
                return 农业工程类;
            }

            public void set农业工程类(List<String> 农业工程类) {
                this.农业工程类 = 农业工程类;
            }

            public List<String> get材料类() {
                return 材料类;
            }

            public void set材料类(List<String> 材料类) {
                this.材料类 = 材料类;
            }

            public List<String> get计算机类() {
                return 计算机类;
            }

            public void set计算机类(List<String> 计算机类) {
                this.计算机类 = 计算机类;
            }

            public List<String> get天文学类() {
                return 天文学类;
            }

            public void set天文学类(List<String> 天文学类) {
                this.天文学类 = 天文学类;
            }

            public List<String> get中西医结合类() {
                return 中西医结合类;
            }

            public void set中西医结合类(List<String> 中西医结合类) {
                this.中西医结合类 = 中西医结合类;
            }

            public List<String> get图书情报与档案管理类() {
                return 图书情报与档案管理类;
            }

            public void set图书情报与档案管理类(List<String> 图书情报与档案管理类) {
                this.图书情报与档案管理类 = 图书情报与档案管理类;
            }

            public List<String> get水产类() {
                return 水产类;
            }

            public void set水产类(List<String> 水产类) {
                this.水产类 = 水产类;
            }

            public List<String> get化工与制药类() {
                return 化工与制药类;
            }

            public void set化工与制药类(List<String> 化工与制药类) {
                this.化工与制药类 = 化工与制药类;
            }

            public List<String> get数学类() {
                return 数学类;
            }

            public void set数学类(List<String> 数学类) {
                this.数学类 = 数学类;
            }

            public List<String> get中医学类() {
                return 中医学类;
            }

            public void set中医学类(List<String> 中医学类) {
                this.中医学类 = 中医学类;
            }

            public List<String> get法学类() {
                return 法学类;
            }

            public void set法学类(List<String> 法学类) {
                this.法学类 = 法学类;
            }

            public List<String> get公共卫生与预防医学类() {
                return 公共卫生与预防医学类;
            }

            public void set公共卫生与预防医学类(List<String> 公共卫生与预防医学类) {
                this.公共卫生与预防医学类 = 公共卫生与预防医学类;
            }

            public List<String> get马克思主义理论类() {
                return 马克思主义理论类;
            }

            public void set马克思主义理论类(List<String> 马克思主义理论类) {
                this.马克思主义理论类 = 马克思主义理论类;
            }

            public List<String> get电子商务类() {
                return 电子商务类;
            }

            public void set电子商务类(List<String> 电子商务类) {
                this.电子商务类 = 电子商务类;
            }

            public List<String> get经济与贸易类() {
                return 经济与贸易类;
            }

            public void set经济与贸易类(List<String> 经济与贸易类) {
                this.经济与贸易类 = 经济与贸易类;
            }

            public List<String> get生物医学工程类() {
                return 生物医学工程类;
            }

            public void set生物医学工程类(List<String> 生物医学工程类) {
                this.生物医学工程类 = 生物医学工程类;
            }

            public List<String> get公安学类() {
                return 公安学类;
            }

            public void set公安学类(List<String> 公安学类) {
                this.公安学类 = 公安学类;
            }

            public List<String> get戏剧与影视学类() {
                return 戏剧与影视学类;
            }

            public void set戏剧与影视学类(List<String> 戏剧与影视学类) {
                this.戏剧与影视学类 = 戏剧与影视学类;
            }

            public List<String> get轻工类() {
                return 轻工类;
            }

            public void set轻工类(List<String> 轻工类) {
                this.轻工类 = 轻工类;
            }

            public List<String> get艺术学理论类() {
                return 艺术学理论类;
            }

            public void set艺术学理论类(List<String> 艺术学理论类) {
                this.艺术学理论类 = 艺术学理论类;
            }

            public List<String> get地质类() {
                return 地质类;
            }

            public void set地质类(List<String> 地质类) {
                this.地质类 = 地质类;
            }

            public List<String> get财政学类() {
                return 财政学类;
            }

            public void set财政学类(List<String> 财政学类) {
                this.财政学类 = 财政学类;
            }

            public List<String> get金融学类() {
                return 金融学类;
            }

            public void set金融学类(List<String> 金融学类) {
                this.金融学类 = 金融学类;
            }

            public List<String> get动物医学类() {
                return 动物医学类;
            }

            public void set动物医学类(List<String> 动物医学类) {
                this.动物医学类 = 动物医学类;
            }

            public List<String> get地理科学类() {
                return 地理科学类;
            }

            public void set地理科学类(List<String> 地理科学类) {
                this.地理科学类 = 地理科学类;
            }

            public List<String> get能源动力类() {
                return 能源动力类;
            }

            public void set能源动力类(List<String> 能源动力类) {
                this.能源动力类 = 能源动力类;
            }

            public List<String> get土木类() {
                return 土木类;
            }

            public void set土木类(List<String> 土木类) {
                this.土木类 = 土木类;
            }

            public List<String> get法医学类() {
                return 法医学类;
            }

            public void set法医学类(List<String> 法医学类) {
                this.法医学类 = 法医学类;
            }

            public List<String> get自动化类() {
                return 自动化类;
            }

            public void set自动化类(List<String> 自动化类) {
                this.自动化类 = 自动化类;
            }

            public List<String> get航空航天类() {
                return 航空航天类;
            }

            public void set航空航天类(List<String> 航空航天类) {
                this.航空航天类 = 航空航天类;
            }

            public List<String> get生物工程类() {
                return 生物工程类;
            }

            public void set生物工程类(List<String> 生物工程类) {
                this.生物工程类 = 生物工程类;
            }

            public List<String> get力学类() {
                return 力学类;
            }

            public void set力学类(List<String> 力学类) {
                this.力学类 = 力学类;
            }

            public List<String> get核工程类() {
                return 核工程类;
            }

            public void set核工程类(List<String> 核工程类) {
                this.核工程类 = 核工程类;
            }

            public List<String> get地质学类() {
                return 地质学类;
            }

            public void set地质学类(List<String> 地质学类) {
                this.地质学类 = 地质学类;
            }

            public List<String> get口腔医学类() {
                return 口腔医学类;
            }

            public void set口腔医学类(List<String> 口腔医学类) {
                this.口腔医学类 = 口腔医学类;
            }

            public List<String> get兵器类() {
                return 兵器类;
            }

            public void set兵器类(List<String> 兵器类) {
                this.兵器类 = 兵器类;
            }

            public List<String> get农业经济管理类() {
                return 农业经济管理类;
            }

            public void set农业经济管理类(List<String> 农业经济管理类) {
                this.农业经济管理类 = 农业经济管理类;
            }

            public List<String> get管理科学与工程类() {
                return 管理科学与工程类;
            }

            public void set管理科学与工程类(List<String> 管理科学与工程类) {
                this.管理科学与工程类 = 管理科学与工程类;
            }

            public List<String> get临床医学类() {
                return 临床医学类;
            }

            public void set临床医学类(List<String> 临床医学类) {
                this.临床医学类 = 临床医学类;
            }

            public List<String> get药学类() {
                return 药学类;
            }

            public void set药学类(List<String> 药学类) {
                this.药学类 = 药学类;
            }

            public List<String> get美术学类() {
                return 美术学类;
            }

            public void set美术学类(List<String> 美术学类) {
                this.美术学类 = 美术学类;
            }

            public List<String> get心理学类() {
                return 心理学类;
            }

            public void set心理学类(List<String> 心理学类) {
                this.心理学类 = 心理学类;
            }
        }

        public static class 医学Bean {
            private List<String> 中国语言文学类;
            private List<String> 测绘类;
            private List<String> 水利类;
            private List<String> 林业工程类;
            private List<String> 海洋科学类;
            private List<String> 音乐与舞蹈学类;
            private List<String> 植物生产类;
            private List<String> 哲学类;
            private List<String> 教育学类;
            private List<String> 海洋工程类;
            private List<String> 公安技术类;
            private List<String> 物理学类;
            private List<String> 机械类;
            private List<String> 工业工程类;
            private List<String> 政治学类;
            private List<String> 电气类;
            private List<String> 物流管理与工程类;
            private List<String> 民族学类;
            private List<String> 社会学类;
            private List<String> 护理学类;
            private List<String> 自然保护与环境生态类;
            private List<String> 纺织类;
            private List<String> 新闻传播学类;
            private List<String> 设计学类;
            private List<String> 草学类;
            private List<String> 基础医学类;
            private List<String> 食品科学与工程类;
            private List<String> 医学技术类;
            private List<String> 建筑类学;
            private List<String> 化学类;
            private List<String> 体育学类;
            private List<String> 矿业类;
            private List<String> 工商管理类;
            private List<String> 统计学类;
            private List<String> 公共管理类;
            private List<String> 中药学类;
            private List<String> 生物科学类;
            private List<String> 旅游管理类;
            private List<String> 外国语言文学类;
            private List<String> 动物生产类;
            private List<String> 林学类;
            private List<String> 安全科学与工程类;
            private List<String> 交通运输类;
            private List<String> 地球物理学类;
            private List<String> 大气科学类;
            private List<String> 经济学类;
            private List<String> 历史学类;
            private List<String> 农业工程类;
            private List<String> 材料类;
            private List<String> 计算机类;
            private List<String> 天文学类;
            private List<String> 中西医结合类;
            private List<String> 图书情报与档案管理类;
            private List<String> 水产类;
            private List<String> 化工与制药类;
            private List<String> 数学类;
            private List<String> 中医学类;
            private List<String> 法学类;
            private List<String> 公共卫生与预防医学类;
            private List<String> 马克思主义理论类;
            private List<String> 电子商务类;
            private List<String> 经济与贸易类;
            private List<String> 生物医学工程类;
            private List<String> 公安学类;
            private List<String> 戏剧与影视学类;
            private List<String> 轻工类;
            private List<String> 艺术学理论类;
            private List<String> 地质类;
            private List<String> 财政学类;
            private List<String> 金融学类;
            private List<String> 动物医学类;
            private List<String> 地理科学类;
            private List<String> 能源动力类;
            private List<String> 土木类;
            private List<String> 法医学类;
            private List<String> 自动化类;
            private List<String> 航空航天类;
            private List<String> 生物工程类;
            private List<String> 力学类;
            private List<String> 核工程类;
            private List<String> 地质学类;
            private List<String> 口腔医学类;
            private List<String> 兵器类;
            private List<String> 农业经济管理类;
            private List<String> 管理科学与工程类;
            private List<String> 临床医学类;
            private List<String> 药学类;
            private List<String> 美术学类;
            private List<String> 心理学类;

            public List<String> get中国语言文学类() {
                return 中国语言文学类;
            }

            public void set中国语言文学类(List<String> 中国语言文学类) {
                this.中国语言文学类 = 中国语言文学类;
            }

            public List<String> get测绘类() {
                return 测绘类;
            }

            public void set测绘类(List<String> 测绘类) {
                this.测绘类 = 测绘类;
            }

            public List<String> get水利类() {
                return 水利类;
            }

            public void set水利类(List<String> 水利类) {
                this.水利类 = 水利类;
            }

            public List<String> get林业工程类() {
                return 林业工程类;
            }

            public void set林业工程类(List<String> 林业工程类) {
                this.林业工程类 = 林业工程类;
            }

            public List<String> get海洋科学类() {
                return 海洋科学类;
            }

            public void set海洋科学类(List<String> 海洋科学类) {
                this.海洋科学类 = 海洋科学类;
            }

            public List<String> get音乐与舞蹈学类() {
                return 音乐与舞蹈学类;
            }

            public void set音乐与舞蹈学类(List<String> 音乐与舞蹈学类) {
                this.音乐与舞蹈学类 = 音乐与舞蹈学类;
            }

            public List<String> get植物生产类() {
                return 植物生产类;
            }

            public void set植物生产类(List<String> 植物生产类) {
                this.植物生产类 = 植物生产类;
            }

            public List<String> get哲学类() {
                return 哲学类;
            }

            public void set哲学类(List<String> 哲学类) {
                this.哲学类 = 哲学类;
            }

            public List<String> get教育学类() {
                return 教育学类;
            }

            public void set教育学类(List<String> 教育学类) {
                this.教育学类 = 教育学类;
            }

            public List<String> get海洋工程类() {
                return 海洋工程类;
            }

            public void set海洋工程类(List<String> 海洋工程类) {
                this.海洋工程类 = 海洋工程类;
            }

            public List<String> get公安技术类() {
                return 公安技术类;
            }

            public void set公安技术类(List<String> 公安技术类) {
                this.公安技术类 = 公安技术类;
            }

            public List<String> get物理学类() {
                return 物理学类;
            }

            public void set物理学类(List<String> 物理学类) {
                this.物理学类 = 物理学类;
            }

            public List<String> get机械类() {
                return 机械类;
            }

            public void set机械类(List<String> 机械类) {
                this.机械类 = 机械类;
            }

            public List<String> get工业工程类() {
                return 工业工程类;
            }

            public void set工业工程类(List<String> 工业工程类) {
                this.工业工程类 = 工业工程类;
            }

            public List<String> get政治学类() {
                return 政治学类;
            }

            public void set政治学类(List<String> 政治学类) {
                this.政治学类 = 政治学类;
            }

            public List<String> get电气类() {
                return 电气类;
            }

            public void set电气类(List<String> 电气类) {
                this.电气类 = 电气类;
            }

            public List<String> get物流管理与工程类() {
                return 物流管理与工程类;
            }

            public void set物流管理与工程类(List<String> 物流管理与工程类) {
                this.物流管理与工程类 = 物流管理与工程类;
            }

            public List<String> get民族学类() {
                return 民族学类;
            }

            public void set民族学类(List<String> 民族学类) {
                this.民族学类 = 民族学类;
            }

            public List<String> get社会学类() {
                return 社会学类;
            }

            public void set社会学类(List<String> 社会学类) {
                this.社会学类 = 社会学类;
            }

            public List<String> get护理学类() {
                return 护理学类;
            }

            public void set护理学类(List<String> 护理学类) {
                this.护理学类 = 护理学类;
            }

            public List<String> get自然保护与环境生态类() {
                return 自然保护与环境生态类;
            }

            public void set自然保护与环境生态类(List<String> 自然保护与环境生态类) {
                this.自然保护与环境生态类 = 自然保护与环境生态类;
            }

            public List<String> get纺织类() {
                return 纺织类;
            }

            public void set纺织类(List<String> 纺织类) {
                this.纺织类 = 纺织类;
            }

            public List<String> get新闻传播学类() {
                return 新闻传播学类;
            }

            public void set新闻传播学类(List<String> 新闻传播学类) {
                this.新闻传播学类 = 新闻传播学类;
            }

            public List<String> get设计学类() {
                return 设计学类;
            }

            public void set设计学类(List<String> 设计学类) {
                this.设计学类 = 设计学类;
            }

            public List<String> get草学类() {
                return 草学类;
            }

            public void set草学类(List<String> 草学类) {
                this.草学类 = 草学类;
            }

            public List<String> get基础医学类() {
                return 基础医学类;
            }

            public void set基础医学类(List<String> 基础医学类) {
                this.基础医学类 = 基础医学类;
            }

            public List<String> get食品科学与工程类() {
                return 食品科学与工程类;
            }

            public void set食品科学与工程类(List<String> 食品科学与工程类) {
                this.食品科学与工程类 = 食品科学与工程类;
            }

            public List<String> get医学技术类() {
                return 医学技术类;
            }

            public void set医学技术类(List<String> 医学技术类) {
                this.医学技术类 = 医学技术类;
            }

            public List<String> get建筑类学() {
                return 建筑类学;
            }

            public void set建筑类学(List<String> 建筑类学) {
                this.建筑类学 = 建筑类学;
            }

            public List<String> get化学类() {
                return 化学类;
            }

            public void set化学类(List<String> 化学类) {
                this.化学类 = 化学类;
            }

            public List<String> get体育学类() {
                return 体育学类;
            }

            public void set体育学类(List<String> 体育学类) {
                this.体育学类 = 体育学类;
            }

            public List<String> get矿业类() {
                return 矿业类;
            }

            public void set矿业类(List<String> 矿业类) {
                this.矿业类 = 矿业类;
            }

            public List<String> get工商管理类() {
                return 工商管理类;
            }

            public void set工商管理类(List<String> 工商管理类) {
                this.工商管理类 = 工商管理类;
            }

            public List<String> get统计学类() {
                return 统计学类;
            }

            public void set统计学类(List<String> 统计学类) {
                this.统计学类 = 统计学类;
            }

            public List<String> get公共管理类() {
                return 公共管理类;
            }

            public void set公共管理类(List<String> 公共管理类) {
                this.公共管理类 = 公共管理类;
            }

            public List<String> get中药学类() {
                return 中药学类;
            }

            public void set中药学类(List<String> 中药学类) {
                this.中药学类 = 中药学类;
            }

            public List<String> get生物科学类() {
                return 生物科学类;
            }

            public void set生物科学类(List<String> 生物科学类) {
                this.生物科学类 = 生物科学类;
            }

            public List<String> get旅游管理类() {
                return 旅游管理类;
            }

            public void set旅游管理类(List<String> 旅游管理类) {
                this.旅游管理类 = 旅游管理类;
            }

            public List<String> get外国语言文学类() {
                return 外国语言文学类;
            }

            public void set外国语言文学类(List<String> 外国语言文学类) {
                this.外国语言文学类 = 外国语言文学类;
            }

            public List<String> get动物生产类() {
                return 动物生产类;
            }

            public void set动物生产类(List<String> 动物生产类) {
                this.动物生产类 = 动物生产类;
            }

            public List<String> get林学类() {
                return 林学类;
            }

            public void set林学类(List<String> 林学类) {
                this.林学类 = 林学类;
            }

            public List<String> get安全科学与工程类() {
                return 安全科学与工程类;
            }

            public void set安全科学与工程类(List<String> 安全科学与工程类) {
                this.安全科学与工程类 = 安全科学与工程类;
            }

            public List<String> get交通运输类() {
                return 交通运输类;
            }

            public void set交通运输类(List<String> 交通运输类) {
                this.交通运输类 = 交通运输类;
            }

            public List<String> get地球物理学类() {
                return 地球物理学类;
            }

            public void set地球物理学类(List<String> 地球物理学类) {
                this.地球物理学类 = 地球物理学类;
            }

            public List<String> get大气科学类() {
                return 大气科学类;
            }

            public void set大气科学类(List<String> 大气科学类) {
                this.大气科学类 = 大气科学类;
            }

            public List<String> get经济学类() {
                return 经济学类;
            }

            public void set经济学类(List<String> 经济学类) {
                this.经济学类 = 经济学类;
            }

            public List<String> get历史学类() {
                return 历史学类;
            }

            public void set历史学类(List<String> 历史学类) {
                this.历史学类 = 历史学类;
            }

            public List<String> get农业工程类() {
                return 农业工程类;
            }

            public void set农业工程类(List<String> 农业工程类) {
                this.农业工程类 = 农业工程类;
            }

            public List<String> get材料类() {
                return 材料类;
            }

            public void set材料类(List<String> 材料类) {
                this.材料类 = 材料类;
            }

            public List<String> get计算机类() {
                return 计算机类;
            }

            public void set计算机类(List<String> 计算机类) {
                this.计算机类 = 计算机类;
            }

            public List<String> get天文学类() {
                return 天文学类;
            }

            public void set天文学类(List<String> 天文学类) {
                this.天文学类 = 天文学类;
            }

            public List<String> get中西医结合类() {
                return 中西医结合类;
            }

            public void set中西医结合类(List<String> 中西医结合类) {
                this.中西医结合类 = 中西医结合类;
            }

            public List<String> get图书情报与档案管理类() {
                return 图书情报与档案管理类;
            }

            public void set图书情报与档案管理类(List<String> 图书情报与档案管理类) {
                this.图书情报与档案管理类 = 图书情报与档案管理类;
            }

            public List<String> get水产类() {
                return 水产类;
            }

            public void set水产类(List<String> 水产类) {
                this.水产类 = 水产类;
            }

            public List<String> get化工与制药类() {
                return 化工与制药类;
            }

            public void set化工与制药类(List<String> 化工与制药类) {
                this.化工与制药类 = 化工与制药类;
            }

            public List<String> get数学类() {
                return 数学类;
            }

            public void set数学类(List<String> 数学类) {
                this.数学类 = 数学类;
            }

            public List<String> get中医学类() {
                return 中医学类;
            }

            public void set中医学类(List<String> 中医学类) {
                this.中医学类 = 中医学类;
            }

            public List<String> get法学类() {
                return 法学类;
            }

            public void set法学类(List<String> 法学类) {
                this.法学类 = 法学类;
            }

            public List<String> get公共卫生与预防医学类() {
                return 公共卫生与预防医学类;
            }

            public void set公共卫生与预防医学类(List<String> 公共卫生与预防医学类) {
                this.公共卫生与预防医学类 = 公共卫生与预防医学类;
            }

            public List<String> get马克思主义理论类() {
                return 马克思主义理论类;
            }

            public void set马克思主义理论类(List<String> 马克思主义理论类) {
                this.马克思主义理论类 = 马克思主义理论类;
            }

            public List<String> get电子商务类() {
                return 电子商务类;
            }

            public void set电子商务类(List<String> 电子商务类) {
                this.电子商务类 = 电子商务类;
            }

            public List<String> get经济与贸易类() {
                return 经济与贸易类;
            }

            public void set经济与贸易类(List<String> 经济与贸易类) {
                this.经济与贸易类 = 经济与贸易类;
            }

            public List<String> get生物医学工程类() {
                return 生物医学工程类;
            }

            public void set生物医学工程类(List<String> 生物医学工程类) {
                this.生物医学工程类 = 生物医学工程类;
            }

            public List<String> get公安学类() {
                return 公安学类;
            }

            public void set公安学类(List<String> 公安学类) {
                this.公安学类 = 公安学类;
            }

            public List<String> get戏剧与影视学类() {
                return 戏剧与影视学类;
            }

            public void set戏剧与影视学类(List<String> 戏剧与影视学类) {
                this.戏剧与影视学类 = 戏剧与影视学类;
            }

            public List<String> get轻工类() {
                return 轻工类;
            }

            public void set轻工类(List<String> 轻工类) {
                this.轻工类 = 轻工类;
            }

            public List<String> get艺术学理论类() {
                return 艺术学理论类;
            }

            public void set艺术学理论类(List<String> 艺术学理论类) {
                this.艺术学理论类 = 艺术学理论类;
            }

            public List<String> get地质类() {
                return 地质类;
            }

            public void set地质类(List<String> 地质类) {
                this.地质类 = 地质类;
            }

            public List<String> get财政学类() {
                return 财政学类;
            }

            public void set财政学类(List<String> 财政学类) {
                this.财政学类 = 财政学类;
            }

            public List<String> get金融学类() {
                return 金融学类;
            }

            public void set金融学类(List<String> 金融学类) {
                this.金融学类 = 金融学类;
            }

            public List<String> get动物医学类() {
                return 动物医学类;
            }

            public void set动物医学类(List<String> 动物医学类) {
                this.动物医学类 = 动物医学类;
            }

            public List<String> get地理科学类() {
                return 地理科学类;
            }

            public void set地理科学类(List<String> 地理科学类) {
                this.地理科学类 = 地理科学类;
            }

            public List<String> get能源动力类() {
                return 能源动力类;
            }

            public void set能源动力类(List<String> 能源动力类) {
                this.能源动力类 = 能源动力类;
            }

            public List<String> get土木类() {
                return 土木类;
            }

            public void set土木类(List<String> 土木类) {
                this.土木类 = 土木类;
            }

            public List<String> get法医学类() {
                return 法医学类;
            }

            public void set法医学类(List<String> 法医学类) {
                this.法医学类 = 法医学类;
            }

            public List<String> get自动化类() {
                return 自动化类;
            }

            public void set自动化类(List<String> 自动化类) {
                this.自动化类 = 自动化类;
            }

            public List<String> get航空航天类() {
                return 航空航天类;
            }

            public void set航空航天类(List<String> 航空航天类) {
                this.航空航天类 = 航空航天类;
            }

            public List<String> get生物工程类() {
                return 生物工程类;
            }

            public void set生物工程类(List<String> 生物工程类) {
                this.生物工程类 = 生物工程类;
            }

            public List<String> get力学类() {
                return 力学类;
            }

            public void set力学类(List<String> 力学类) {
                this.力学类 = 力学类;
            }

            public List<String> get核工程类() {
                return 核工程类;
            }

            public void set核工程类(List<String> 核工程类) {
                this.核工程类 = 核工程类;
            }

            public List<String> get地质学类() {
                return 地质学类;
            }

            public void set地质学类(List<String> 地质学类) {
                this.地质学类 = 地质学类;
            }

            public List<String> get口腔医学类() {
                return 口腔医学类;
            }

            public void set口腔医学类(List<String> 口腔医学类) {
                this.口腔医学类 = 口腔医学类;
            }

            public List<String> get兵器类() {
                return 兵器类;
            }

            public void set兵器类(List<String> 兵器类) {
                this.兵器类 = 兵器类;
            }

            public List<String> get农业经济管理类() {
                return 农业经济管理类;
            }

            public void set农业经济管理类(List<String> 农业经济管理类) {
                this.农业经济管理类 = 农业经济管理类;
            }

            public List<String> get管理科学与工程类() {
                return 管理科学与工程类;
            }

            public void set管理科学与工程类(List<String> 管理科学与工程类) {
                this.管理科学与工程类 = 管理科学与工程类;
            }

            public List<String> get临床医学类() {
                return 临床医学类;
            }

            public void set临床医学类(List<String> 临床医学类) {
                this.临床医学类 = 临床医学类;
            }

            public List<String> get药学类() {
                return 药学类;
            }

            public void set药学类(List<String> 药学类) {
                this.药学类 = 药学类;
            }

            public List<String> get美术学类() {
                return 美术学类;
            }

            public void set美术学类(List<String> 美术学类) {
                this.美术学类 = 美术学类;
            }

            public List<String> get心理学类() {
                return 心理学类;
            }

            public void set心理学类(List<String> 心理学类) {
                this.心理学类 = 心理学类;
            }
        }

        public static class 教育学Bean {
            private List<String> 中国语言文学类;
            private List<String> 测绘类;
            private List<String> 水利类;
            private List<String> 林业工程类;
            private List<String> 海洋科学类;
            private List<String> 音乐与舞蹈学类;
            private List<String> 植物生产类;
            private List<String> 哲学类;
            private List<String> 教育学类;
            private List<String> 海洋工程类;
            private List<String> 公安技术类;
            private List<String> 物理学类;
            private List<String> 机械类;
            private List<String> 工业工程类;
            private List<String> 政治学类;
            private List<String> 电气类;
            private List<String> 物流管理与工程类;
            private List<String> 民族学类;
            private List<String> 社会学类;
            private List<String> 护理学类;
            private List<String> 自然保护与环境生态类;
            private List<String> 纺织类;
            private List<String> 新闻传播学类;
            private List<String> 设计学类;
            private List<String> 草学类;
            private List<String> 基础医学类;
            private List<String> 食品科学与工程类;
            private List<String> 医学技术类;
            private List<String> 建筑类学;
            private List<String> 化学类;
            private List<String> 体育学类;
            private List<String> 矿业类;
            private List<String> 工商管理类;
            private List<String> 统计学类;
            private List<String> 公共管理类;
            private List<String> 中药学类;
            private List<String> 生物科学类;
            private List<String> 旅游管理类;
            private List<String> 外国语言文学类;
            private List<String> 动物生产类;
            private List<String> 林学类;
            private List<String> 安全科学与工程类;
            private List<String> 交通运输类;
            private List<String> 地球物理学类;
            private List<String> 大气科学类;
            private List<String> 经济学类;
            private List<String> 历史学类;
            private List<String> 农业工程类;
            private List<String> 材料类;
            private List<String> 计算机类;
            private List<String> 天文学类;
            private List<String> 中西医结合类;
            private List<String> 图书情报与档案管理类;
            private List<String> 水产类;
            private List<String> 化工与制药类;
            private List<String> 数学类;
            private List<String> 中医学类;
            private List<String> 法学类;
            private List<String> 公共卫生与预防医学类;
            private List<String> 马克思主义理论类;
            private List<String> 电子商务类;
            private List<String> 经济与贸易类;
            private List<String> 生物医学工程类;
            private List<String> 公安学类;
            private List<String> 戏剧与影视学类;
            private List<String> 轻工类;
            private List<String> 艺术学理论类;
            private List<String> 地质类;
            private List<String> 财政学类;
            private List<String> 金融学类;
            private List<String> 动物医学类;
            private List<String> 地理科学类;
            private List<String> 能源动力类;
            private List<String> 土木类;
            private List<String> 法医学类;
            private List<String> 自动化类;
            private List<String> 航空航天类;
            private List<String> 生物工程类;
            private List<String> 力学类;
            private List<String> 核工程类;
            private List<String> 地质学类;
            private List<String> 口腔医学类;
            private List<String> 兵器类;
            private List<String> 农业经济管理类;
            private List<String> 管理科学与工程类;
            private List<String> 临床医学类;
            private List<String> 药学类;
            private List<String> 美术学类;
            private List<String> 心理学类;

            public List<String> get中国语言文学类() {
                return 中国语言文学类;
            }

            public void set中国语言文学类(List<String> 中国语言文学类) {
                this.中国语言文学类 = 中国语言文学类;
            }

            public List<String> get测绘类() {
                return 测绘类;
            }

            public void set测绘类(List<String> 测绘类) {
                this.测绘类 = 测绘类;
            }

            public List<String> get水利类() {
                return 水利类;
            }

            public void set水利类(List<String> 水利类) {
                this.水利类 = 水利类;
            }

            public List<String> get林业工程类() {
                return 林业工程类;
            }

            public void set林业工程类(List<String> 林业工程类) {
                this.林业工程类 = 林业工程类;
            }

            public List<String> get海洋科学类() {
                return 海洋科学类;
            }

            public void set海洋科学类(List<String> 海洋科学类) {
                this.海洋科学类 = 海洋科学类;
            }

            public List<String> get音乐与舞蹈学类() {
                return 音乐与舞蹈学类;
            }

            public void set音乐与舞蹈学类(List<String> 音乐与舞蹈学类) {
                this.音乐与舞蹈学类 = 音乐与舞蹈学类;
            }

            public List<String> get植物生产类() {
                return 植物生产类;
            }

            public void set植物生产类(List<String> 植物生产类) {
                this.植物生产类 = 植物生产类;
            }

            public List<String> get哲学类() {
                return 哲学类;
            }

            public void set哲学类(List<String> 哲学类) {
                this.哲学类 = 哲学类;
            }

            public List<String> get教育学类() {
                return 教育学类;
            }

            public void set教育学类(List<String> 教育学类) {
                this.教育学类 = 教育学类;
            }

            public List<String> get海洋工程类() {
                return 海洋工程类;
            }

            public void set海洋工程类(List<String> 海洋工程类) {
                this.海洋工程类 = 海洋工程类;
            }

            public List<String> get公安技术类() {
                return 公安技术类;
            }

            public void set公安技术类(List<String> 公安技术类) {
                this.公安技术类 = 公安技术类;
            }

            public List<String> get物理学类() {
                return 物理学类;
            }

            public void set物理学类(List<String> 物理学类) {
                this.物理学类 = 物理学类;
            }

            public List<String> get机械类() {
                return 机械类;
            }

            public void set机械类(List<String> 机械类) {
                this.机械类 = 机械类;
            }

            public List<String> get工业工程类() {
                return 工业工程类;
            }

            public void set工业工程类(List<String> 工业工程类) {
                this.工业工程类 = 工业工程类;
            }

            public List<String> get政治学类() {
                return 政治学类;
            }

            public void set政治学类(List<String> 政治学类) {
                this.政治学类 = 政治学类;
            }

            public List<String> get电气类() {
                return 电气类;
            }

            public void set电气类(List<String> 电气类) {
                this.电气类 = 电气类;
            }

            public List<String> get物流管理与工程类() {
                return 物流管理与工程类;
            }

            public void set物流管理与工程类(List<String> 物流管理与工程类) {
                this.物流管理与工程类 = 物流管理与工程类;
            }

            public List<String> get民族学类() {
                return 民族学类;
            }

            public void set民族学类(List<String> 民族学类) {
                this.民族学类 = 民族学类;
            }

            public List<String> get社会学类() {
                return 社会学类;
            }

            public void set社会学类(List<String> 社会学类) {
                this.社会学类 = 社会学类;
            }

            public List<String> get护理学类() {
                return 护理学类;
            }

            public void set护理学类(List<String> 护理学类) {
                this.护理学类 = 护理学类;
            }

            public List<String> get自然保护与环境生态类() {
                return 自然保护与环境生态类;
            }

            public void set自然保护与环境生态类(List<String> 自然保护与环境生态类) {
                this.自然保护与环境生态类 = 自然保护与环境生态类;
            }

            public List<String> get纺织类() {
                return 纺织类;
            }

            public void set纺织类(List<String> 纺织类) {
                this.纺织类 = 纺织类;
            }

            public List<String> get新闻传播学类() {
                return 新闻传播学类;
            }

            public void set新闻传播学类(List<String> 新闻传播学类) {
                this.新闻传播学类 = 新闻传播学类;
            }

            public List<String> get设计学类() {
                return 设计学类;
            }

            public void set设计学类(List<String> 设计学类) {
                this.设计学类 = 设计学类;
            }

            public List<String> get草学类() {
                return 草学类;
            }

            public void set草学类(List<String> 草学类) {
                this.草学类 = 草学类;
            }

            public List<String> get基础医学类() {
                return 基础医学类;
            }

            public void set基础医学类(List<String> 基础医学类) {
                this.基础医学类 = 基础医学类;
            }

            public List<String> get食品科学与工程类() {
                return 食品科学与工程类;
            }

            public void set食品科学与工程类(List<String> 食品科学与工程类) {
                this.食品科学与工程类 = 食品科学与工程类;
            }

            public List<String> get医学技术类() {
                return 医学技术类;
            }

            public void set医学技术类(List<String> 医学技术类) {
                this.医学技术类 = 医学技术类;
            }

            public List<String> get建筑类学() {
                return 建筑类学;
            }

            public void set建筑类学(List<String> 建筑类学) {
                this.建筑类学 = 建筑类学;
            }

            public List<String> get化学类() {
                return 化学类;
            }

            public void set化学类(List<String> 化学类) {
                this.化学类 = 化学类;
            }

            public List<String> get体育学类() {
                return 体育学类;
            }

            public void set体育学类(List<String> 体育学类) {
                this.体育学类 = 体育学类;
            }

            public List<String> get矿业类() {
                return 矿业类;
            }

            public void set矿业类(List<String> 矿业类) {
                this.矿业类 = 矿业类;
            }

            public List<String> get工商管理类() {
                return 工商管理类;
            }

            public void set工商管理类(List<String> 工商管理类) {
                this.工商管理类 = 工商管理类;
            }

            public List<String> get统计学类() {
                return 统计学类;
            }

            public void set统计学类(List<String> 统计学类) {
                this.统计学类 = 统计学类;
            }

            public List<String> get公共管理类() {
                return 公共管理类;
            }

            public void set公共管理类(List<String> 公共管理类) {
                this.公共管理类 = 公共管理类;
            }

            public List<String> get中药学类() {
                return 中药学类;
            }

            public void set中药学类(List<String> 中药学类) {
                this.中药学类 = 中药学类;
            }

            public List<String> get生物科学类() {
                return 生物科学类;
            }

            public void set生物科学类(List<String> 生物科学类) {
                this.生物科学类 = 生物科学类;
            }

            public List<String> get旅游管理类() {
                return 旅游管理类;
            }

            public void set旅游管理类(List<String> 旅游管理类) {
                this.旅游管理类 = 旅游管理类;
            }

            public List<String> get外国语言文学类() {
                return 外国语言文学类;
            }

            public void set外国语言文学类(List<String> 外国语言文学类) {
                this.外国语言文学类 = 外国语言文学类;
            }

            public List<String> get动物生产类() {
                return 动物生产类;
            }

            public void set动物生产类(List<String> 动物生产类) {
                this.动物生产类 = 动物生产类;
            }

            public List<String> get林学类() {
                return 林学类;
            }

            public void set林学类(List<String> 林学类) {
                this.林学类 = 林学类;
            }

            public List<String> get安全科学与工程类() {
                return 安全科学与工程类;
            }

            public void set安全科学与工程类(List<String> 安全科学与工程类) {
                this.安全科学与工程类 = 安全科学与工程类;
            }

            public List<String> get交通运输类() {
                return 交通运输类;
            }

            public void set交通运输类(List<String> 交通运输类) {
                this.交通运输类 = 交通运输类;
            }

            public List<String> get地球物理学类() {
                return 地球物理学类;
            }

            public void set地球物理学类(List<String> 地球物理学类) {
                this.地球物理学类 = 地球物理学类;
            }

            public List<String> get大气科学类() {
                return 大气科学类;
            }

            public void set大气科学类(List<String> 大气科学类) {
                this.大气科学类 = 大气科学类;
            }

            public List<String> get经济学类() {
                return 经济学类;
            }

            public void set经济学类(List<String> 经济学类) {
                this.经济学类 = 经济学类;
            }

            public List<String> get历史学类() {
                return 历史学类;
            }

            public void set历史学类(List<String> 历史学类) {
                this.历史学类 = 历史学类;
            }

            public List<String> get农业工程类() {
                return 农业工程类;
            }

            public void set农业工程类(List<String> 农业工程类) {
                this.农业工程类 = 农业工程类;
            }

            public List<String> get材料类() {
                return 材料类;
            }

            public void set材料类(List<String> 材料类) {
                this.材料类 = 材料类;
            }

            public List<String> get计算机类() {
                return 计算机类;
            }

            public void set计算机类(List<String> 计算机类) {
                this.计算机类 = 计算机类;
            }

            public List<String> get天文学类() {
                return 天文学类;
            }

            public void set天文学类(List<String> 天文学类) {
                this.天文学类 = 天文学类;
            }

            public List<String> get中西医结合类() {
                return 中西医结合类;
            }

            public void set中西医结合类(List<String> 中西医结合类) {
                this.中西医结合类 = 中西医结合类;
            }

            public List<String> get图书情报与档案管理类() {
                return 图书情报与档案管理类;
            }

            public void set图书情报与档案管理类(List<String> 图书情报与档案管理类) {
                this.图书情报与档案管理类 = 图书情报与档案管理类;
            }

            public List<String> get水产类() {
                return 水产类;
            }

            public void set水产类(List<String> 水产类) {
                this.水产类 = 水产类;
            }

            public List<String> get化工与制药类() {
                return 化工与制药类;
            }

            public void set化工与制药类(List<String> 化工与制药类) {
                this.化工与制药类 = 化工与制药类;
            }

            public List<String> get数学类() {
                return 数学类;
            }

            public void set数学类(List<String> 数学类) {
                this.数学类 = 数学类;
            }

            public List<String> get中医学类() {
                return 中医学类;
            }

            public void set中医学类(List<String> 中医学类) {
                this.中医学类 = 中医学类;
            }

            public List<String> get法学类() {
                return 法学类;
            }

            public void set法学类(List<String> 法学类) {
                this.法学类 = 法学类;
            }

            public List<String> get公共卫生与预防医学类() {
                return 公共卫生与预防医学类;
            }

            public void set公共卫生与预防医学类(List<String> 公共卫生与预防医学类) {
                this.公共卫生与预防医学类 = 公共卫生与预防医学类;
            }

            public List<String> get马克思主义理论类() {
                return 马克思主义理论类;
            }

            public void set马克思主义理论类(List<String> 马克思主义理论类) {
                this.马克思主义理论类 = 马克思主义理论类;
            }

            public List<String> get电子商务类() {
                return 电子商务类;
            }

            public void set电子商务类(List<String> 电子商务类) {
                this.电子商务类 = 电子商务类;
            }

            public List<String> get经济与贸易类() {
                return 经济与贸易类;
            }

            public void set经济与贸易类(List<String> 经济与贸易类) {
                this.经济与贸易类 = 经济与贸易类;
            }

            public List<String> get生物医学工程类() {
                return 生物医学工程类;
            }

            public void set生物医学工程类(List<String> 生物医学工程类) {
                this.生物医学工程类 = 生物医学工程类;
            }

            public List<String> get公安学类() {
                return 公安学类;
            }

            public void set公安学类(List<String> 公安学类) {
                this.公安学类 = 公安学类;
            }

            public List<String> get戏剧与影视学类() {
                return 戏剧与影视学类;
            }

            public void set戏剧与影视学类(List<String> 戏剧与影视学类) {
                this.戏剧与影视学类 = 戏剧与影视学类;
            }

            public List<String> get轻工类() {
                return 轻工类;
            }

            public void set轻工类(List<String> 轻工类) {
                this.轻工类 = 轻工类;
            }

            public List<String> get艺术学理论类() {
                return 艺术学理论类;
            }

            public void set艺术学理论类(List<String> 艺术学理论类) {
                this.艺术学理论类 = 艺术学理论类;
            }

            public List<String> get地质类() {
                return 地质类;
            }

            public void set地质类(List<String> 地质类) {
                this.地质类 = 地质类;
            }

            public List<String> get财政学类() {
                return 财政学类;
            }

            public void set财政学类(List<String> 财政学类) {
                this.财政学类 = 财政学类;
            }

            public List<String> get金融学类() {
                return 金融学类;
            }

            public void set金融学类(List<String> 金融学类) {
                this.金融学类 = 金融学类;
            }

            public List<String> get动物医学类() {
                return 动物医学类;
            }

            public void set动物医学类(List<String> 动物医学类) {
                this.动物医学类 = 动物医学类;
            }

            public List<String> get地理科学类() {
                return 地理科学类;
            }

            public void set地理科学类(List<String> 地理科学类) {
                this.地理科学类 = 地理科学类;
            }

            public List<String> get能源动力类() {
                return 能源动力类;
            }

            public void set能源动力类(List<String> 能源动力类) {
                this.能源动力类 = 能源动力类;
            }

            public List<String> get土木类() {
                return 土木类;
            }

            public void set土木类(List<String> 土木类) {
                this.土木类 = 土木类;
            }

            public List<String> get法医学类() {
                return 法医学类;
            }

            public void set法医学类(List<String> 法医学类) {
                this.法医学类 = 法医学类;
            }

            public List<String> get自动化类() {
                return 自动化类;
            }

            public void set自动化类(List<String> 自动化类) {
                this.自动化类 = 自动化类;
            }

            public List<String> get航空航天类() {
                return 航空航天类;
            }

            public void set航空航天类(List<String> 航空航天类) {
                this.航空航天类 = 航空航天类;
            }

            public List<String> get生物工程类() {
                return 生物工程类;
            }

            public void set生物工程类(List<String> 生物工程类) {
                this.生物工程类 = 生物工程类;
            }

            public List<String> get力学类() {
                return 力学类;
            }

            public void set力学类(List<String> 力学类) {
                this.力学类 = 力学类;
            }

            public List<String> get核工程类() {
                return 核工程类;
            }

            public void set核工程类(List<String> 核工程类) {
                this.核工程类 = 核工程类;
            }

            public List<String> get地质学类() {
                return 地质学类;
            }

            public void set地质学类(List<String> 地质学类) {
                this.地质学类 = 地质学类;
            }

            public List<String> get口腔医学类() {
                return 口腔医学类;
            }

            public void set口腔医学类(List<String> 口腔医学类) {
                this.口腔医学类 = 口腔医学类;
            }

            public List<String> get兵器类() {
                return 兵器类;
            }

            public void set兵器类(List<String> 兵器类) {
                this.兵器类 = 兵器类;
            }

            public List<String> get农业经济管理类() {
                return 农业经济管理类;
            }

            public void set农业经济管理类(List<String> 农业经济管理类) {
                this.农业经济管理类 = 农业经济管理类;
            }

            public List<String> get管理科学与工程类() {
                return 管理科学与工程类;
            }

            public void set管理科学与工程类(List<String> 管理科学与工程类) {
                this.管理科学与工程类 = 管理科学与工程类;
            }

            public List<String> get临床医学类() {
                return 临床医学类;
            }

            public void set临床医学类(List<String> 临床医学类) {
                this.临床医学类 = 临床医学类;
            }

            public List<String> get药学类() {
                return 药学类;
            }

            public void set药学类(List<String> 药学类) {
                this.药学类 = 药学类;
            }

            public List<String> get美术学类() {
                return 美术学类;
            }

            public void set美术学类(List<String> 美术学类) {
                this.美术学类 = 美术学类;
            }

            public List<String> get心理学类() {
                return 心理学类;
            }

            public void set心理学类(List<String> 心理学类) {
                this.心理学类 = 心理学类;
            }
        }

        public static class 文学Bean {
            private List<String> 中国语言文学类;
            private List<String> 测绘类;
            private List<String> 水利类;
            private List<String> 林业工程类;
            private List<String> 海洋科学类;
            private List<String> 音乐与舞蹈学类;
            private List<String> 植物生产类;
            private List<String> 哲学类;
            private List<String> 教育学类;
            private List<String> 海洋工程类;
            private List<String> 公安技术类;
            private List<String> 物理学类;
            private List<String> 机械类;
            private List<String> 工业工程类;
            private List<String> 政治学类;
            private List<String> 电气类;
            private List<String> 物流管理与工程类;
            private List<String> 民族学类;
            private List<String> 社会学类;
            private List<String> 护理学类;
            private List<String> 自然保护与环境生态类;
            private List<String> 纺织类;
            private List<String> 新闻传播学类;
            private List<String> 设计学类;
            private List<String> 草学类;
            private List<String> 基础医学类;
            private List<String> 食品科学与工程类;
            private List<String> 医学技术类;
            private List<String> 建筑类学;
            private List<String> 化学类;
            private List<String> 体育学类;
            private List<String> 矿业类;
            private List<String> 工商管理类;
            private List<String> 统计学类;
            private List<String> 公共管理类;
            private List<String> 中药学类;
            private List<String> 生物科学类;
            private List<String> 旅游管理类;
            private List<String> 外国语言文学类;
            private List<String> 动物生产类;
            private List<String> 林学类;
            private List<String> 安全科学与工程类;
            private List<String> 交通运输类;
            private List<String> 地球物理学类;
            private List<String> 大气科学类;
            private List<String> 经济学类;
            private List<String> 历史学类;
            private List<String> 农业工程类;
            private List<String> 材料类;
            private List<String> 计算机类;
            private List<String> 天文学类;
            private List<String> 中西医结合类;
            private List<String> 图书情报与档案管理类;
            private List<String> 水产类;
            private List<String> 化工与制药类;
            private List<String> 数学类;
            private List<String> 中医学类;
            private List<String> 法学类;
            private List<String> 公共卫生与预防医学类;
            private List<String> 马克思主义理论类;
            private List<String> 电子商务类;
            private List<String> 经济与贸易类;
            private List<String> 生物医学工程类;
            private List<String> 公安学类;
            private List<String> 戏剧与影视学类;
            private List<String> 轻工类;
            private List<String> 艺术学理论类;
            private List<String> 地质类;
            private List<String> 财政学类;
            private List<String> 金融学类;
            private List<String> 动物医学类;
            private List<String> 地理科学类;
            private List<String> 能源动力类;
            private List<String> 土木类;
            private List<String> 法医学类;
            private List<String> 自动化类;
            private List<String> 航空航天类;
            private List<String> 生物工程类;
            private List<String> 力学类;
            private List<String> 核工程类;
            private List<String> 地质学类;
            private List<String> 口腔医学类;
            private List<String> 兵器类;
            private List<String> 农业经济管理类;
            private List<String> 管理科学与工程类;
            private List<String> 临床医学类;
            private List<String> 药学类;
            private List<String> 美术学类;
            private List<String> 心理学类;

            public List<String> get中国语言文学类() {
                return 中国语言文学类;
            }

            public void set中国语言文学类(List<String> 中国语言文学类) {
                this.中国语言文学类 = 中国语言文学类;
            }

            public List<String> get测绘类() {
                return 测绘类;
            }

            public void set测绘类(List<String> 测绘类) {
                this.测绘类 = 测绘类;
            }

            public List<String> get水利类() {
                return 水利类;
            }

            public void set水利类(List<String> 水利类) {
                this.水利类 = 水利类;
            }

            public List<String> get林业工程类() {
                return 林业工程类;
            }

            public void set林业工程类(List<String> 林业工程类) {
                this.林业工程类 = 林业工程类;
            }

            public List<String> get海洋科学类() {
                return 海洋科学类;
            }

            public void set海洋科学类(List<String> 海洋科学类) {
                this.海洋科学类 = 海洋科学类;
            }

            public List<String> get音乐与舞蹈学类() {
                return 音乐与舞蹈学类;
            }

            public void set音乐与舞蹈学类(List<String> 音乐与舞蹈学类) {
                this.音乐与舞蹈学类 = 音乐与舞蹈学类;
            }

            public List<String> get植物生产类() {
                return 植物生产类;
            }

            public void set植物生产类(List<String> 植物生产类) {
                this.植物生产类 = 植物生产类;
            }

            public List<String> get哲学类() {
                return 哲学类;
            }

            public void set哲学类(List<String> 哲学类) {
                this.哲学类 = 哲学类;
            }

            public List<String> get教育学类() {
                return 教育学类;
            }

            public void set教育学类(List<String> 教育学类) {
                this.教育学类 = 教育学类;
            }

            public List<String> get海洋工程类() {
                return 海洋工程类;
            }

            public void set海洋工程类(List<String> 海洋工程类) {
                this.海洋工程类 = 海洋工程类;
            }

            public List<String> get公安技术类() {
                return 公安技术类;
            }

            public void set公安技术类(List<String> 公安技术类) {
                this.公安技术类 = 公安技术类;
            }

            public List<String> get物理学类() {
                return 物理学类;
            }

            public void set物理学类(List<String> 物理学类) {
                this.物理学类 = 物理学类;
            }

            public List<String> get机械类() {
                return 机械类;
            }

            public void set机械类(List<String> 机械类) {
                this.机械类 = 机械类;
            }

            public List<String> get工业工程类() {
                return 工业工程类;
            }

            public void set工业工程类(List<String> 工业工程类) {
                this.工业工程类 = 工业工程类;
            }

            public List<String> get政治学类() {
                return 政治学类;
            }

            public void set政治学类(List<String> 政治学类) {
                this.政治学类 = 政治学类;
            }

            public List<String> get电气类() {
                return 电气类;
            }

            public void set电气类(List<String> 电气类) {
                this.电气类 = 电气类;
            }

            public List<String> get物流管理与工程类() {
                return 物流管理与工程类;
            }

            public void set物流管理与工程类(List<String> 物流管理与工程类) {
                this.物流管理与工程类 = 物流管理与工程类;
            }

            public List<String> get民族学类() {
                return 民族学类;
            }

            public void set民族学类(List<String> 民族学类) {
                this.民族学类 = 民族学类;
            }

            public List<String> get社会学类() {
                return 社会学类;
            }

            public void set社会学类(List<String> 社会学类) {
                this.社会学类 = 社会学类;
            }

            public List<String> get护理学类() {
                return 护理学类;
            }

            public void set护理学类(List<String> 护理学类) {
                this.护理学类 = 护理学类;
            }

            public List<String> get自然保护与环境生态类() {
                return 自然保护与环境生态类;
            }

            public void set自然保护与环境生态类(List<String> 自然保护与环境生态类) {
                this.自然保护与环境生态类 = 自然保护与环境生态类;
            }

            public List<String> get纺织类() {
                return 纺织类;
            }

            public void set纺织类(List<String> 纺织类) {
                this.纺织类 = 纺织类;
            }

            public List<String> get新闻传播学类() {
                return 新闻传播学类;
            }

            public void set新闻传播学类(List<String> 新闻传播学类) {
                this.新闻传播学类 = 新闻传播学类;
            }

            public List<String> get设计学类() {
                return 设计学类;
            }

            public void set设计学类(List<String> 设计学类) {
                this.设计学类 = 设计学类;
            }

            public List<String> get草学类() {
                return 草学类;
            }

            public void set草学类(List<String> 草学类) {
                this.草学类 = 草学类;
            }

            public List<String> get基础医学类() {
                return 基础医学类;
            }

            public void set基础医学类(List<String> 基础医学类) {
                this.基础医学类 = 基础医学类;
            }

            public List<String> get食品科学与工程类() {
                return 食品科学与工程类;
            }

            public void set食品科学与工程类(List<String> 食品科学与工程类) {
                this.食品科学与工程类 = 食品科学与工程类;
            }

            public List<String> get医学技术类() {
                return 医学技术类;
            }

            public void set医学技术类(List<String> 医学技术类) {
                this.医学技术类 = 医学技术类;
            }

            public List<String> get建筑类学() {
                return 建筑类学;
            }

            public void set建筑类学(List<String> 建筑类学) {
                this.建筑类学 = 建筑类学;
            }

            public List<String> get化学类() {
                return 化学类;
            }

            public void set化学类(List<String> 化学类) {
                this.化学类 = 化学类;
            }

            public List<String> get体育学类() {
                return 体育学类;
            }

            public void set体育学类(List<String> 体育学类) {
                this.体育学类 = 体育学类;
            }

            public List<String> get矿业类() {
                return 矿业类;
            }

            public void set矿业类(List<String> 矿业类) {
                this.矿业类 = 矿业类;
            }

            public List<String> get工商管理类() {
                return 工商管理类;
            }

            public void set工商管理类(List<String> 工商管理类) {
                this.工商管理类 = 工商管理类;
            }

            public List<String> get统计学类() {
                return 统计学类;
            }

            public void set统计学类(List<String> 统计学类) {
                this.统计学类 = 统计学类;
            }

            public List<String> get公共管理类() {
                return 公共管理类;
            }

            public void set公共管理类(List<String> 公共管理类) {
                this.公共管理类 = 公共管理类;
            }

            public List<String> get中药学类() {
                return 中药学类;
            }

            public void set中药学类(List<String> 中药学类) {
                this.中药学类 = 中药学类;
            }

            public List<String> get生物科学类() {
                return 生物科学类;
            }

            public void set生物科学类(List<String> 生物科学类) {
                this.生物科学类 = 生物科学类;
            }

            public List<String> get旅游管理类() {
                return 旅游管理类;
            }

            public void set旅游管理类(List<String> 旅游管理类) {
                this.旅游管理类 = 旅游管理类;
            }

            public List<String> get外国语言文学类() {
                return 外国语言文学类;
            }

            public void set外国语言文学类(List<String> 外国语言文学类) {
                this.外国语言文学类 = 外国语言文学类;
            }

            public List<String> get动物生产类() {
                return 动物生产类;
            }

            public void set动物生产类(List<String> 动物生产类) {
                this.动物生产类 = 动物生产类;
            }

            public List<String> get林学类() {
                return 林学类;
            }

            public void set林学类(List<String> 林学类) {
                this.林学类 = 林学类;
            }

            public List<String> get安全科学与工程类() {
                return 安全科学与工程类;
            }

            public void set安全科学与工程类(List<String> 安全科学与工程类) {
                this.安全科学与工程类 = 安全科学与工程类;
            }

            public List<String> get交通运输类() {
                return 交通运输类;
            }

            public void set交通运输类(List<String> 交通运输类) {
                this.交通运输类 = 交通运输类;
            }

            public List<String> get地球物理学类() {
                return 地球物理学类;
            }

            public void set地球物理学类(List<String> 地球物理学类) {
                this.地球物理学类 = 地球物理学类;
            }

            public List<String> get大气科学类() {
                return 大气科学类;
            }

            public void set大气科学类(List<String> 大气科学类) {
                this.大气科学类 = 大气科学类;
            }

            public List<String> get经济学类() {
                return 经济学类;
            }

            public void set经济学类(List<String> 经济学类) {
                this.经济学类 = 经济学类;
            }

            public List<String> get历史学类() {
                return 历史学类;
            }

            public void set历史学类(List<String> 历史学类) {
                this.历史学类 = 历史学类;
            }

            public List<String> get农业工程类() {
                return 农业工程类;
            }

            public void set农业工程类(List<String> 农业工程类) {
                this.农业工程类 = 农业工程类;
            }

            public List<String> get材料类() {
                return 材料类;
            }

            public void set材料类(List<String> 材料类) {
                this.材料类 = 材料类;
            }

            public List<String> get计算机类() {
                return 计算机类;
            }

            public void set计算机类(List<String> 计算机类) {
                this.计算机类 = 计算机类;
            }

            public List<String> get天文学类() {
                return 天文学类;
            }

            public void set天文学类(List<String> 天文学类) {
                this.天文学类 = 天文学类;
            }

            public List<String> get中西医结合类() {
                return 中西医结合类;
            }

            public void set中西医结合类(List<String> 中西医结合类) {
                this.中西医结合类 = 中西医结合类;
            }

            public List<String> get图书情报与档案管理类() {
                return 图书情报与档案管理类;
            }

            public void set图书情报与档案管理类(List<String> 图书情报与档案管理类) {
                this.图书情报与档案管理类 = 图书情报与档案管理类;
            }

            public List<String> get水产类() {
                return 水产类;
            }

            public void set水产类(List<String> 水产类) {
                this.水产类 = 水产类;
            }

            public List<String> get化工与制药类() {
                return 化工与制药类;
            }

            public void set化工与制药类(List<String> 化工与制药类) {
                this.化工与制药类 = 化工与制药类;
            }

            public List<String> get数学类() {
                return 数学类;
            }

            public void set数学类(List<String> 数学类) {
                this.数学类 = 数学类;
            }

            public List<String> get中医学类() {
                return 中医学类;
            }

            public void set中医学类(List<String> 中医学类) {
                this.中医学类 = 中医学类;
            }

            public List<String> get法学类() {
                return 法学类;
            }

            public void set法学类(List<String> 法学类) {
                this.法学类 = 法学类;
            }

            public List<String> get公共卫生与预防医学类() {
                return 公共卫生与预防医学类;
            }

            public void set公共卫生与预防医学类(List<String> 公共卫生与预防医学类) {
                this.公共卫生与预防医学类 = 公共卫生与预防医学类;
            }

            public List<String> get马克思主义理论类() {
                return 马克思主义理论类;
            }

            public void set马克思主义理论类(List<String> 马克思主义理论类) {
                this.马克思主义理论类 = 马克思主义理论类;
            }

            public List<String> get电子商务类() {
                return 电子商务类;
            }

            public void set电子商务类(List<String> 电子商务类) {
                this.电子商务类 = 电子商务类;
            }

            public List<String> get经济与贸易类() {
                return 经济与贸易类;
            }

            public void set经济与贸易类(List<String> 经济与贸易类) {
                this.经济与贸易类 = 经济与贸易类;
            }

            public List<String> get生物医学工程类() {
                return 生物医学工程类;
            }

            public void set生物医学工程类(List<String> 生物医学工程类) {
                this.生物医学工程类 = 生物医学工程类;
            }

            public List<String> get公安学类() {
                return 公安学类;
            }

            public void set公安学类(List<String> 公安学类) {
                this.公安学类 = 公安学类;
            }

            public List<String> get戏剧与影视学类() {
                return 戏剧与影视学类;
            }

            public void set戏剧与影视学类(List<String> 戏剧与影视学类) {
                this.戏剧与影视学类 = 戏剧与影视学类;
            }

            public List<String> get轻工类() {
                return 轻工类;
            }

            public void set轻工类(List<String> 轻工类) {
                this.轻工类 = 轻工类;
            }

            public List<String> get艺术学理论类() {
                return 艺术学理论类;
            }

            public void set艺术学理论类(List<String> 艺术学理论类) {
                this.艺术学理论类 = 艺术学理论类;
            }

            public List<String> get地质类() {
                return 地质类;
            }

            public void set地质类(List<String> 地质类) {
                this.地质类 = 地质类;
            }

            public List<String> get财政学类() {
                return 财政学类;
            }

            public void set财政学类(List<String> 财政学类) {
                this.财政学类 = 财政学类;
            }

            public List<String> get金融学类() {
                return 金融学类;
            }

            public void set金融学类(List<String> 金融学类) {
                this.金融学类 = 金融学类;
            }

            public List<String> get动物医学类() {
                return 动物医学类;
            }

            public void set动物医学类(List<String> 动物医学类) {
                this.动物医学类 = 动物医学类;
            }

            public List<String> get地理科学类() {
                return 地理科学类;
            }

            public void set地理科学类(List<String> 地理科学类) {
                this.地理科学类 = 地理科学类;
            }

            public List<String> get能源动力类() {
                return 能源动力类;
            }

            public void set能源动力类(List<String> 能源动力类) {
                this.能源动力类 = 能源动力类;
            }

            public List<String> get土木类() {
                return 土木类;
            }

            public void set土木类(List<String> 土木类) {
                this.土木类 = 土木类;
            }

            public List<String> get法医学类() {
                return 法医学类;
            }

            public void set法医学类(List<String> 法医学类) {
                this.法医学类 = 法医学类;
            }

            public List<String> get自动化类() {
                return 自动化类;
            }

            public void set自动化类(List<String> 自动化类) {
                this.自动化类 = 自动化类;
            }

            public List<String> get航空航天类() {
                return 航空航天类;
            }

            public void set航空航天类(List<String> 航空航天类) {
                this.航空航天类 = 航空航天类;
            }

            public List<String> get生物工程类() {
                return 生物工程类;
            }

            public void set生物工程类(List<String> 生物工程类) {
                this.生物工程类 = 生物工程类;
            }

            public List<String> get力学类() {
                return 力学类;
            }

            public void set力学类(List<String> 力学类) {
                this.力学类 = 力学类;
            }

            public List<String> get核工程类() {
                return 核工程类;
            }

            public void set核工程类(List<String> 核工程类) {
                this.核工程类 = 核工程类;
            }

            public List<String> get地质学类() {
                return 地质学类;
            }

            public void set地质学类(List<String> 地质学类) {
                this.地质学类 = 地质学类;
            }

            public List<String> get口腔医学类() {
                return 口腔医学类;
            }

            public void set口腔医学类(List<String> 口腔医学类) {
                this.口腔医学类 = 口腔医学类;
            }

            public List<String> get兵器类() {
                return 兵器类;
            }

            public void set兵器类(List<String> 兵器类) {
                this.兵器类 = 兵器类;
            }

            public List<String> get农业经济管理类() {
                return 农业经济管理类;
            }

            public void set农业经济管理类(List<String> 农业经济管理类) {
                this.农业经济管理类 = 农业经济管理类;
            }

            public List<String> get管理科学与工程类() {
                return 管理科学与工程类;
            }

            public void set管理科学与工程类(List<String> 管理科学与工程类) {
                this.管理科学与工程类 = 管理科学与工程类;
            }

            public List<String> get临床医学类() {
                return 临床医学类;
            }

            public void set临床医学类(List<String> 临床医学类) {
                this.临床医学类 = 临床医学类;
            }

            public List<String> get药学类() {
                return 药学类;
            }

            public void set药学类(List<String> 药学类) {
                this.药学类 = 药学类;
            }

            public List<String> get美术学类() {
                return 美术学类;
            }

            public void set美术学类(List<String> 美术学类) {
                this.美术学类 = 美术学类;
            }

            public List<String> get心理学类() {
                return 心理学类;
            }

            public void set心理学类(List<String> 心理学类) {
                this.心理学类 = 心理学类;
            }
        }

        public static class 艺术学Bean {
            private List<String> 中国语言文学类;
            private List<String> 测绘类;
            private List<String> 水利类;
            private List<String> 林业工程类;
            private List<String> 海洋科学类;
            private List<String> 音乐与舞蹈学类;
            private List<String> 植物生产类;
            private List<String> 哲学类;
            private List<String> 教育学类;
            private List<String> 海洋工程类;
            private List<String> 公安技术类;
            private List<String> 物理学类;
            private List<String> 机械类;
            private List<String> 工业工程类;
            private List<String> 政治学类;
            private List<String> 电气类;
            private List<String> 物流管理与工程类;
            private List<String> 民族学类;
            private List<String> 社会学类;
            private List<String> 护理学类;
            private List<String> 自然保护与环境生态类;
            private List<String> 纺织类;
            private List<String> 新闻传播学类;
            private List<String> 设计学类;
            private List<String> 草学类;
            private List<String> 基础医学类;
            private List<String> 食品科学与工程类;
            private List<String> 医学技术类;
            private List<String> 建筑类学;
            private List<String> 化学类;
            private List<String> 体育学类;
            private List<String> 矿业类;
            private List<String> 工商管理类;
            private List<String> 统计学类;
            private List<String> 公共管理类;
            private List<String> 中药学类;
            private List<String> 生物科学类;
            private List<String> 旅游管理类;
            private List<String> 外国语言文学类;
            private List<String> 动物生产类;
            private List<String> 林学类;
            private List<String> 安全科学与工程类;
            private List<String> 交通运输类;
            private List<String> 地球物理学类;
            private List<String> 大气科学类;
            private List<String> 经济学类;
            private List<String> 历史学类;
            private List<String> 农业工程类;
            private List<String> 材料类;
            private List<String> 计算机类;
            private List<String> 天文学类;
            private List<String> 中西医结合类;
            private List<String> 图书情报与档案管理类;
            private List<String> 水产类;
            private List<String> 化工与制药类;
            private List<String> 数学类;
            private List<String> 中医学类;
            private List<String> 法学类;
            private List<String> 公共卫生与预防医学类;
            private List<String> 马克思主义理论类;
            private List<String> 电子商务类;
            private List<String> 经济与贸易类;
            private List<String> 生物医学工程类;
            private List<String> 公安学类;
            private List<String> 戏剧与影视学类;
            private List<String> 轻工类;
            private List<String> 艺术学理论类;
            private List<String> 地质类;
            private List<String> 财政学类;
            private List<String> 金融学类;
            private List<String> 动物医学类;
            private List<String> 地理科学类;
            private List<String> 能源动力类;
            private List<String> 土木类;
            private List<String> 法医学类;
            private List<String> 自动化类;
            private List<String> 航空航天类;
            private List<String> 生物工程类;
            private List<String> 力学类;
            private List<String> 核工程类;
            private List<String> 地质学类;
            private List<String> 口腔医学类;
            private List<String> 兵器类;
            private List<String> 农业经济管理类;
            private List<String> 管理科学与工程类;
            private List<String> 临床医学类;
            private List<String> 药学类;
            private List<String> 美术学类;
            private List<String> 心理学类;

            public List<String> get中国语言文学类() {
                return 中国语言文学类;
            }

            public void set中国语言文学类(List<String> 中国语言文学类) {
                this.中国语言文学类 = 中国语言文学类;
            }

            public List<String> get测绘类() {
                return 测绘类;
            }

            public void set测绘类(List<String> 测绘类) {
                this.测绘类 = 测绘类;
            }

            public List<String> get水利类() {
                return 水利类;
            }

            public void set水利类(List<String> 水利类) {
                this.水利类 = 水利类;
            }

            public List<String> get林业工程类() {
                return 林业工程类;
            }

            public void set林业工程类(List<String> 林业工程类) {
                this.林业工程类 = 林业工程类;
            }

            public List<String> get海洋科学类() {
                return 海洋科学类;
            }

            public void set海洋科学类(List<String> 海洋科学类) {
                this.海洋科学类 = 海洋科学类;
            }

            public List<String> get音乐与舞蹈学类() {
                return 音乐与舞蹈学类;
            }

            public void set音乐与舞蹈学类(List<String> 音乐与舞蹈学类) {
                this.音乐与舞蹈学类 = 音乐与舞蹈学类;
            }

            public List<String> get植物生产类() {
                return 植物生产类;
            }

            public void set植物生产类(List<String> 植物生产类) {
                this.植物生产类 = 植物生产类;
            }

            public List<String> get哲学类() {
                return 哲学类;
            }

            public void set哲学类(List<String> 哲学类) {
                this.哲学类 = 哲学类;
            }

            public List<String> get教育学类() {
                return 教育学类;
            }

            public void set教育学类(List<String> 教育学类) {
                this.教育学类 = 教育学类;
            }

            public List<String> get海洋工程类() {
                return 海洋工程类;
            }

            public void set海洋工程类(List<String> 海洋工程类) {
                this.海洋工程类 = 海洋工程类;
            }

            public List<String> get公安技术类() {
                return 公安技术类;
            }

            public void set公安技术类(List<String> 公安技术类) {
                this.公安技术类 = 公安技术类;
            }

            public List<String> get物理学类() {
                return 物理学类;
            }

            public void set物理学类(List<String> 物理学类) {
                this.物理学类 = 物理学类;
            }

            public List<String> get机械类() {
                return 机械类;
            }

            public void set机械类(List<String> 机械类) {
                this.机械类 = 机械类;
            }

            public List<String> get工业工程类() {
                return 工业工程类;
            }

            public void set工业工程类(List<String> 工业工程类) {
                this.工业工程类 = 工业工程类;
            }

            public List<String> get政治学类() {
                return 政治学类;
            }

            public void set政治学类(List<String> 政治学类) {
                this.政治学类 = 政治学类;
            }

            public List<String> get电气类() {
                return 电气类;
            }

            public void set电气类(List<String> 电气类) {
                this.电气类 = 电气类;
            }

            public List<String> get物流管理与工程类() {
                return 物流管理与工程类;
            }

            public void set物流管理与工程类(List<String> 物流管理与工程类) {
                this.物流管理与工程类 = 物流管理与工程类;
            }

            public List<String> get民族学类() {
                return 民族学类;
            }

            public void set民族学类(List<String> 民族学类) {
                this.民族学类 = 民族学类;
            }

            public List<String> get社会学类() {
                return 社会学类;
            }

            public void set社会学类(List<String> 社会学类) {
                this.社会学类 = 社会学类;
            }

            public List<String> get护理学类() {
                return 护理学类;
            }

            public void set护理学类(List<String> 护理学类) {
                this.护理学类 = 护理学类;
            }

            public List<String> get自然保护与环境生态类() {
                return 自然保护与环境生态类;
            }

            public void set自然保护与环境生态类(List<String> 自然保护与环境生态类) {
                this.自然保护与环境生态类 = 自然保护与环境生态类;
            }

            public List<String> get纺织类() {
                return 纺织类;
            }

            public void set纺织类(List<String> 纺织类) {
                this.纺织类 = 纺织类;
            }

            public List<String> get新闻传播学类() {
                return 新闻传播学类;
            }

            public void set新闻传播学类(List<String> 新闻传播学类) {
                this.新闻传播学类 = 新闻传播学类;
            }

            public List<String> get设计学类() {
                return 设计学类;
            }

            public void set设计学类(List<String> 设计学类) {
                this.设计学类 = 设计学类;
            }

            public List<String> get草学类() {
                return 草学类;
            }

            public void set草学类(List<String> 草学类) {
                this.草学类 = 草学类;
            }

            public List<String> get基础医学类() {
                return 基础医学类;
            }

            public void set基础医学类(List<String> 基础医学类) {
                this.基础医学类 = 基础医学类;
            }

            public List<String> get食品科学与工程类() {
                return 食品科学与工程类;
            }

            public void set食品科学与工程类(List<String> 食品科学与工程类) {
                this.食品科学与工程类 = 食品科学与工程类;
            }

            public List<String> get医学技术类() {
                return 医学技术类;
            }

            public void set医学技术类(List<String> 医学技术类) {
                this.医学技术类 = 医学技术类;
            }

            public List<String> get建筑类学() {
                return 建筑类学;
            }

            public void set建筑类学(List<String> 建筑类学) {
                this.建筑类学 = 建筑类学;
            }

            public List<String> get化学类() {
                return 化学类;
            }

            public void set化学类(List<String> 化学类) {
                this.化学类 = 化学类;
            }

            public List<String> get体育学类() {
                return 体育学类;
            }

            public void set体育学类(List<String> 体育学类) {
                this.体育学类 = 体育学类;
            }

            public List<String> get矿业类() {
                return 矿业类;
            }

            public void set矿业类(List<String> 矿业类) {
                this.矿业类 = 矿业类;
            }

            public List<String> get工商管理类() {
                return 工商管理类;
            }

            public void set工商管理类(List<String> 工商管理类) {
                this.工商管理类 = 工商管理类;
            }

            public List<String> get统计学类() {
                return 统计学类;
            }

            public void set统计学类(List<String> 统计学类) {
                this.统计学类 = 统计学类;
            }

            public List<String> get公共管理类() {
                return 公共管理类;
            }

            public void set公共管理类(List<String> 公共管理类) {
                this.公共管理类 = 公共管理类;
            }

            public List<String> get中药学类() {
                return 中药学类;
            }

            public void set中药学类(List<String> 中药学类) {
                this.中药学类 = 中药学类;
            }

            public List<String> get生物科学类() {
                return 生物科学类;
            }

            public void set生物科学类(List<String> 生物科学类) {
                this.生物科学类 = 生物科学类;
            }

            public List<String> get旅游管理类() {
                return 旅游管理类;
            }

            public void set旅游管理类(List<String> 旅游管理类) {
                this.旅游管理类 = 旅游管理类;
            }

            public List<String> get外国语言文学类() {
                return 外国语言文学类;
            }

            public void set外国语言文学类(List<String> 外国语言文学类) {
                this.外国语言文学类 = 外国语言文学类;
            }

            public List<String> get动物生产类() {
                return 动物生产类;
            }

            public void set动物生产类(List<String> 动物生产类) {
                this.动物生产类 = 动物生产类;
            }

            public List<String> get林学类() {
                return 林学类;
            }

            public void set林学类(List<String> 林学类) {
                this.林学类 = 林学类;
            }

            public List<String> get安全科学与工程类() {
                return 安全科学与工程类;
            }

            public void set安全科学与工程类(List<String> 安全科学与工程类) {
                this.安全科学与工程类 = 安全科学与工程类;
            }

            public List<String> get交通运输类() {
                return 交通运输类;
            }

            public void set交通运输类(List<String> 交通运输类) {
                this.交通运输类 = 交通运输类;
            }

            public List<String> get地球物理学类() {
                return 地球物理学类;
            }

            public void set地球物理学类(List<String> 地球物理学类) {
                this.地球物理学类 = 地球物理学类;
            }

            public List<String> get大气科学类() {
                return 大气科学类;
            }

            public void set大气科学类(List<String> 大气科学类) {
                this.大气科学类 = 大气科学类;
            }

            public List<String> get经济学类() {
                return 经济学类;
            }

            public void set经济学类(List<String> 经济学类) {
                this.经济学类 = 经济学类;
            }

            public List<String> get历史学类() {
                return 历史学类;
            }

            public void set历史学类(List<String> 历史学类) {
                this.历史学类 = 历史学类;
            }

            public List<String> get农业工程类() {
                return 农业工程类;
            }

            public void set农业工程类(List<String> 农业工程类) {
                this.农业工程类 = 农业工程类;
            }

            public List<String> get材料类() {
                return 材料类;
            }

            public void set材料类(List<String> 材料类) {
                this.材料类 = 材料类;
            }

            public List<String> get计算机类() {
                return 计算机类;
            }

            public void set计算机类(List<String> 计算机类) {
                this.计算机类 = 计算机类;
            }

            public List<String> get天文学类() {
                return 天文学类;
            }

            public void set天文学类(List<String> 天文学类) {
                this.天文学类 = 天文学类;
            }

            public List<String> get中西医结合类() {
                return 中西医结合类;
            }

            public void set中西医结合类(List<String> 中西医结合类) {
                this.中西医结合类 = 中西医结合类;
            }

            public List<String> get图书情报与档案管理类() {
                return 图书情报与档案管理类;
            }

            public void set图书情报与档案管理类(List<String> 图书情报与档案管理类) {
                this.图书情报与档案管理类 = 图书情报与档案管理类;
            }

            public List<String> get水产类() {
                return 水产类;
            }

            public void set水产类(List<String> 水产类) {
                this.水产类 = 水产类;
            }

            public List<String> get化工与制药类() {
                return 化工与制药类;
            }

            public void set化工与制药类(List<String> 化工与制药类) {
                this.化工与制药类 = 化工与制药类;
            }

            public List<String> get数学类() {
                return 数学类;
            }

            public void set数学类(List<String> 数学类) {
                this.数学类 = 数学类;
            }

            public List<String> get中医学类() {
                return 中医学类;
            }

            public void set中医学类(List<String> 中医学类) {
                this.中医学类 = 中医学类;
            }

            public List<String> get法学类() {
                return 法学类;
            }

            public void set法学类(List<String> 法学类) {
                this.法学类 = 法学类;
            }

            public List<String> get公共卫生与预防医学类() {
                return 公共卫生与预防医学类;
            }

            public void set公共卫生与预防医学类(List<String> 公共卫生与预防医学类) {
                this.公共卫生与预防医学类 = 公共卫生与预防医学类;
            }

            public List<String> get马克思主义理论类() {
                return 马克思主义理论类;
            }

            public void set马克思主义理论类(List<String> 马克思主义理论类) {
                this.马克思主义理论类 = 马克思主义理论类;
            }

            public List<String> get电子商务类() {
                return 电子商务类;
            }

            public void set电子商务类(List<String> 电子商务类) {
                this.电子商务类 = 电子商务类;
            }

            public List<String> get经济与贸易类() {
                return 经济与贸易类;
            }

            public void set经济与贸易类(List<String> 经济与贸易类) {
                this.经济与贸易类 = 经济与贸易类;
            }

            public List<String> get生物医学工程类() {
                return 生物医学工程类;
            }

            public void set生物医学工程类(List<String> 生物医学工程类) {
                this.生物医学工程类 = 生物医学工程类;
            }

            public List<String> get公安学类() {
                return 公安学类;
            }

            public void set公安学类(List<String> 公安学类) {
                this.公安学类 = 公安学类;
            }

            public List<String> get戏剧与影视学类() {
                return 戏剧与影视学类;
            }

            public void set戏剧与影视学类(List<String> 戏剧与影视学类) {
                this.戏剧与影视学类 = 戏剧与影视学类;
            }

            public List<String> get轻工类() {
                return 轻工类;
            }

            public void set轻工类(List<String> 轻工类) {
                this.轻工类 = 轻工类;
            }

            public List<String> get艺术学理论类() {
                return 艺术学理论类;
            }

            public void set艺术学理论类(List<String> 艺术学理论类) {
                this.艺术学理论类 = 艺术学理论类;
            }

            public List<String> get地质类() {
                return 地质类;
            }

            public void set地质类(List<String> 地质类) {
                this.地质类 = 地质类;
            }

            public List<String> get财政学类() {
                return 财政学类;
            }

            public void set财政学类(List<String> 财政学类) {
                this.财政学类 = 财政学类;
            }

            public List<String> get金融学类() {
                return 金融学类;
            }

            public void set金融学类(List<String> 金融学类) {
                this.金融学类 = 金融学类;
            }

            public List<String> get动物医学类() {
                return 动物医学类;
            }

            public void set动物医学类(List<String> 动物医学类) {
                this.动物医学类 = 动物医学类;
            }

            public List<String> get地理科学类() {
                return 地理科学类;
            }

            public void set地理科学类(List<String> 地理科学类) {
                this.地理科学类 = 地理科学类;
            }

            public List<String> get能源动力类() {
                return 能源动力类;
            }

            public void set能源动力类(List<String> 能源动力类) {
                this.能源动力类 = 能源动力类;
            }

            public List<String> get土木类() {
                return 土木类;
            }

            public void set土木类(List<String> 土木类) {
                this.土木类 = 土木类;
            }

            public List<String> get法医学类() {
                return 法医学类;
            }

            public void set法医学类(List<String> 法医学类) {
                this.法医学类 = 法医学类;
            }

            public List<String> get自动化类() {
                return 自动化类;
            }

            public void set自动化类(List<String> 自动化类) {
                this.自动化类 = 自动化类;
            }

            public List<String> get航空航天类() {
                return 航空航天类;
            }

            public void set航空航天类(List<String> 航空航天类) {
                this.航空航天类 = 航空航天类;
            }

            public List<String> get生物工程类() {
                return 生物工程类;
            }

            public void set生物工程类(List<String> 生物工程类) {
                this.生物工程类 = 生物工程类;
            }

            public List<String> get力学类() {
                return 力学类;
            }

            public void set力学类(List<String> 力学类) {
                this.力学类 = 力学类;
            }

            public List<String> get核工程类() {
                return 核工程类;
            }

            public void set核工程类(List<String> 核工程类) {
                this.核工程类 = 核工程类;
            }

            public List<String> get地质学类() {
                return 地质学类;
            }

            public void set地质学类(List<String> 地质学类) {
                this.地质学类 = 地质学类;
            }

            public List<String> get口腔医学类() {
                return 口腔医学类;
            }

            public void set口腔医学类(List<String> 口腔医学类) {
                this.口腔医学类 = 口腔医学类;
            }

            public List<String> get兵器类() {
                return 兵器类;
            }

            public void set兵器类(List<String> 兵器类) {
                this.兵器类 = 兵器类;
            }

            public List<String> get农业经济管理类() {
                return 农业经济管理类;
            }

            public void set农业经济管理类(List<String> 农业经济管理类) {
                this.农业经济管理类 = 农业经济管理类;
            }

            public List<String> get管理科学与工程类() {
                return 管理科学与工程类;
            }

            public void set管理科学与工程类(List<String> 管理科学与工程类) {
                this.管理科学与工程类 = 管理科学与工程类;
            }

            public List<String> get临床医学类() {
                return 临床医学类;
            }

            public void set临床医学类(List<String> 临床医学类) {
                this.临床医学类 = 临床医学类;
            }

            public List<String> get药学类() {
                return 药学类;
            }

            public void set药学类(List<String> 药学类) {
                this.药学类 = 药学类;
            }

            public List<String> get美术学类() {
                return 美术学类;
            }

            public void set美术学类(List<String> 美术学类) {
                this.美术学类 = 美术学类;
            }

            public List<String> get心理学类() {
                return 心理学类;
            }

            public void set心理学类(List<String> 心理学类) {
                this.心理学类 = 心理学类;
            }
        }

        public static class 工学Bean {
            private List<String> 中国语言文学类;
            private List<String> 测绘类;
            private List<String> 水利类;
            private List<String> 林业工程类;
            private List<String> 海洋科学类;
            private List<String> 音乐与舞蹈学类;
            private List<String> 植物生产类;
            private List<String> 哲学类;
            private List<String> 教育学类;
            private List<String> 海洋工程类;
            private List<String> 公安技术类;
            private List<String> 物理学类;
            private List<String> 机械类;
            private List<String> 工业工程类;
            private List<String> 政治学类;
            private List<String> 电气类;
            private List<String> 物流管理与工程类;
            private List<String> 民族学类;
            private List<String> 社会学类;
            private List<String> 护理学类;
            private List<String> 自然保护与环境生态类;
            private List<String> 纺织类;
            private List<String> 新闻传播学类;
            private List<String> 设计学类;
            private List<String> 草学类;
            private List<String> 基础医学类;
            private List<String> 食品科学与工程类;
            private List<String> 医学技术类;
            private List<String> 建筑类学;
            private List<String> 化学类;
            private List<String> 体育学类;
            private List<String> 矿业类;
            private List<String> 工商管理类;
            private List<String> 统计学类;
            private List<String> 公共管理类;
            private List<String> 中药学类;
            private List<String> 生物科学类;
            private List<String> 旅游管理类;
            private List<String> 外国语言文学类;
            private List<String> 动物生产类;
            private List<String> 林学类;
            private List<String> 安全科学与工程类;
            private List<String> 交通运输类;
            private List<String> 地球物理学类;
            private List<String> 大气科学类;
            private List<String> 经济学类;
            private List<String> 历史学类;
            private List<String> 农业工程类;
            private List<String> 材料类;
            private List<String> 计算机类;
            private List<String> 天文学类;
            private List<String> 中西医结合类;
            private List<String> 图书情报与档案管理类;
            private List<String> 水产类;
            private List<String> 化工与制药类;
            private List<String> 数学类;
            private List<String> 中医学类;
            private List<String> 法学类;
            private List<String> 公共卫生与预防医学类;
            private List<String> 马克思主义理论类;
            private List<String> 电子商务类;
            private List<String> 经济与贸易类;
            private List<String> 生物医学工程类;
            private List<String> 公安学类;
            private List<String> 戏剧与影视学类;
            private List<String> 轻工类;
            private List<String> 艺术学理论类;
            private List<String> 地质类;
            private List<String> 财政学类;
            private List<String> 金融学类;
            private List<String> 动物医学类;
            private List<String> 地理科学类;
            private List<String> 能源动力类;
            private List<String> 土木类;
            private List<String> 法医学类;
            private List<String> 自动化类;
            private List<String> 航空航天类;
            private List<String> 生物工程类;
            private List<String> 力学类;
            private List<String> 核工程类;
            private List<String> 地质学类;
            private List<String> 口腔医学类;
            private List<String> 兵器类;
            private List<String> 农业经济管理类;
            private List<String> 管理科学与工程类;
            private List<String> 临床医学类;
            private List<String> 药学类;
            private List<String> 美术学类;
            private List<String> 心理学类;

            public List<String> get中国语言文学类() {
                return 中国语言文学类;
            }

            public void set中国语言文学类(List<String> 中国语言文学类) {
                this.中国语言文学类 = 中国语言文学类;
            }

            public List<String> get测绘类() {
                return 测绘类;
            }

            public void set测绘类(List<String> 测绘类) {
                this.测绘类 = 测绘类;
            }

            public List<String> get水利类() {
                return 水利类;
            }

            public void set水利类(List<String> 水利类) {
                this.水利类 = 水利类;
            }

            public List<String> get林业工程类() {
                return 林业工程类;
            }

            public void set林业工程类(List<String> 林业工程类) {
                this.林业工程类 = 林业工程类;
            }

            public List<String> get海洋科学类() {
                return 海洋科学类;
            }

            public void set海洋科学类(List<String> 海洋科学类) {
                this.海洋科学类 = 海洋科学类;
            }

            public List<String> get音乐与舞蹈学类() {
                return 音乐与舞蹈学类;
            }

            public void set音乐与舞蹈学类(List<String> 音乐与舞蹈学类) {
                this.音乐与舞蹈学类 = 音乐与舞蹈学类;
            }

            public List<String> get植物生产类() {
                return 植物生产类;
            }

            public void set植物生产类(List<String> 植物生产类) {
                this.植物生产类 = 植物生产类;
            }

            public List<String> get哲学类() {
                return 哲学类;
            }

            public void set哲学类(List<String> 哲学类) {
                this.哲学类 = 哲学类;
            }

            public List<String> get教育学类() {
                return 教育学类;
            }

            public void set教育学类(List<String> 教育学类) {
                this.教育学类 = 教育学类;
            }

            public List<String> get海洋工程类() {
                return 海洋工程类;
            }

            public void set海洋工程类(List<String> 海洋工程类) {
                this.海洋工程类 = 海洋工程类;
            }

            public List<String> get公安技术类() {
                return 公安技术类;
            }

            public void set公安技术类(List<String> 公安技术类) {
                this.公安技术类 = 公安技术类;
            }

            public List<String> get物理学类() {
                return 物理学类;
            }

            public void set物理学类(List<String> 物理学类) {
                this.物理学类 = 物理学类;
            }

            public List<String> get机械类() {
                return 机械类;
            }

            public void set机械类(List<String> 机械类) {
                this.机械类 = 机械类;
            }

            public List<String> get工业工程类() {
                return 工业工程类;
            }

            public void set工业工程类(List<String> 工业工程类) {
                this.工业工程类 = 工业工程类;
            }

            public List<String> get政治学类() {
                return 政治学类;
            }

            public void set政治学类(List<String> 政治学类) {
                this.政治学类 = 政治学类;
            }

            public List<String> get电气类() {
                return 电气类;
            }

            public void set电气类(List<String> 电气类) {
                this.电气类 = 电气类;
            }

            public List<String> get物流管理与工程类() {
                return 物流管理与工程类;
            }

            public void set物流管理与工程类(List<String> 物流管理与工程类) {
                this.物流管理与工程类 = 物流管理与工程类;
            }

            public List<String> get民族学类() {
                return 民族学类;
            }

            public void set民族学类(List<String> 民族学类) {
                this.民族学类 = 民族学类;
            }

            public List<String> get社会学类() {
                return 社会学类;
            }

            public void set社会学类(List<String> 社会学类) {
                this.社会学类 = 社会学类;
            }

            public List<String> get护理学类() {
                return 护理学类;
            }

            public void set护理学类(List<String> 护理学类) {
                this.护理学类 = 护理学类;
            }

            public List<String> get自然保护与环境生态类() {
                return 自然保护与环境生态类;
            }

            public void set自然保护与环境生态类(List<String> 自然保护与环境生态类) {
                this.自然保护与环境生态类 = 自然保护与环境生态类;
            }

            public List<String> get纺织类() {
                return 纺织类;
            }

            public void set纺织类(List<String> 纺织类) {
                this.纺织类 = 纺织类;
            }

            public List<String> get新闻传播学类() {
                return 新闻传播学类;
            }

            public void set新闻传播学类(List<String> 新闻传播学类) {
                this.新闻传播学类 = 新闻传播学类;
            }

            public List<String> get设计学类() {
                return 设计学类;
            }

            public void set设计学类(List<String> 设计学类) {
                this.设计学类 = 设计学类;
            }

            public List<String> get草学类() {
                return 草学类;
            }

            public void set草学类(List<String> 草学类) {
                this.草学类 = 草学类;
            }

            public List<String> get基础医学类() {
                return 基础医学类;
            }

            public void set基础医学类(List<String> 基础医学类) {
                this.基础医学类 = 基础医学类;
            }

            public List<String> get食品科学与工程类() {
                return 食品科学与工程类;
            }

            public void set食品科学与工程类(List<String> 食品科学与工程类) {
                this.食品科学与工程类 = 食品科学与工程类;
            }

            public List<String> get医学技术类() {
                return 医学技术类;
            }

            public void set医学技术类(List<String> 医学技术类) {
                this.医学技术类 = 医学技术类;
            }

            public List<String> get建筑类学() {
                return 建筑类学;
            }

            public void set建筑类学(List<String> 建筑类学) {
                this.建筑类学 = 建筑类学;
            }

            public List<String> get化学类() {
                return 化学类;
            }

            public void set化学类(List<String> 化学类) {
                this.化学类 = 化学类;
            }

            public List<String> get体育学类() {
                return 体育学类;
            }

            public void set体育学类(List<String> 体育学类) {
                this.体育学类 = 体育学类;
            }

            public List<String> get矿业类() {
                return 矿业类;
            }

            public void set矿业类(List<String> 矿业类) {
                this.矿业类 = 矿业类;
            }

            public List<String> get工商管理类() {
                return 工商管理类;
            }

            public void set工商管理类(List<String> 工商管理类) {
                this.工商管理类 = 工商管理类;
            }

            public List<String> get统计学类() {
                return 统计学类;
            }

            public void set统计学类(List<String> 统计学类) {
                this.统计学类 = 统计学类;
            }

            public List<String> get公共管理类() {
                return 公共管理类;
            }

            public void set公共管理类(List<String> 公共管理类) {
                this.公共管理类 = 公共管理类;
            }

            public List<String> get中药学类() {
                return 中药学类;
            }

            public void set中药学类(List<String> 中药学类) {
                this.中药学类 = 中药学类;
            }

            public List<String> get生物科学类() {
                return 生物科学类;
            }

            public void set生物科学类(List<String> 生物科学类) {
                this.生物科学类 = 生物科学类;
            }

            public List<String> get旅游管理类() {
                return 旅游管理类;
            }

            public void set旅游管理类(List<String> 旅游管理类) {
                this.旅游管理类 = 旅游管理类;
            }

            public List<String> get外国语言文学类() {
                return 外国语言文学类;
            }

            public void set外国语言文学类(List<String> 外国语言文学类) {
                this.外国语言文学类 = 外国语言文学类;
            }

            public List<String> get动物生产类() {
                return 动物生产类;
            }

            public void set动物生产类(List<String> 动物生产类) {
                this.动物生产类 = 动物生产类;
            }

            public List<String> get林学类() {
                return 林学类;
            }

            public void set林学类(List<String> 林学类) {
                this.林学类 = 林学类;
            }

            public List<String> get安全科学与工程类() {
                return 安全科学与工程类;
            }

            public void set安全科学与工程类(List<String> 安全科学与工程类) {
                this.安全科学与工程类 = 安全科学与工程类;
            }

            public List<String> get交通运输类() {
                return 交通运输类;
            }

            public void set交通运输类(List<String> 交通运输类) {
                this.交通运输类 = 交通运输类;
            }

            public List<String> get地球物理学类() {
                return 地球物理学类;
            }

            public void set地球物理学类(List<String> 地球物理学类) {
                this.地球物理学类 = 地球物理学类;
            }

            public List<String> get大气科学类() {
                return 大气科学类;
            }

            public void set大气科学类(List<String> 大气科学类) {
                this.大气科学类 = 大气科学类;
            }

            public List<String> get经济学类() {
                return 经济学类;
            }

            public void set经济学类(List<String> 经济学类) {
                this.经济学类 = 经济学类;
            }

            public List<String> get历史学类() {
                return 历史学类;
            }

            public void set历史学类(List<String> 历史学类) {
                this.历史学类 = 历史学类;
            }

            public List<String> get农业工程类() {
                return 农业工程类;
            }

            public void set农业工程类(List<String> 农业工程类) {
                this.农业工程类 = 农业工程类;
            }

            public List<String> get材料类() {
                return 材料类;
            }

            public void set材料类(List<String> 材料类) {
                this.材料类 = 材料类;
            }

            public List<String> get计算机类() {
                return 计算机类;
            }

            public void set计算机类(List<String> 计算机类) {
                this.计算机类 = 计算机类;
            }

            public List<String> get天文学类() {
                return 天文学类;
            }

            public void set天文学类(List<String> 天文学类) {
                this.天文学类 = 天文学类;
            }

            public List<String> get中西医结合类() {
                return 中西医结合类;
            }

            public void set中西医结合类(List<String> 中西医结合类) {
                this.中西医结合类 = 中西医结合类;
            }

            public List<String> get图书情报与档案管理类() {
                return 图书情报与档案管理类;
            }

            public void set图书情报与档案管理类(List<String> 图书情报与档案管理类) {
                this.图书情报与档案管理类 = 图书情报与档案管理类;
            }

            public List<String> get水产类() {
                return 水产类;
            }

            public void set水产类(List<String> 水产类) {
                this.水产类 = 水产类;
            }

            public List<String> get化工与制药类() {
                return 化工与制药类;
            }

            public void set化工与制药类(List<String> 化工与制药类) {
                this.化工与制药类 = 化工与制药类;
            }

            public List<String> get数学类() {
                return 数学类;
            }

            public void set数学类(List<String> 数学类) {
                this.数学类 = 数学类;
            }

            public List<String> get中医学类() {
                return 中医学类;
            }

            public void set中医学类(List<String> 中医学类) {
                this.中医学类 = 中医学类;
            }

            public List<String> get法学类() {
                return 法学类;
            }

            public void set法学类(List<String> 法学类) {
                this.法学类 = 法学类;
            }

            public List<String> get公共卫生与预防医学类() {
                return 公共卫生与预防医学类;
            }

            public void set公共卫生与预防医学类(List<String> 公共卫生与预防医学类) {
                this.公共卫生与预防医学类 = 公共卫生与预防医学类;
            }

            public List<String> get马克思主义理论类() {
                return 马克思主义理论类;
            }

            public void set马克思主义理论类(List<String> 马克思主义理论类) {
                this.马克思主义理论类 = 马克思主义理论类;
            }

            public List<String> get电子商务类() {
                return 电子商务类;
            }

            public void set电子商务类(List<String> 电子商务类) {
                this.电子商务类 = 电子商务类;
            }

            public List<String> get经济与贸易类() {
                return 经济与贸易类;
            }

            public void set经济与贸易类(List<String> 经济与贸易类) {
                this.经济与贸易类 = 经济与贸易类;
            }

            public List<String> get生物医学工程类() {
                return 生物医学工程类;
            }

            public void set生物医学工程类(List<String> 生物医学工程类) {
                this.生物医学工程类 = 生物医学工程类;
            }

            public List<String> get公安学类() {
                return 公安学类;
            }

            public void set公安学类(List<String> 公安学类) {
                this.公安学类 = 公安学类;
            }

            public List<String> get戏剧与影视学类() {
                return 戏剧与影视学类;
            }

            public void set戏剧与影视学类(List<String> 戏剧与影视学类) {
                this.戏剧与影视学类 = 戏剧与影视学类;
            }

            public List<String> get轻工类() {
                return 轻工类;
            }

            public void set轻工类(List<String> 轻工类) {
                this.轻工类 = 轻工类;
            }

            public List<String> get艺术学理论类() {
                return 艺术学理论类;
            }

            public void set艺术学理论类(List<String> 艺术学理论类) {
                this.艺术学理论类 = 艺术学理论类;
            }

            public List<String> get地质类() {
                return 地质类;
            }

            public void set地质类(List<String> 地质类) {
                this.地质类 = 地质类;
            }

            public List<String> get财政学类() {
                return 财政学类;
            }

            public void set财政学类(List<String> 财政学类) {
                this.财政学类 = 财政学类;
            }

            public List<String> get金融学类() {
                return 金融学类;
            }

            public void set金融学类(List<String> 金融学类) {
                this.金融学类 = 金融学类;
            }

            public List<String> get动物医学类() {
                return 动物医学类;
            }

            public void set动物医学类(List<String> 动物医学类) {
                this.动物医学类 = 动物医学类;
            }

            public List<String> get地理科学类() {
                return 地理科学类;
            }

            public void set地理科学类(List<String> 地理科学类) {
                this.地理科学类 = 地理科学类;
            }

            public List<String> get能源动力类() {
                return 能源动力类;
            }

            public void set能源动力类(List<String> 能源动力类) {
                this.能源动力类 = 能源动力类;
            }

            public List<String> get土木类() {
                return 土木类;
            }

            public void set土木类(List<String> 土木类) {
                this.土木类 = 土木类;
            }

            public List<String> get法医学类() {
                return 法医学类;
            }

            public void set法医学类(List<String> 法医学类) {
                this.法医学类 = 法医学类;
            }

            public List<String> get自动化类() {
                return 自动化类;
            }

            public void set自动化类(List<String> 自动化类) {
                this.自动化类 = 自动化类;
            }

            public List<String> get航空航天类() {
                return 航空航天类;
            }

            public void set航空航天类(List<String> 航空航天类) {
                this.航空航天类 = 航空航天类;
            }

            public List<String> get生物工程类() {
                return 生物工程类;
            }

            public void set生物工程类(List<String> 生物工程类) {
                this.生物工程类 = 生物工程类;
            }

            public List<String> get力学类() {
                return 力学类;
            }

            public void set力学类(List<String> 力学类) {
                this.力学类 = 力学类;
            }

            public List<String> get核工程类() {
                return 核工程类;
            }

            public void set核工程类(List<String> 核工程类) {
                this.核工程类 = 核工程类;
            }

            public List<String> get地质学类() {
                return 地质学类;
            }

            public void set地质学类(List<String> 地质学类) {
                this.地质学类 = 地质学类;
            }

            public List<String> get口腔医学类() {
                return 口腔医学类;
            }

            public void set口腔医学类(List<String> 口腔医学类) {
                this.口腔医学类 = 口腔医学类;
            }

            public List<String> get兵器类() {
                return 兵器类;
            }

            public void set兵器类(List<String> 兵器类) {
                this.兵器类 = 兵器类;
            }

            public List<String> get农业经济管理类() {
                return 农业经济管理类;
            }

            public void set农业经济管理类(List<String> 农业经济管理类) {
                this.农业经济管理类 = 农业经济管理类;
            }

            public List<String> get管理科学与工程类() {
                return 管理科学与工程类;
            }

            public void set管理科学与工程类(List<String> 管理科学与工程类) {
                this.管理科学与工程类 = 管理科学与工程类;
            }

            public List<String> get临床医学类() {
                return 临床医学类;
            }

            public void set临床医学类(List<String> 临床医学类) {
                this.临床医学类 = 临床医学类;
            }

            public List<String> get药学类() {
                return 药学类;
            }

            public void set药学类(List<String> 药学类) {
                this.药学类 = 药学类;
            }

            public List<String> get美术学类() {
                return 美术学类;
            }

            public void set美术学类(List<String> 美术学类) {
                this.美术学类 = 美术学类;
            }

            public List<String> get心理学类() {
                return 心理学类;
            }

            public void set心理学类(List<String> 心理学类) {
                this.心理学类 = 心理学类;
            }
        }

        public static class 法学Bean {
            private List<String> 中国语言文学类;
            private List<String> 测绘类;
            private List<String> 水利类;
            private List<String> 林业工程类;
            private List<String> 海洋科学类;
            private List<String> 音乐与舞蹈学类;
            private List<String> 植物生产类;
            private List<String> 哲学类;
            private List<String> 教育学类;
            private List<String> 海洋工程类;
            private List<String> 公安技术类;
            private List<String> 物理学类;
            private List<String> 机械类;
            private List<String> 工业工程类;
            private List<String> 政治学类;
            private List<String> 电气类;
            private List<String> 物流管理与工程类;
            private List<String> 民族学类;
            private List<String> 社会学类;
            private List<String> 护理学类;
            private List<String> 自然保护与环境生态类;
            private List<String> 纺织类;
            private List<String> 新闻传播学类;
            private List<String> 设计学类;
            private List<String> 草学类;
            private List<String> 基础医学类;
            private List<String> 食品科学与工程类;
            private List<String> 医学技术类;
            private List<String> 建筑类学;
            private List<String> 化学类;
            private List<String> 体育学类;
            private List<String> 矿业类;
            private List<String> 工商管理类;
            private List<String> 统计学类;
            private List<String> 公共管理类;
            private List<String> 中药学类;
            private List<String> 生物科学类;
            private List<String> 旅游管理类;
            private List<String> 外国语言文学类;
            private List<String> 动物生产类;
            private List<String> 林学类;
            private List<String> 安全科学与工程类;
            private List<String> 交通运输类;
            private List<String> 地球物理学类;
            private List<String> 大气科学类;
            private List<String> 经济学类;
            private List<String> 历史学类;
            private List<String> 农业工程类;
            private List<String> 材料类;
            private List<String> 计算机类;
            private List<String> 天文学类;
            private List<String> 中西医结合类;
            private List<String> 图书情报与档案管理类;
            private List<String> 水产类;
            private List<String> 化工与制药类;
            private List<String> 数学类;
            private List<String> 中医学类;
            private List<String> 法学类;
            private List<String> 公共卫生与预防医学类;
            private List<String> 马克思主义理论类;
            private List<String> 电子商务类;
            private List<String> 经济与贸易类;
            private List<String> 生物医学工程类;
            private List<String> 公安学类;
            private List<String> 戏剧与影视学类;
            private List<String> 轻工类;
            private List<String> 艺术学理论类;
            private List<String> 地质类;
            private List<String> 财政学类;
            private List<String> 金融学类;
            private List<String> 动物医学类;
            private List<String> 地理科学类;
            private List<String> 能源动力类;
            private List<String> 土木类;
            private List<String> 法医学类;
            private List<String> 自动化类;
            private List<String> 航空航天类;
            private List<String> 生物工程类;
            private List<String> 力学类;
            private List<String> 核工程类;
            private List<String> 地质学类;
            private List<String> 口腔医学类;
            private List<String> 兵器类;
            private List<String> 农业经济管理类;
            private List<String> 管理科学与工程类;
            private List<String> 临床医学类;
            private List<String> 药学类;
            private List<String> 美术学类;
            private List<String> 心理学类;

            public List<String> get中国语言文学类() {
                return 中国语言文学类;
            }

            public void set中国语言文学类(List<String> 中国语言文学类) {
                this.中国语言文学类 = 中国语言文学类;
            }

            public List<String> get测绘类() {
                return 测绘类;
            }

            public void set测绘类(List<String> 测绘类) {
                this.测绘类 = 测绘类;
            }

            public List<String> get水利类() {
                return 水利类;
            }

            public void set水利类(List<String> 水利类) {
                this.水利类 = 水利类;
            }

            public List<String> get林业工程类() {
                return 林业工程类;
            }

            public void set林业工程类(List<String> 林业工程类) {
                this.林业工程类 = 林业工程类;
            }

            public List<String> get海洋科学类() {
                return 海洋科学类;
            }

            public void set海洋科学类(List<String> 海洋科学类) {
                this.海洋科学类 = 海洋科学类;
            }

            public List<String> get音乐与舞蹈学类() {
                return 音乐与舞蹈学类;
            }

            public void set音乐与舞蹈学类(List<String> 音乐与舞蹈学类) {
                this.音乐与舞蹈学类 = 音乐与舞蹈学类;
            }

            public List<String> get植物生产类() {
                return 植物生产类;
            }

            public void set植物生产类(List<String> 植物生产类) {
                this.植物生产类 = 植物生产类;
            }

            public List<String> get哲学类() {
                return 哲学类;
            }

            public void set哲学类(List<String> 哲学类) {
                this.哲学类 = 哲学类;
            }

            public List<String> get教育学类() {
                return 教育学类;
            }

            public void set教育学类(List<String> 教育学类) {
                this.教育学类 = 教育学类;
            }

            public List<String> get海洋工程类() {
                return 海洋工程类;
            }

            public void set海洋工程类(List<String> 海洋工程类) {
                this.海洋工程类 = 海洋工程类;
            }

            public List<String> get公安技术类() {
                return 公安技术类;
            }

            public void set公安技术类(List<String> 公安技术类) {
                this.公安技术类 = 公安技术类;
            }

            public List<String> get物理学类() {
                return 物理学类;
            }

            public void set物理学类(List<String> 物理学类) {
                this.物理学类 = 物理学类;
            }

            public List<String> get机械类() {
                return 机械类;
            }

            public void set机械类(List<String> 机械类) {
                this.机械类 = 机械类;
            }

            public List<String> get工业工程类() {
                return 工业工程类;
            }

            public void set工业工程类(List<String> 工业工程类) {
                this.工业工程类 = 工业工程类;
            }

            public List<String> get政治学类() {
                return 政治学类;
            }

            public void set政治学类(List<String> 政治学类) {
                this.政治学类 = 政治学类;
            }

            public List<String> get电气类() {
                return 电气类;
            }

            public void set电气类(List<String> 电气类) {
                this.电气类 = 电气类;
            }

            public List<String> get物流管理与工程类() {
                return 物流管理与工程类;
            }

            public void set物流管理与工程类(List<String> 物流管理与工程类) {
                this.物流管理与工程类 = 物流管理与工程类;
            }

            public List<String> get民族学类() {
                return 民族学类;
            }

            public void set民族学类(List<String> 民族学类) {
                this.民族学类 = 民族学类;
            }

            public List<String> get社会学类() {
                return 社会学类;
            }

            public void set社会学类(List<String> 社会学类) {
                this.社会学类 = 社会学类;
            }

            public List<String> get护理学类() {
                return 护理学类;
            }

            public void set护理学类(List<String> 护理学类) {
                this.护理学类 = 护理学类;
            }

            public List<String> get自然保护与环境生态类() {
                return 自然保护与环境生态类;
            }

            public void set自然保护与环境生态类(List<String> 自然保护与环境生态类) {
                this.自然保护与环境生态类 = 自然保护与环境生态类;
            }

            public List<String> get纺织类() {
                return 纺织类;
            }

            public void set纺织类(List<String> 纺织类) {
                this.纺织类 = 纺织类;
            }

            public List<String> get新闻传播学类() {
                return 新闻传播学类;
            }

            public void set新闻传播学类(List<String> 新闻传播学类) {
                this.新闻传播学类 = 新闻传播学类;
            }

            public List<String> get设计学类() {
                return 设计学类;
            }

            public void set设计学类(List<String> 设计学类) {
                this.设计学类 = 设计学类;
            }

            public List<String> get草学类() {
                return 草学类;
            }

            public void set草学类(List<String> 草学类) {
                this.草学类 = 草学类;
            }

            public List<String> get基础医学类() {
                return 基础医学类;
            }

            public void set基础医学类(List<String> 基础医学类) {
                this.基础医学类 = 基础医学类;
            }

            public List<String> get食品科学与工程类() {
                return 食品科学与工程类;
            }

            public void set食品科学与工程类(List<String> 食品科学与工程类) {
                this.食品科学与工程类 = 食品科学与工程类;
            }

            public List<String> get医学技术类() {
                return 医学技术类;
            }

            public void set医学技术类(List<String> 医学技术类) {
                this.医学技术类 = 医学技术类;
            }

            public List<String> get建筑类学() {
                return 建筑类学;
            }

            public void set建筑类学(List<String> 建筑类学) {
                this.建筑类学 = 建筑类学;
            }

            public List<String> get化学类() {
                return 化学类;
            }

            public void set化学类(List<String> 化学类) {
                this.化学类 = 化学类;
            }

            public List<String> get体育学类() {
                return 体育学类;
            }

            public void set体育学类(List<String> 体育学类) {
                this.体育学类 = 体育学类;
            }

            public List<String> get矿业类() {
                return 矿业类;
            }

            public void set矿业类(List<String> 矿业类) {
                this.矿业类 = 矿业类;
            }

            public List<String> get工商管理类() {
                return 工商管理类;
            }

            public void set工商管理类(List<String> 工商管理类) {
                this.工商管理类 = 工商管理类;
            }

            public List<String> get统计学类() {
                return 统计学类;
            }

            public void set统计学类(List<String> 统计学类) {
                this.统计学类 = 统计学类;
            }

            public List<String> get公共管理类() {
                return 公共管理类;
            }

            public void set公共管理类(List<String> 公共管理类) {
                this.公共管理类 = 公共管理类;
            }

            public List<String> get中药学类() {
                return 中药学类;
            }

            public void set中药学类(List<String> 中药学类) {
                this.中药学类 = 中药学类;
            }

            public List<String> get生物科学类() {
                return 生物科学类;
            }

            public void set生物科学类(List<String> 生物科学类) {
                this.生物科学类 = 生物科学类;
            }

            public List<String> get旅游管理类() {
                return 旅游管理类;
            }

            public void set旅游管理类(List<String> 旅游管理类) {
                this.旅游管理类 = 旅游管理类;
            }

            public List<String> get外国语言文学类() {
                return 外国语言文学类;
            }

            public void set外国语言文学类(List<String> 外国语言文学类) {
                this.外国语言文学类 = 外国语言文学类;
            }

            public List<String> get动物生产类() {
                return 动物生产类;
            }

            public void set动物生产类(List<String> 动物生产类) {
                this.动物生产类 = 动物生产类;
            }

            public List<String> get林学类() {
                return 林学类;
            }

            public void set林学类(List<String> 林学类) {
                this.林学类 = 林学类;
            }

            public List<String> get安全科学与工程类() {
                return 安全科学与工程类;
            }

            public void set安全科学与工程类(List<String> 安全科学与工程类) {
                this.安全科学与工程类 = 安全科学与工程类;
            }

            public List<String> get交通运输类() {
                return 交通运输类;
            }

            public void set交通运输类(List<String> 交通运输类) {
                this.交通运输类 = 交通运输类;
            }

            public List<String> get地球物理学类() {
                return 地球物理学类;
            }

            public void set地球物理学类(List<String> 地球物理学类) {
                this.地球物理学类 = 地球物理学类;
            }

            public List<String> get大气科学类() {
                return 大气科学类;
            }

            public void set大气科学类(List<String> 大气科学类) {
                this.大气科学类 = 大气科学类;
            }

            public List<String> get经济学类() {
                return 经济学类;
            }

            public void set经济学类(List<String> 经济学类) {
                this.经济学类 = 经济学类;
            }

            public List<String> get历史学类() {
                return 历史学类;
            }

            public void set历史学类(List<String> 历史学类) {
                this.历史学类 = 历史学类;
            }

            public List<String> get农业工程类() {
                return 农业工程类;
            }

            public void set农业工程类(List<String> 农业工程类) {
                this.农业工程类 = 农业工程类;
            }

            public List<String> get材料类() {
                return 材料类;
            }

            public void set材料类(List<String> 材料类) {
                this.材料类 = 材料类;
            }

            public List<String> get计算机类() {
                return 计算机类;
            }

            public void set计算机类(List<String> 计算机类) {
                this.计算机类 = 计算机类;
            }

            public List<String> get天文学类() {
                return 天文学类;
            }

            public void set天文学类(List<String> 天文学类) {
                this.天文学类 = 天文学类;
            }

            public List<String> get中西医结合类() {
                return 中西医结合类;
            }

            public void set中西医结合类(List<String> 中西医结合类) {
                this.中西医结合类 = 中西医结合类;
            }

            public List<String> get图书情报与档案管理类() {
                return 图书情报与档案管理类;
            }

            public void set图书情报与档案管理类(List<String> 图书情报与档案管理类) {
                this.图书情报与档案管理类 = 图书情报与档案管理类;
            }

            public List<String> get水产类() {
                return 水产类;
            }

            public void set水产类(List<String> 水产类) {
                this.水产类 = 水产类;
            }

            public List<String> get化工与制药类() {
                return 化工与制药类;
            }

            public void set化工与制药类(List<String> 化工与制药类) {
                this.化工与制药类 = 化工与制药类;
            }

            public List<String> get数学类() {
                return 数学类;
            }

            public void set数学类(List<String> 数学类) {
                this.数学类 = 数学类;
            }

            public List<String> get中医学类() {
                return 中医学类;
            }

            public void set中医学类(List<String> 中医学类) {
                this.中医学类 = 中医学类;
            }

            public List<String> get法学类() {
                return 法学类;
            }

            public void set法学类(List<String> 法学类) {
                this.法学类 = 法学类;
            }

            public List<String> get公共卫生与预防医学类() {
                return 公共卫生与预防医学类;
            }

            public void set公共卫生与预防医学类(List<String> 公共卫生与预防医学类) {
                this.公共卫生与预防医学类 = 公共卫生与预防医学类;
            }

            public List<String> get马克思主义理论类() {
                return 马克思主义理论类;
            }

            public void set马克思主义理论类(List<String> 马克思主义理论类) {
                this.马克思主义理论类 = 马克思主义理论类;
            }

            public List<String> get电子商务类() {
                return 电子商务类;
            }

            public void set电子商务类(List<String> 电子商务类) {
                this.电子商务类 = 电子商务类;
            }

            public List<String> get经济与贸易类() {
                return 经济与贸易类;
            }

            public void set经济与贸易类(List<String> 经济与贸易类) {
                this.经济与贸易类 = 经济与贸易类;
            }

            public List<String> get生物医学工程类() {
                return 生物医学工程类;
            }

            public void set生物医学工程类(List<String> 生物医学工程类) {
                this.生物医学工程类 = 生物医学工程类;
            }

            public List<String> get公安学类() {
                return 公安学类;
            }

            public void set公安学类(List<String> 公安学类) {
                this.公安学类 = 公安学类;
            }

            public List<String> get戏剧与影视学类() {
                return 戏剧与影视学类;
            }

            public void set戏剧与影视学类(List<String> 戏剧与影视学类) {
                this.戏剧与影视学类 = 戏剧与影视学类;
            }

            public List<String> get轻工类() {
                return 轻工类;
            }

            public void set轻工类(List<String> 轻工类) {
                this.轻工类 = 轻工类;
            }

            public List<String> get艺术学理论类() {
                return 艺术学理论类;
            }

            public void set艺术学理论类(List<String> 艺术学理论类) {
                this.艺术学理论类 = 艺术学理论类;
            }

            public List<String> get地质类() {
                return 地质类;
            }

            public void set地质类(List<String> 地质类) {
                this.地质类 = 地质类;
            }

            public List<String> get财政学类() {
                return 财政学类;
            }

            public void set财政学类(List<String> 财政学类) {
                this.财政学类 = 财政学类;
            }

            public List<String> get金融学类() {
                return 金融学类;
            }

            public void set金融学类(List<String> 金融学类) {
                this.金融学类 = 金融学类;
            }

            public List<String> get动物医学类() {
                return 动物医学类;
            }

            public void set动物医学类(List<String> 动物医学类) {
                this.动物医学类 = 动物医学类;
            }

            public List<String> get地理科学类() {
                return 地理科学类;
            }

            public void set地理科学类(List<String> 地理科学类) {
                this.地理科学类 = 地理科学类;
            }

            public List<String> get能源动力类() {
                return 能源动力类;
            }

            public void set能源动力类(List<String> 能源动力类) {
                this.能源动力类 = 能源动力类;
            }

            public List<String> get土木类() {
                return 土木类;
            }

            public void set土木类(List<String> 土木类) {
                this.土木类 = 土木类;
            }

            public List<String> get法医学类() {
                return 法医学类;
            }

            public void set法医学类(List<String> 法医学类) {
                this.法医学类 = 法医学类;
            }

            public List<String> get自动化类() {
                return 自动化类;
            }

            public void set自动化类(List<String> 自动化类) {
                this.自动化类 = 自动化类;
            }

            public List<String> get航空航天类() {
                return 航空航天类;
            }

            public void set航空航天类(List<String> 航空航天类) {
                this.航空航天类 = 航空航天类;
            }

            public List<String> get生物工程类() {
                return 生物工程类;
            }

            public void set生物工程类(List<String> 生物工程类) {
                this.生物工程类 = 生物工程类;
            }

            public List<String> get力学类() {
                return 力学类;
            }

            public void set力学类(List<String> 力学类) {
                this.力学类 = 力学类;
            }

            public List<String> get核工程类() {
                return 核工程类;
            }

            public void set核工程类(List<String> 核工程类) {
                this.核工程类 = 核工程类;
            }

            public List<String> get地质学类() {
                return 地质学类;
            }

            public void set地质学类(List<String> 地质学类) {
                this.地质学类 = 地质学类;
            }

            public List<String> get口腔医学类() {
                return 口腔医学类;
            }

            public void set口腔医学类(List<String> 口腔医学类) {
                this.口腔医学类 = 口腔医学类;
            }

            public List<String> get兵器类() {
                return 兵器类;
            }

            public void set兵器类(List<String> 兵器类) {
                this.兵器类 = 兵器类;
            }

            public List<String> get农业经济管理类() {
                return 农业经济管理类;
            }

            public void set农业经济管理类(List<String> 农业经济管理类) {
                this.农业经济管理类 = 农业经济管理类;
            }

            public List<String> get管理科学与工程类() {
                return 管理科学与工程类;
            }

            public void set管理科学与工程类(List<String> 管理科学与工程类) {
                this.管理科学与工程类 = 管理科学与工程类;
            }

            public List<String> get临床医学类() {
                return 临床医学类;
            }

            public void set临床医学类(List<String> 临床医学类) {
                this.临床医学类 = 临床医学类;
            }

            public List<String> get药学类() {
                return 药学类;
            }

            public void set药学类(List<String> 药学类) {
                this.药学类 = 药学类;
            }

            public List<String> get美术学类() {
                return 美术学类;
            }

            public void set美术学类(List<String> 美术学类) {
                this.美术学类 = 美术学类;
            }

            public List<String> get心理学类() {
                return 心理学类;
            }

            public void set心理学类(List<String> 心理学类) {
                this.心理学类 = 心理学类;
            }
        }

        public static class 历史学Bean {
            private List<String> 中国语言文学类;
            private List<String> 测绘类;
            private List<String> 水利类;
            private List<String> 林业工程类;
            private List<String> 海洋科学类;
            private List<String> 音乐与舞蹈学类;
            private List<String> 植物生产类;
            private List<String> 哲学类;
            private List<String> 教育学类;
            private List<String> 海洋工程类;
            private List<String> 公安技术类;
            private List<String> 物理学类;
            private List<String> 机械类;
            private List<String> 工业工程类;
            private List<String> 政治学类;
            private List<String> 电气类;
            private List<String> 物流管理与工程类;
            private List<String> 民族学类;
            private List<String> 社会学类;
            private List<String> 护理学类;
            private List<String> 自然保护与环境生态类;
            private List<String> 纺织类;
            private List<String> 新闻传播学类;
            private List<String> 设计学类;
            private List<String> 草学类;
            private List<String> 基础医学类;
            private List<String> 食品科学与工程类;
            private List<String> 医学技术类;
            private List<String> 建筑类学;
            private List<String> 化学类;
            private List<String> 体育学类;
            private List<String> 矿业类;
            private List<String> 工商管理类;
            private List<String> 统计学类;
            private List<String> 公共管理类;
            private List<String> 中药学类;
            private List<String> 生物科学类;
            private List<String> 旅游管理类;
            private List<String> 外国语言文学类;
            private List<String> 动物生产类;
            private List<String> 林学类;
            private List<String> 安全科学与工程类;
            private List<String> 交通运输类;
            private List<String> 地球物理学类;
            private List<String> 大气科学类;
            private List<String> 经济学类;
            private List<String> 历史学类;
            private List<String> 农业工程类;
            private List<String> 材料类;
            private List<String> 计算机类;
            private List<String> 天文学类;
            private List<String> 中西医结合类;
            private List<String> 图书情报与档案管理类;
            private List<String> 水产类;
            private List<String> 化工与制药类;
            private List<String> 数学类;
            private List<String> 中医学类;
            private List<String> 法学类;
            private List<String> 公共卫生与预防医学类;
            private List<String> 马克思主义理论类;
            private List<String> 电子商务类;
            private List<String> 经济与贸易类;
            private List<String> 生物医学工程类;
            private List<String> 公安学类;
            private List<String> 戏剧与影视学类;
            private List<String> 轻工类;
            private List<String> 艺术学理论类;
            private List<String> 地质类;
            private List<String> 财政学类;
            private List<String> 金融学类;
            private List<String> 动物医学类;
            private List<String> 地理科学类;
            private List<String> 能源动力类;
            private List<String> 土木类;
            private List<String> 法医学类;
            private List<String> 自动化类;
            private List<String> 航空航天类;
            private List<String> 生物工程类;
            private List<String> 力学类;
            private List<String> 核工程类;
            private List<String> 地质学类;
            private List<String> 口腔医学类;
            private List<String> 兵器类;
            private List<String> 农业经济管理类;
            private List<String> 管理科学与工程类;
            private List<String> 临床医学类;
            private List<String> 药学类;
            private List<String> 美术学类;
            private List<String> 心理学类;

            public List<String> get中国语言文学类() {
                return 中国语言文学类;
            }

            public void set中国语言文学类(List<String> 中国语言文学类) {
                this.中国语言文学类 = 中国语言文学类;
            }

            public List<String> get测绘类() {
                return 测绘类;
            }

            public void set测绘类(List<String> 测绘类) {
                this.测绘类 = 测绘类;
            }

            public List<String> get水利类() {
                return 水利类;
            }

            public void set水利类(List<String> 水利类) {
                this.水利类 = 水利类;
            }

            public List<String> get林业工程类() {
                return 林业工程类;
            }

            public void set林业工程类(List<String> 林业工程类) {
                this.林业工程类 = 林业工程类;
            }

            public List<String> get海洋科学类() {
                return 海洋科学类;
            }

            public void set海洋科学类(List<String> 海洋科学类) {
                this.海洋科学类 = 海洋科学类;
            }

            public List<String> get音乐与舞蹈学类() {
                return 音乐与舞蹈学类;
            }

            public void set音乐与舞蹈学类(List<String> 音乐与舞蹈学类) {
                this.音乐与舞蹈学类 = 音乐与舞蹈学类;
            }

            public List<String> get植物生产类() {
                return 植物生产类;
            }

            public void set植物生产类(List<String> 植物生产类) {
                this.植物生产类 = 植物生产类;
            }

            public List<String> get哲学类() {
                return 哲学类;
            }

            public void set哲学类(List<String> 哲学类) {
                this.哲学类 = 哲学类;
            }

            public List<String> get教育学类() {
                return 教育学类;
            }

            public void set教育学类(List<String> 教育学类) {
                this.教育学类 = 教育学类;
            }

            public List<String> get海洋工程类() {
                return 海洋工程类;
            }

            public void set海洋工程类(List<String> 海洋工程类) {
                this.海洋工程类 = 海洋工程类;
            }

            public List<String> get公安技术类() {
                return 公安技术类;
            }

            public void set公安技术类(List<String> 公安技术类) {
                this.公安技术类 = 公安技术类;
            }

            public List<String> get物理学类() {
                return 物理学类;
            }

            public void set物理学类(List<String> 物理学类) {
                this.物理学类 = 物理学类;
            }

            public List<String> get机械类() {
                return 机械类;
            }

            public void set机械类(List<String> 机械类) {
                this.机械类 = 机械类;
            }

            public List<String> get工业工程类() {
                return 工业工程类;
            }

            public void set工业工程类(List<String> 工业工程类) {
                this.工业工程类 = 工业工程类;
            }

            public List<String> get政治学类() {
                return 政治学类;
            }

            public void set政治学类(List<String> 政治学类) {
                this.政治学类 = 政治学类;
            }

            public List<String> get电气类() {
                return 电气类;
            }

            public void set电气类(List<String> 电气类) {
                this.电气类 = 电气类;
            }

            public List<String> get物流管理与工程类() {
                return 物流管理与工程类;
            }

            public void set物流管理与工程类(List<String> 物流管理与工程类) {
                this.物流管理与工程类 = 物流管理与工程类;
            }

            public List<String> get民族学类() {
                return 民族学类;
            }

            public void set民族学类(List<String> 民族学类) {
                this.民族学类 = 民族学类;
            }

            public List<String> get社会学类() {
                return 社会学类;
            }

            public void set社会学类(List<String> 社会学类) {
                this.社会学类 = 社会学类;
            }

            public List<String> get护理学类() {
                return 护理学类;
            }

            public void set护理学类(List<String> 护理学类) {
                this.护理学类 = 护理学类;
            }

            public List<String> get自然保护与环境生态类() {
                return 自然保护与环境生态类;
            }

            public void set自然保护与环境生态类(List<String> 自然保护与环境生态类) {
                this.自然保护与环境生态类 = 自然保护与环境生态类;
            }

            public List<String> get纺织类() {
                return 纺织类;
            }

            public void set纺织类(List<String> 纺织类) {
                this.纺织类 = 纺织类;
            }

            public List<String> get新闻传播学类() {
                return 新闻传播学类;
            }

            public void set新闻传播学类(List<String> 新闻传播学类) {
                this.新闻传播学类 = 新闻传播学类;
            }

            public List<String> get设计学类() {
                return 设计学类;
            }

            public void set设计学类(List<String> 设计学类) {
                this.设计学类 = 设计学类;
            }

            public List<String> get草学类() {
                return 草学类;
            }

            public void set草学类(List<String> 草学类) {
                this.草学类 = 草学类;
            }

            public List<String> get基础医学类() {
                return 基础医学类;
            }

            public void set基础医学类(List<String> 基础医学类) {
                this.基础医学类 = 基础医学类;
            }

            public List<String> get食品科学与工程类() {
                return 食品科学与工程类;
            }

            public void set食品科学与工程类(List<String> 食品科学与工程类) {
                this.食品科学与工程类 = 食品科学与工程类;
            }

            public List<String> get医学技术类() {
                return 医学技术类;
            }

            public void set医学技术类(List<String> 医学技术类) {
                this.医学技术类 = 医学技术类;
            }

            public List<String> get建筑类学() {
                return 建筑类学;
            }

            public void set建筑类学(List<String> 建筑类学) {
                this.建筑类学 = 建筑类学;
            }

            public List<String> get化学类() {
                return 化学类;
            }

            public void set化学类(List<String> 化学类) {
                this.化学类 = 化学类;
            }

            public List<String> get体育学类() {
                return 体育学类;
            }

            public void set体育学类(List<String> 体育学类) {
                this.体育学类 = 体育学类;
            }

            public List<String> get矿业类() {
                return 矿业类;
            }

            public void set矿业类(List<String> 矿业类) {
                this.矿业类 = 矿业类;
            }

            public List<String> get工商管理类() {
                return 工商管理类;
            }

            public void set工商管理类(List<String> 工商管理类) {
                this.工商管理类 = 工商管理类;
            }

            public List<String> get统计学类() {
                return 统计学类;
            }

            public void set统计学类(List<String> 统计学类) {
                this.统计学类 = 统计学类;
            }

            public List<String> get公共管理类() {
                return 公共管理类;
            }

            public void set公共管理类(List<String> 公共管理类) {
                this.公共管理类 = 公共管理类;
            }

            public List<String> get中药学类() {
                return 中药学类;
            }

            public void set中药学类(List<String> 中药学类) {
                this.中药学类 = 中药学类;
            }

            public List<String> get生物科学类() {
                return 生物科学类;
            }

            public void set生物科学类(List<String> 生物科学类) {
                this.生物科学类 = 生物科学类;
            }

            public List<String> get旅游管理类() {
                return 旅游管理类;
            }

            public void set旅游管理类(List<String> 旅游管理类) {
                this.旅游管理类 = 旅游管理类;
            }

            public List<String> get外国语言文学类() {
                return 外国语言文学类;
            }

            public void set外国语言文学类(List<String> 外国语言文学类) {
                this.外国语言文学类 = 外国语言文学类;
            }

            public List<String> get动物生产类() {
                return 动物生产类;
            }

            public void set动物生产类(List<String> 动物生产类) {
                this.动物生产类 = 动物生产类;
            }

            public List<String> get林学类() {
                return 林学类;
            }

            public void set林学类(List<String> 林学类) {
                this.林学类 = 林学类;
            }

            public List<String> get安全科学与工程类() {
                return 安全科学与工程类;
            }

            public void set安全科学与工程类(List<String> 安全科学与工程类) {
                this.安全科学与工程类 = 安全科学与工程类;
            }

            public List<String> get交通运输类() {
                return 交通运输类;
            }

            public void set交通运输类(List<String> 交通运输类) {
                this.交通运输类 = 交通运输类;
            }

            public List<String> get地球物理学类() {
                return 地球物理学类;
            }

            public void set地球物理学类(List<String> 地球物理学类) {
                this.地球物理学类 = 地球物理学类;
            }

            public List<String> get大气科学类() {
                return 大气科学类;
            }

            public void set大气科学类(List<String> 大气科学类) {
                this.大气科学类 = 大气科学类;
            }

            public List<String> get经济学类() {
                return 经济学类;
            }

            public void set经济学类(List<String> 经济学类) {
                this.经济学类 = 经济学类;
            }

            public List<String> get历史学类() {
                return 历史学类;
            }

            public void set历史学类(List<String> 历史学类) {
                this.历史学类 = 历史学类;
            }

            public List<String> get农业工程类() {
                return 农业工程类;
            }

            public void set农业工程类(List<String> 农业工程类) {
                this.农业工程类 = 农业工程类;
            }

            public List<String> get材料类() {
                return 材料类;
            }

            public void set材料类(List<String> 材料类) {
                this.材料类 = 材料类;
            }

            public List<String> get计算机类() {
                return 计算机类;
            }

            public void set计算机类(List<String> 计算机类) {
                this.计算机类 = 计算机类;
            }

            public List<String> get天文学类() {
                return 天文学类;
            }

            public void set天文学类(List<String> 天文学类) {
                this.天文学类 = 天文学类;
            }

            public List<String> get中西医结合类() {
                return 中西医结合类;
            }

            public void set中西医结合类(List<String> 中西医结合类) {
                this.中西医结合类 = 中西医结合类;
            }

            public List<String> get图书情报与档案管理类() {
                return 图书情报与档案管理类;
            }

            public void set图书情报与档案管理类(List<String> 图书情报与档案管理类) {
                this.图书情报与档案管理类 = 图书情报与档案管理类;
            }

            public List<String> get水产类() {
                return 水产类;
            }

            public void set水产类(List<String> 水产类) {
                this.水产类 = 水产类;
            }

            public List<String> get化工与制药类() {
                return 化工与制药类;
            }

            public void set化工与制药类(List<String> 化工与制药类) {
                this.化工与制药类 = 化工与制药类;
            }

            public List<String> get数学类() {
                return 数学类;
            }

            public void set数学类(List<String> 数学类) {
                this.数学类 = 数学类;
            }

            public List<String> get中医学类() {
                return 中医学类;
            }

            public void set中医学类(List<String> 中医学类) {
                this.中医学类 = 中医学类;
            }

            public List<String> get法学类() {
                return 法学类;
            }

            public void set法学类(List<String> 法学类) {
                this.法学类 = 法学类;
            }

            public List<String> get公共卫生与预防医学类() {
                return 公共卫生与预防医学类;
            }

            public void set公共卫生与预防医学类(List<String> 公共卫生与预防医学类) {
                this.公共卫生与预防医学类 = 公共卫生与预防医学类;
            }

            public List<String> get马克思主义理论类() {
                return 马克思主义理论类;
            }

            public void set马克思主义理论类(List<String> 马克思主义理论类) {
                this.马克思主义理论类 = 马克思主义理论类;
            }

            public List<String> get电子商务类() {
                return 电子商务类;
            }

            public void set电子商务类(List<String> 电子商务类) {
                this.电子商务类 = 电子商务类;
            }

            public List<String> get经济与贸易类() {
                return 经济与贸易类;
            }

            public void set经济与贸易类(List<String> 经济与贸易类) {
                this.经济与贸易类 = 经济与贸易类;
            }

            public List<String> get生物医学工程类() {
                return 生物医学工程类;
            }

            public void set生物医学工程类(List<String> 生物医学工程类) {
                this.生物医学工程类 = 生物医学工程类;
            }

            public List<String> get公安学类() {
                return 公安学类;
            }

            public void set公安学类(List<String> 公安学类) {
                this.公安学类 = 公安学类;
            }

            public List<String> get戏剧与影视学类() {
                return 戏剧与影视学类;
            }

            public void set戏剧与影视学类(List<String> 戏剧与影视学类) {
                this.戏剧与影视学类 = 戏剧与影视学类;
            }

            public List<String> get轻工类() {
                return 轻工类;
            }

            public void set轻工类(List<String> 轻工类) {
                this.轻工类 = 轻工类;
            }

            public List<String> get艺术学理论类() {
                return 艺术学理论类;
            }

            public void set艺术学理论类(List<String> 艺术学理论类) {
                this.艺术学理论类 = 艺术学理论类;
            }

            public List<String> get地质类() {
                return 地质类;
            }

            public void set地质类(List<String> 地质类) {
                this.地质类 = 地质类;
            }

            public List<String> get财政学类() {
                return 财政学类;
            }

            public void set财政学类(List<String> 财政学类) {
                this.财政学类 = 财政学类;
            }

            public List<String> get金融学类() {
                return 金融学类;
            }

            public void set金融学类(List<String> 金融学类) {
                this.金融学类 = 金融学类;
            }

            public List<String> get动物医学类() {
                return 动物医学类;
            }

            public void set动物医学类(List<String> 动物医学类) {
                this.动物医学类 = 动物医学类;
            }

            public List<String> get地理科学类() {
                return 地理科学类;
            }

            public void set地理科学类(List<String> 地理科学类) {
                this.地理科学类 = 地理科学类;
            }

            public List<String> get能源动力类() {
                return 能源动力类;
            }

            public void set能源动力类(List<String> 能源动力类) {
                this.能源动力类 = 能源动力类;
            }

            public List<String> get土木类() {
                return 土木类;
            }

            public void set土木类(List<String> 土木类) {
                this.土木类 = 土木类;
            }

            public List<String> get法医学类() {
                return 法医学类;
            }

            public void set法医学类(List<String> 法医学类) {
                this.法医学类 = 法医学类;
            }

            public List<String> get自动化类() {
                return 自动化类;
            }

            public void set自动化类(List<String> 自动化类) {
                this.自动化类 = 自动化类;
            }

            public List<String> get航空航天类() {
                return 航空航天类;
            }

            public void set航空航天类(List<String> 航空航天类) {
                this.航空航天类 = 航空航天类;
            }

            public List<String> get生物工程类() {
                return 生物工程类;
            }

            public void set生物工程类(List<String> 生物工程类) {
                this.生物工程类 = 生物工程类;
            }

            public List<String> get力学类() {
                return 力学类;
            }

            public void set力学类(List<String> 力学类) {
                this.力学类 = 力学类;
            }

            public List<String> get核工程类() {
                return 核工程类;
            }

            public void set核工程类(List<String> 核工程类) {
                this.核工程类 = 核工程类;
            }

            public List<String> get地质学类() {
                return 地质学类;
            }

            public void set地质学类(List<String> 地质学类) {
                this.地质学类 = 地质学类;
            }

            public List<String> get口腔医学类() {
                return 口腔医学类;
            }

            public void set口腔医学类(List<String> 口腔医学类) {
                this.口腔医学类 = 口腔医学类;
            }

            public List<String> get兵器类() {
                return 兵器类;
            }

            public void set兵器类(List<String> 兵器类) {
                this.兵器类 = 兵器类;
            }

            public List<String> get农业经济管理类() {
                return 农业经济管理类;
            }

            public void set农业经济管理类(List<String> 农业经济管理类) {
                this.农业经济管理类 = 农业经济管理类;
            }

            public List<String> get管理科学与工程类() {
                return 管理科学与工程类;
            }

            public void set管理科学与工程类(List<String> 管理科学与工程类) {
                this.管理科学与工程类 = 管理科学与工程类;
            }

            public List<String> get临床医学类() {
                return 临床医学类;
            }

            public void set临床医学类(List<String> 临床医学类) {
                this.临床医学类 = 临床医学类;
            }

            public List<String> get药学类() {
                return 药学类;
            }

            public void set药学类(List<String> 药学类) {
                this.药学类 = 药学类;
            }

            public List<String> get美术学类() {
                return 美术学类;
            }

            public void set美术学类(List<String> 美术学类) {
                this.美术学类 = 美术学类;
            }

            public List<String> get心理学类() {
                return 心理学类;
            }

            public void set心理学类(List<String> 心理学类) {
                this.心理学类 = 心理学类;
            }
        }

        public static class 哲学Bean {
            private List<String> 中国语言文学类;
            private List<String> 测绘类;
            private List<String> 水利类;
            private List<String> 林业工程类;
            private List<String> 海洋科学类;
            private List<String> 音乐与舞蹈学类;
            private List<String> 植物生产类;
            private List<String> 哲学类;
            private List<String> 教育学类;
            private List<String> 海洋工程类;
            private List<String> 公安技术类;
            private List<String> 物理学类;
            private List<String> 机械类;
            private List<String> 工业工程类;
            private List<String> 政治学类;
            private List<String> 电气类;
            private List<String> 物流管理与工程类;
            private List<String> 民族学类;
            private List<String> 社会学类;
            private List<String> 护理学类;
            private List<String> 自然保护与环境生态类;
            private List<String> 纺织类;
            private List<String> 新闻传播学类;
            private List<String> 设计学类;
            private List<String> 草学类;
            private List<String> 基础医学类;
            private List<String> 食品科学与工程类;
            private List<String> 医学技术类;
            private List<String> 建筑类学;
            private List<String> 化学类;
            private List<String> 体育学类;
            private List<String> 矿业类;
            private List<String> 工商管理类;
            private List<String> 统计学类;
            private List<String> 公共管理类;
            private List<String> 中药学类;
            private List<String> 生物科学类;
            private List<String> 旅游管理类;
            private List<String> 外国语言文学类;
            private List<String> 动物生产类;
            private List<String> 林学类;
            private List<String> 安全科学与工程类;
            private List<String> 交通运输类;
            private List<String> 地球物理学类;
            private List<String> 大气科学类;
            private List<String> 经济学类;
            private List<String> 历史学类;
            private List<String> 农业工程类;
            private List<String> 材料类;
            private List<String> 计算机类;
            private List<String> 天文学类;
            private List<String> 中西医结合类;
            private List<String> 图书情报与档案管理类;
            private List<String> 水产类;
            private List<String> 化工与制药类;
            private List<String> 数学类;
            private List<String> 中医学类;
            private List<String> 法学类;
            private List<String> 公共卫生与预防医学类;
            private List<String> 马克思主义理论类;
            private List<String> 电子商务类;
            private List<String> 经济与贸易类;
            private List<String> 生物医学工程类;
            private List<String> 公安学类;
            private List<String> 戏剧与影视学类;
            private List<String> 轻工类;
            private List<String> 艺术学理论类;
            private List<String> 地质类;
            private List<String> 财政学类;
            private List<String> 金融学类;
            private List<String> 动物医学类;
            private List<String> 地理科学类;
            private List<String> 能源动力类;
            private List<String> 土木类;
            private List<String> 法医学类;
            private List<String> 自动化类;
            private List<String> 航空航天类;
            private List<String> 生物工程类;
            private List<String> 力学类;
            private List<String> 核工程类;
            private List<String> 地质学类;
            private List<String> 口腔医学类;
            private List<String> 兵器类;
            private List<String> 农业经济管理类;
            private List<String> 管理科学与工程类;
            private List<String> 临床医学类;
            private List<String> 药学类;
            private List<String> 美术学类;
            private List<String> 心理学类;

            public List<String> get中国语言文学类() {
                return 中国语言文学类;
            }

            public void set中国语言文学类(List<String> 中国语言文学类) {
                this.中国语言文学类 = 中国语言文学类;
            }

            public List<String> get测绘类() {
                return 测绘类;
            }

            public void set测绘类(List<String> 测绘类) {
                this.测绘类 = 测绘类;
            }

            public List<String> get水利类() {
                return 水利类;
            }

            public void set水利类(List<String> 水利类) {
                this.水利类 = 水利类;
            }

            public List<String> get林业工程类() {
                return 林业工程类;
            }

            public void set林业工程类(List<String> 林业工程类) {
                this.林业工程类 = 林业工程类;
            }

            public List<String> get海洋科学类() {
                return 海洋科学类;
            }

            public void set海洋科学类(List<String> 海洋科学类) {
                this.海洋科学类 = 海洋科学类;
            }

            public List<String> get音乐与舞蹈学类() {
                return 音乐与舞蹈学类;
            }

            public void set音乐与舞蹈学类(List<String> 音乐与舞蹈学类) {
                this.音乐与舞蹈学类 = 音乐与舞蹈学类;
            }

            public List<String> get植物生产类() {
                return 植物生产类;
            }

            public void set植物生产类(List<String> 植物生产类) {
                this.植物生产类 = 植物生产类;
            }

            public List<String> get哲学类() {
                return 哲学类;
            }

            public void set哲学类(List<String> 哲学类) {
                this.哲学类 = 哲学类;
            }

            public List<String> get教育学类() {
                return 教育学类;
            }

            public void set教育学类(List<String> 教育学类) {
                this.教育学类 = 教育学类;
            }

            public List<String> get海洋工程类() {
                return 海洋工程类;
            }

            public void set海洋工程类(List<String> 海洋工程类) {
                this.海洋工程类 = 海洋工程类;
            }

            public List<String> get公安技术类() {
                return 公安技术类;
            }

            public void set公安技术类(List<String> 公安技术类) {
                this.公安技术类 = 公安技术类;
            }

            public List<String> get物理学类() {
                return 物理学类;
            }

            public void set物理学类(List<String> 物理学类) {
                this.物理学类 = 物理学类;
            }

            public List<String> get机械类() {
                return 机械类;
            }

            public void set机械类(List<String> 机械类) {
                this.机械类 = 机械类;
            }

            public List<String> get工业工程类() {
                return 工业工程类;
            }

            public void set工业工程类(List<String> 工业工程类) {
                this.工业工程类 = 工业工程类;
            }

            public List<String> get政治学类() {
                return 政治学类;
            }

            public void set政治学类(List<String> 政治学类) {
                this.政治学类 = 政治学类;
            }

            public List<String> get电气类() {
                return 电气类;
            }

            public void set电气类(List<String> 电气类) {
                this.电气类 = 电气类;
            }

            public List<String> get物流管理与工程类() {
                return 物流管理与工程类;
            }

            public void set物流管理与工程类(List<String> 物流管理与工程类) {
                this.物流管理与工程类 = 物流管理与工程类;
            }

            public List<String> get民族学类() {
                return 民族学类;
            }

            public void set民族学类(List<String> 民族学类) {
                this.民族学类 = 民族学类;
            }

            public List<String> get社会学类() {
                return 社会学类;
            }

            public void set社会学类(List<String> 社会学类) {
                this.社会学类 = 社会学类;
            }

            public List<String> get护理学类() {
                return 护理学类;
            }

            public void set护理学类(List<String> 护理学类) {
                this.护理学类 = 护理学类;
            }

            public List<String> get自然保护与环境生态类() {
                return 自然保护与环境生态类;
            }

            public void set自然保护与环境生态类(List<String> 自然保护与环境生态类) {
                this.自然保护与环境生态类 = 自然保护与环境生态类;
            }

            public List<String> get纺织类() {
                return 纺织类;
            }

            public void set纺织类(List<String> 纺织类) {
                this.纺织类 = 纺织类;
            }

            public List<String> get新闻传播学类() {
                return 新闻传播学类;
            }

            public void set新闻传播学类(List<String> 新闻传播学类) {
                this.新闻传播学类 = 新闻传播学类;
            }

            public List<String> get设计学类() {
                return 设计学类;
            }

            public void set设计学类(List<String> 设计学类) {
                this.设计学类 = 设计学类;
            }

            public List<String> get草学类() {
                return 草学类;
            }

            public void set草学类(List<String> 草学类) {
                this.草学类 = 草学类;
            }

            public List<String> get基础医学类() {
                return 基础医学类;
            }

            public void set基础医学类(List<String> 基础医学类) {
                this.基础医学类 = 基础医学类;
            }

            public List<String> get食品科学与工程类() {
                return 食品科学与工程类;
            }

            public void set食品科学与工程类(List<String> 食品科学与工程类) {
                this.食品科学与工程类 = 食品科学与工程类;
            }

            public List<String> get医学技术类() {
                return 医学技术类;
            }

            public void set医学技术类(List<String> 医学技术类) {
                this.医学技术类 = 医学技术类;
            }

            public List<String> get建筑类学() {
                return 建筑类学;
            }

            public void set建筑类学(List<String> 建筑类学) {
                this.建筑类学 = 建筑类学;
            }

            public List<String> get化学类() {
                return 化学类;
            }

            public void set化学类(List<String> 化学类) {
                this.化学类 = 化学类;
            }

            public List<String> get体育学类() {
                return 体育学类;
            }

            public void set体育学类(List<String> 体育学类) {
                this.体育学类 = 体育学类;
            }

            public List<String> get矿业类() {
                return 矿业类;
            }

            public void set矿业类(List<String> 矿业类) {
                this.矿业类 = 矿业类;
            }

            public List<String> get工商管理类() {
                return 工商管理类;
            }

            public void set工商管理类(List<String> 工商管理类) {
                this.工商管理类 = 工商管理类;
            }

            public List<String> get统计学类() {
                return 统计学类;
            }

            public void set统计学类(List<String> 统计学类) {
                this.统计学类 = 统计学类;
            }

            public List<String> get公共管理类() {
                return 公共管理类;
            }

            public void set公共管理类(List<String> 公共管理类) {
                this.公共管理类 = 公共管理类;
            }

            public List<String> get中药学类() {
                return 中药学类;
            }

            public void set中药学类(List<String> 中药学类) {
                this.中药学类 = 中药学类;
            }

            public List<String> get生物科学类() {
                return 生物科学类;
            }

            public void set生物科学类(List<String> 生物科学类) {
                this.生物科学类 = 生物科学类;
            }

            public List<String> get旅游管理类() {
                return 旅游管理类;
            }

            public void set旅游管理类(List<String> 旅游管理类) {
                this.旅游管理类 = 旅游管理类;
            }

            public List<String> get外国语言文学类() {
                return 外国语言文学类;
            }

            public void set外国语言文学类(List<String> 外国语言文学类) {
                this.外国语言文学类 = 外国语言文学类;
            }

            public List<String> get动物生产类() {
                return 动物生产类;
            }

            public void set动物生产类(List<String> 动物生产类) {
                this.动物生产类 = 动物生产类;
            }

            public List<String> get林学类() {
                return 林学类;
            }

            public void set林学类(List<String> 林学类) {
                this.林学类 = 林学类;
            }

            public List<String> get安全科学与工程类() {
                return 安全科学与工程类;
            }

            public void set安全科学与工程类(List<String> 安全科学与工程类) {
                this.安全科学与工程类 = 安全科学与工程类;
            }

            public List<String> get交通运输类() {
                return 交通运输类;
            }

            public void set交通运输类(List<String> 交通运输类) {
                this.交通运输类 = 交通运输类;
            }

            public List<String> get地球物理学类() {
                return 地球物理学类;
            }

            public void set地球物理学类(List<String> 地球物理学类) {
                this.地球物理学类 = 地球物理学类;
            }

            public List<String> get大气科学类() {
                return 大气科学类;
            }

            public void set大气科学类(List<String> 大气科学类) {
                this.大气科学类 = 大气科学类;
            }

            public List<String> get经济学类() {
                return 经济学类;
            }

            public void set经济学类(List<String> 经济学类) {
                this.经济学类 = 经济学类;
            }

            public List<String> get历史学类() {
                return 历史学类;
            }

            public void set历史学类(List<String> 历史学类) {
                this.历史学类 = 历史学类;
            }

            public List<String> get农业工程类() {
                return 农业工程类;
            }

            public void set农业工程类(List<String> 农业工程类) {
                this.农业工程类 = 农业工程类;
            }

            public List<String> get材料类() {
                return 材料类;
            }

            public void set材料类(List<String> 材料类) {
                this.材料类 = 材料类;
            }

            public List<String> get计算机类() {
                return 计算机类;
            }

            public void set计算机类(List<String> 计算机类) {
                this.计算机类 = 计算机类;
            }

            public List<String> get天文学类() {
                return 天文学类;
            }

            public void set天文学类(List<String> 天文学类) {
                this.天文学类 = 天文学类;
            }

            public List<String> get中西医结合类() {
                return 中西医结合类;
            }

            public void set中西医结合类(List<String> 中西医结合类) {
                this.中西医结合类 = 中西医结合类;
            }

            public List<String> get图书情报与档案管理类() {
                return 图书情报与档案管理类;
            }

            public void set图书情报与档案管理类(List<String> 图书情报与档案管理类) {
                this.图书情报与档案管理类 = 图书情报与档案管理类;
            }

            public List<String> get水产类() {
                return 水产类;
            }

            public void set水产类(List<String> 水产类) {
                this.水产类 = 水产类;
            }

            public List<String> get化工与制药类() {
                return 化工与制药类;
            }

            public void set化工与制药类(List<String> 化工与制药类) {
                this.化工与制药类 = 化工与制药类;
            }

            public List<String> get数学类() {
                return 数学类;
            }

            public void set数学类(List<String> 数学类) {
                this.数学类 = 数学类;
            }

            public List<String> get中医学类() {
                return 中医学类;
            }

            public void set中医学类(List<String> 中医学类) {
                this.中医学类 = 中医学类;
            }

            public List<String> get法学类() {
                return 法学类;
            }

            public void set法学类(List<String> 法学类) {
                this.法学类 = 法学类;
            }

            public List<String> get公共卫生与预防医学类() {
                return 公共卫生与预防医学类;
            }

            public void set公共卫生与预防医学类(List<String> 公共卫生与预防医学类) {
                this.公共卫生与预防医学类 = 公共卫生与预防医学类;
            }

            public List<String> get马克思主义理论类() {
                return 马克思主义理论类;
            }

            public void set马克思主义理论类(List<String> 马克思主义理论类) {
                this.马克思主义理论类 = 马克思主义理论类;
            }

            public List<String> get电子商务类() {
                return 电子商务类;
            }

            public void set电子商务类(List<String> 电子商务类) {
                this.电子商务类 = 电子商务类;
            }

            public List<String> get经济与贸易类() {
                return 经济与贸易类;
            }

            public void set经济与贸易类(List<String> 经济与贸易类) {
                this.经济与贸易类 = 经济与贸易类;
            }

            public List<String> get生物医学工程类() {
                return 生物医学工程类;
            }

            public void set生物医学工程类(List<String> 生物医学工程类) {
                this.生物医学工程类 = 生物医学工程类;
            }

            public List<String> get公安学类() {
                return 公安学类;
            }

            public void set公安学类(List<String> 公安学类) {
                this.公安学类 = 公安学类;
            }

            public List<String> get戏剧与影视学类() {
                return 戏剧与影视学类;
            }

            public void set戏剧与影视学类(List<String> 戏剧与影视学类) {
                this.戏剧与影视学类 = 戏剧与影视学类;
            }

            public List<String> get轻工类() {
                return 轻工类;
            }

            public void set轻工类(List<String> 轻工类) {
                this.轻工类 = 轻工类;
            }

            public List<String> get艺术学理论类() {
                return 艺术学理论类;
            }

            public void set艺术学理论类(List<String> 艺术学理论类) {
                this.艺术学理论类 = 艺术学理论类;
            }

            public List<String> get地质类() {
                return 地质类;
            }

            public void set地质类(List<String> 地质类) {
                this.地质类 = 地质类;
            }

            public List<String> get财政学类() {
                return 财政学类;
            }

            public void set财政学类(List<String> 财政学类) {
                this.财政学类 = 财政学类;
            }

            public List<String> get金融学类() {
                return 金融学类;
            }

            public void set金融学类(List<String> 金融学类) {
                this.金融学类 = 金融学类;
            }

            public List<String> get动物医学类() {
                return 动物医学类;
            }

            public void set动物医学类(List<String> 动物医学类) {
                this.动物医学类 = 动物医学类;
            }

            public List<String> get地理科学类() {
                return 地理科学类;
            }

            public void set地理科学类(List<String> 地理科学类) {
                this.地理科学类 = 地理科学类;
            }

            public List<String> get能源动力类() {
                return 能源动力类;
            }

            public void set能源动力类(List<String> 能源动力类) {
                this.能源动力类 = 能源动力类;
            }

            public List<String> get土木类() {
                return 土木类;
            }

            public void set土木类(List<String> 土木类) {
                this.土木类 = 土木类;
            }

            public List<String> get法医学类() {
                return 法医学类;
            }

            public void set法医学类(List<String> 法医学类) {
                this.法医学类 = 法医学类;
            }

            public List<String> get自动化类() {
                return 自动化类;
            }

            public void set自动化类(List<String> 自动化类) {
                this.自动化类 = 自动化类;
            }

            public List<String> get航空航天类() {
                return 航空航天类;
            }

            public void set航空航天类(List<String> 航空航天类) {
                this.航空航天类 = 航空航天类;
            }

            public List<String> get生物工程类() {
                return 生物工程类;
            }

            public void set生物工程类(List<String> 生物工程类) {
                this.生物工程类 = 生物工程类;
            }

            public List<String> get力学类() {
                return 力学类;
            }

            public void set力学类(List<String> 力学类) {
                this.力学类 = 力学类;
            }

            public List<String> get核工程类() {
                return 核工程类;
            }

            public void set核工程类(List<String> 核工程类) {
                this.核工程类 = 核工程类;
            }

            public List<String> get地质学类() {
                return 地质学类;
            }

            public void set地质学类(List<String> 地质学类) {
                this.地质学类 = 地质学类;
            }

            public List<String> get口腔医学类() {
                return 口腔医学类;
            }

            public void set口腔医学类(List<String> 口腔医学类) {
                this.口腔医学类 = 口腔医学类;
            }

            public List<String> get兵器类() {
                return 兵器类;
            }

            public void set兵器类(List<String> 兵器类) {
                this.兵器类 = 兵器类;
            }

            public List<String> get农业经济管理类() {
                return 农业经济管理类;
            }

            public void set农业经济管理类(List<String> 农业经济管理类) {
                this.农业经济管理类 = 农业经济管理类;
            }

            public List<String> get管理科学与工程类() {
                return 管理科学与工程类;
            }

            public void set管理科学与工程类(List<String> 管理科学与工程类) {
                this.管理科学与工程类 = 管理科学与工程类;
            }

            public List<String> get临床医学类() {
                return 临床医学类;
            }

            public void set临床医学类(List<String> 临床医学类) {
                this.临床医学类 = 临床医学类;
            }

            public List<String> get药学类() {
                return 药学类;
            }

            public void set药学类(List<String> 药学类) {
                this.药学类 = 药学类;
            }

            public List<String> get美术学类() {
                return 美术学类;
            }

            public void set美术学类(List<String> 美术学类) {
                this.美术学类 = 美术学类;
            }

            public List<String> get心理学类() {
                return 心理学类;
            }

            public void set心理学类(List<String> 心理学类) {
                this.心理学类 = 心理学类;
            }
        }

        public static class 理学Bean {
            private List<String> 中国语言文学类;
            private List<String> 测绘类;
            private List<String> 水利类;
            private List<String> 林业工程类;
            private List<String> 海洋科学类;
            private List<String> 音乐与舞蹈学类;
            private List<String> 植物生产类;
            private List<String> 哲学类;
            private List<String> 教育学类;
            private List<String> 海洋工程类;
            private List<String> 公安技术类;
            private List<String> 物理学类;
            private List<String> 机械类;
            private List<String> 工业工程类;
            private List<String> 政治学类;
            private List<String> 电气类;
            private List<String> 物流管理与工程类;
            private List<String> 民族学类;
            private List<String> 社会学类;
            private List<String> 护理学类;
            private List<String> 自然保护与环境生态类;
            private List<String> 纺织类;
            private List<String> 新闻传播学类;
            private List<String> 设计学类;
            private List<String> 草学类;
            private List<String> 基础医学类;
            private List<String> 食品科学与工程类;
            private List<String> 医学技术类;
            private List<String> 建筑类学;
            private List<String> 化学类;
            private List<String> 体育学类;
            private List<String> 矿业类;
            private List<String> 工商管理类;
            private List<String> 统计学类;
            private List<String> 公共管理类;
            private List<String> 中药学类;
            private List<String> 生物科学类;
            private List<String> 旅游管理类;
            private List<String> 外国语言文学类;
            private List<String> 动物生产类;
            private List<String> 林学类;
            private List<String> 安全科学与工程类;
            private List<String> 交通运输类;
            private List<String> 地球物理学类;
            private List<String> 大气科学类;
            private List<String> 经济学类;
            private List<String> 历史学类;
            private List<String> 农业工程类;
            private List<String> 材料类;
            private List<String> 计算机类;
            private List<String> 天文学类;
            private List<String> 中西医结合类;
            private List<String> 图书情报与档案管理类;
            private List<String> 水产类;
            private List<String> 化工与制药类;
            private List<String> 数学类;
            private List<String> 中医学类;
            private List<String> 法学类;
            private List<String> 公共卫生与预防医学类;
            private List<String> 马克思主义理论类;
            private List<String> 电子商务类;
            private List<String> 经济与贸易类;
            private List<String> 生物医学工程类;
            private List<String> 公安学类;
            private List<String> 戏剧与影视学类;
            private List<String> 轻工类;
            private List<String> 艺术学理论类;
            private List<String> 地质类;
            private List<String> 财政学类;
            private List<String> 金融学类;
            private List<String> 动物医学类;
            private List<String> 地理科学类;
            private List<String> 能源动力类;
            private List<String> 土木类;
            private List<String> 法医学类;
            private List<String> 自动化类;
            private List<String> 航空航天类;
            private List<String> 生物工程类;
            private List<String> 力学类;
            private List<String> 核工程类;
            private List<String> 地质学类;
            private List<String> 口腔医学类;
            private List<String> 兵器类;
            private List<String> 农业经济管理类;
            private List<String> 管理科学与工程类;
            private List<String> 临床医学类;
            private List<String> 药学类;
            private List<String> 美术学类;
            private List<String> 心理学类;

            public List<String> get中国语言文学类() {
                return 中国语言文学类;
            }

            public void set中国语言文学类(List<String> 中国语言文学类) {
                this.中国语言文学类 = 中国语言文学类;
            }

            public List<String> get测绘类() {
                return 测绘类;
            }

            public void set测绘类(List<String> 测绘类) {
                this.测绘类 = 测绘类;
            }

            public List<String> get水利类() {
                return 水利类;
            }

            public void set水利类(List<String> 水利类) {
                this.水利类 = 水利类;
            }

            public List<String> get林业工程类() {
                return 林业工程类;
            }

            public void set林业工程类(List<String> 林业工程类) {
                this.林业工程类 = 林业工程类;
            }

            public List<String> get海洋科学类() {
                return 海洋科学类;
            }

            public void set海洋科学类(List<String> 海洋科学类) {
                this.海洋科学类 = 海洋科学类;
            }

            public List<String> get音乐与舞蹈学类() {
                return 音乐与舞蹈学类;
            }

            public void set音乐与舞蹈学类(List<String> 音乐与舞蹈学类) {
                this.音乐与舞蹈学类 = 音乐与舞蹈学类;
            }

            public List<String> get植物生产类() {
                return 植物生产类;
            }

            public void set植物生产类(List<String> 植物生产类) {
                this.植物生产类 = 植物生产类;
            }

            public List<String> get哲学类() {
                return 哲学类;
            }

            public void set哲学类(List<String> 哲学类) {
                this.哲学类 = 哲学类;
            }

            public List<String> get教育学类() {
                return 教育学类;
            }

            public void set教育学类(List<String> 教育学类) {
                this.教育学类 = 教育学类;
            }

            public List<String> get海洋工程类() {
                return 海洋工程类;
            }

            public void set海洋工程类(List<String> 海洋工程类) {
                this.海洋工程类 = 海洋工程类;
            }

            public List<String> get公安技术类() {
                return 公安技术类;
            }

            public void set公安技术类(List<String> 公安技术类) {
                this.公安技术类 = 公安技术类;
            }

            public List<String> get物理学类() {
                return 物理学类;
            }

            public void set物理学类(List<String> 物理学类) {
                this.物理学类 = 物理学类;
            }

            public List<String> get机械类() {
                return 机械类;
            }

            public void set机械类(List<String> 机械类) {
                this.机械类 = 机械类;
            }

            public List<String> get工业工程类() {
                return 工业工程类;
            }

            public void set工业工程类(List<String> 工业工程类) {
                this.工业工程类 = 工业工程类;
            }

            public List<String> get政治学类() {
                return 政治学类;
            }

            public void set政治学类(List<String> 政治学类) {
                this.政治学类 = 政治学类;
            }

            public List<String> get电气类() {
                return 电气类;
            }

            public void set电气类(List<String> 电气类) {
                this.电气类 = 电气类;
            }

            public List<String> get物流管理与工程类() {
                return 物流管理与工程类;
            }

            public void set物流管理与工程类(List<String> 物流管理与工程类) {
                this.物流管理与工程类 = 物流管理与工程类;
            }

            public List<String> get民族学类() {
                return 民族学类;
            }

            public void set民族学类(List<String> 民族学类) {
                this.民族学类 = 民族学类;
            }

            public List<String> get社会学类() {
                return 社会学类;
            }

            public void set社会学类(List<String> 社会学类) {
                this.社会学类 = 社会学类;
            }

            public List<String> get护理学类() {
                return 护理学类;
            }

            public void set护理学类(List<String> 护理学类) {
                this.护理学类 = 护理学类;
            }

            public List<String> get自然保护与环境生态类() {
                return 自然保护与环境生态类;
            }

            public void set自然保护与环境生态类(List<String> 自然保护与环境生态类) {
                this.自然保护与环境生态类 = 自然保护与环境生态类;
            }

            public List<String> get纺织类() {
                return 纺织类;
            }

            public void set纺织类(List<String> 纺织类) {
                this.纺织类 = 纺织类;
            }

            public List<String> get新闻传播学类() {
                return 新闻传播学类;
            }

            public void set新闻传播学类(List<String> 新闻传播学类) {
                this.新闻传播学类 = 新闻传播学类;
            }

            public List<String> get设计学类() {
                return 设计学类;
            }

            public void set设计学类(List<String> 设计学类) {
                this.设计学类 = 设计学类;
            }

            public List<String> get草学类() {
                return 草学类;
            }

            public void set草学类(List<String> 草学类) {
                this.草学类 = 草学类;
            }

            public List<String> get基础医学类() {
                return 基础医学类;
            }

            public void set基础医学类(List<String> 基础医学类) {
                this.基础医学类 = 基础医学类;
            }

            public List<String> get食品科学与工程类() {
                return 食品科学与工程类;
            }

            public void set食品科学与工程类(List<String> 食品科学与工程类) {
                this.食品科学与工程类 = 食品科学与工程类;
            }

            public List<String> get医学技术类() {
                return 医学技术类;
            }

            public void set医学技术类(List<String> 医学技术类) {
                this.医学技术类 = 医学技术类;
            }

            public List<String> get建筑类学() {
                return 建筑类学;
            }

            public void set建筑类学(List<String> 建筑类学) {
                this.建筑类学 = 建筑类学;
            }

            public List<String> get化学类() {
                return 化学类;
            }

            public void set化学类(List<String> 化学类) {
                this.化学类 = 化学类;
            }

            public List<String> get体育学类() {
                return 体育学类;
            }

            public void set体育学类(List<String> 体育学类) {
                this.体育学类 = 体育学类;
            }

            public List<String> get矿业类() {
                return 矿业类;
            }

            public void set矿业类(List<String> 矿业类) {
                this.矿业类 = 矿业类;
            }

            public List<String> get工商管理类() {
                return 工商管理类;
            }

            public void set工商管理类(List<String> 工商管理类) {
                this.工商管理类 = 工商管理类;
            }

            public List<String> get统计学类() {
                return 统计学类;
            }

            public void set统计学类(List<String> 统计学类) {
                this.统计学类 = 统计学类;
            }

            public List<String> get公共管理类() {
                return 公共管理类;
            }

            public void set公共管理类(List<String> 公共管理类) {
                this.公共管理类 = 公共管理类;
            }

            public List<String> get中药学类() {
                return 中药学类;
            }

            public void set中药学类(List<String> 中药学类) {
                this.中药学类 = 中药学类;
            }

            public List<String> get生物科学类() {
                return 生物科学类;
            }

            public void set生物科学类(List<String> 生物科学类) {
                this.生物科学类 = 生物科学类;
            }

            public List<String> get旅游管理类() {
                return 旅游管理类;
            }

            public void set旅游管理类(List<String> 旅游管理类) {
                this.旅游管理类 = 旅游管理类;
            }

            public List<String> get外国语言文学类() {
                return 外国语言文学类;
            }

            public void set外国语言文学类(List<String> 外国语言文学类) {
                this.外国语言文学类 = 外国语言文学类;
            }

            public List<String> get动物生产类() {
                return 动物生产类;
            }

            public void set动物生产类(List<String> 动物生产类) {
                this.动物生产类 = 动物生产类;
            }

            public List<String> get林学类() {
                return 林学类;
            }

            public void set林学类(List<String> 林学类) {
                this.林学类 = 林学类;
            }

            public List<String> get安全科学与工程类() {
                return 安全科学与工程类;
            }

            public void set安全科学与工程类(List<String> 安全科学与工程类) {
                this.安全科学与工程类 = 安全科学与工程类;
            }

            public List<String> get交通运输类() {
                return 交通运输类;
            }

            public void set交通运输类(List<String> 交通运输类) {
                this.交通运输类 = 交通运输类;
            }

            public List<String> get地球物理学类() {
                return 地球物理学类;
            }

            public void set地球物理学类(List<String> 地球物理学类) {
                this.地球物理学类 = 地球物理学类;
            }

            public List<String> get大气科学类() {
                return 大气科学类;
            }

            public void set大气科学类(List<String> 大气科学类) {
                this.大气科学类 = 大气科学类;
            }

            public List<String> get经济学类() {
                return 经济学类;
            }

            public void set经济学类(List<String> 经济学类) {
                this.经济学类 = 经济学类;
            }

            public List<String> get历史学类() {
                return 历史学类;
            }

            public void set历史学类(List<String> 历史学类) {
                this.历史学类 = 历史学类;
            }

            public List<String> get农业工程类() {
                return 农业工程类;
            }

            public void set农业工程类(List<String> 农业工程类) {
                this.农业工程类 = 农业工程类;
            }

            public List<String> get材料类() {
                return 材料类;
            }

            public void set材料类(List<String> 材料类) {
                this.材料类 = 材料类;
            }

            public List<String> get计算机类() {
                return 计算机类;
            }

            public void set计算机类(List<String> 计算机类) {
                this.计算机类 = 计算机类;
            }

            public List<String> get天文学类() {
                return 天文学类;
            }

            public void set天文学类(List<String> 天文学类) {
                this.天文学类 = 天文学类;
            }

            public List<String> get中西医结合类() {
                return 中西医结合类;
            }

            public void set中西医结合类(List<String> 中西医结合类) {
                this.中西医结合类 = 中西医结合类;
            }

            public List<String> get图书情报与档案管理类() {
                return 图书情报与档案管理类;
            }

            public void set图书情报与档案管理类(List<String> 图书情报与档案管理类) {
                this.图书情报与档案管理类 = 图书情报与档案管理类;
            }

            public List<String> get水产类() {
                return 水产类;
            }

            public void set水产类(List<String> 水产类) {
                this.水产类 = 水产类;
            }

            public List<String> get化工与制药类() {
                return 化工与制药类;
            }

            public void set化工与制药类(List<String> 化工与制药类) {
                this.化工与制药类 = 化工与制药类;
            }

            public List<String> get数学类() {
                return 数学类;
            }

            public void set数学类(List<String> 数学类) {
                this.数学类 = 数学类;
            }

            public List<String> get中医学类() {
                return 中医学类;
            }

            public void set中医学类(List<String> 中医学类) {
                this.中医学类 = 中医学类;
            }

            public List<String> get法学类() {
                return 法学类;
            }

            public void set法学类(List<String> 法学类) {
                this.法学类 = 法学类;
            }

            public List<String> get公共卫生与预防医学类() {
                return 公共卫生与预防医学类;
            }

            public void set公共卫生与预防医学类(List<String> 公共卫生与预防医学类) {
                this.公共卫生与预防医学类 = 公共卫生与预防医学类;
            }

            public List<String> get马克思主义理论类() {
                return 马克思主义理论类;
            }

            public void set马克思主义理论类(List<String> 马克思主义理论类) {
                this.马克思主义理论类 = 马克思主义理论类;
            }

            public List<String> get电子商务类() {
                return 电子商务类;
            }

            public void set电子商务类(List<String> 电子商务类) {
                this.电子商务类 = 电子商务类;
            }

            public List<String> get经济与贸易类() {
                return 经济与贸易类;
            }

            public void set经济与贸易类(List<String> 经济与贸易类) {
                this.经济与贸易类 = 经济与贸易类;
            }

            public List<String> get生物医学工程类() {
                return 生物医学工程类;
            }

            public void set生物医学工程类(List<String> 生物医学工程类) {
                this.生物医学工程类 = 生物医学工程类;
            }

            public List<String> get公安学类() {
                return 公安学类;
            }

            public void set公安学类(List<String> 公安学类) {
                this.公安学类 = 公安学类;
            }

            public List<String> get戏剧与影视学类() {
                return 戏剧与影视学类;
            }

            public void set戏剧与影视学类(List<String> 戏剧与影视学类) {
                this.戏剧与影视学类 = 戏剧与影视学类;
            }

            public List<String> get轻工类() {
                return 轻工类;
            }

            public void set轻工类(List<String> 轻工类) {
                this.轻工类 = 轻工类;
            }

            public List<String> get艺术学理论类() {
                return 艺术学理论类;
            }

            public void set艺术学理论类(List<String> 艺术学理论类) {
                this.艺术学理论类 = 艺术学理论类;
            }

            public List<String> get地质类() {
                return 地质类;
            }

            public void set地质类(List<String> 地质类) {
                this.地质类 = 地质类;
            }

            public List<String> get财政学类() {
                return 财政学类;
            }

            public void set财政学类(List<String> 财政学类) {
                this.财政学类 = 财政学类;
            }

            public List<String> get金融学类() {
                return 金融学类;
            }

            public void set金融学类(List<String> 金融学类) {
                this.金融学类 = 金融学类;
            }

            public List<String> get动物医学类() {
                return 动物医学类;
            }

            public void set动物医学类(List<String> 动物医学类) {
                this.动物医学类 = 动物医学类;
            }

            public List<String> get地理科学类() {
                return 地理科学类;
            }

            public void set地理科学类(List<String> 地理科学类) {
                this.地理科学类 = 地理科学类;
            }

            public List<String> get能源动力类() {
                return 能源动力类;
            }

            public void set能源动力类(List<String> 能源动力类) {
                this.能源动力类 = 能源动力类;
            }

            public List<String> get土木类() {
                return 土木类;
            }

            public void set土木类(List<String> 土木类) {
                this.土木类 = 土木类;
            }

            public List<String> get法医学类() {
                return 法医学类;
            }

            public void set法医学类(List<String> 法医学类) {
                this.法医学类 = 法医学类;
            }

            public List<String> get自动化类() {
                return 自动化类;
            }

            public void set自动化类(List<String> 自动化类) {
                this.自动化类 = 自动化类;
            }

            public List<String> get航空航天类() {
                return 航空航天类;
            }

            public void set航空航天类(List<String> 航空航天类) {
                this.航空航天类 = 航空航天类;
            }

            public List<String> get生物工程类() {
                return 生物工程类;
            }

            public void set生物工程类(List<String> 生物工程类) {
                this.生物工程类 = 生物工程类;
            }

            public List<String> get力学类() {
                return 力学类;
            }

            public void set力学类(List<String> 力学类) {
                this.力学类 = 力学类;
            }

            public List<String> get核工程类() {
                return 核工程类;
            }

            public void set核工程类(List<String> 核工程类) {
                this.核工程类 = 核工程类;
            }

            public List<String> get地质学类() {
                return 地质学类;
            }

            public void set地质学类(List<String> 地质学类) {
                this.地质学类 = 地质学类;
            }

            public List<String> get口腔医学类() {
                return 口腔医学类;
            }

            public void set口腔医学类(List<String> 口腔医学类) {
                this.口腔医学类 = 口腔医学类;
            }

            public List<String> get兵器类() {
                return 兵器类;
            }

            public void set兵器类(List<String> 兵器类) {
                this.兵器类 = 兵器类;
            }

            public List<String> get农业经济管理类() {
                return 农业经济管理类;
            }

            public void set农业经济管理类(List<String> 农业经济管理类) {
                this.农业经济管理类 = 农业经济管理类;
            }

            public List<String> get管理科学与工程类() {
                return 管理科学与工程类;
            }

            public void set管理科学与工程类(List<String> 管理科学与工程类) {
                this.管理科学与工程类 = 管理科学与工程类;
            }

            public List<String> get临床医学类() {
                return 临床医学类;
            }

            public void set临床医学类(List<String> 临床医学类) {
                this.临床医学类 = 临床医学类;
            }

            public List<String> get药学类() {
                return 药学类;
            }

            public void set药学类(List<String> 药学类) {
                this.药学类 = 药学类;
            }

            public List<String> get美术学类() {
                return 美术学类;
            }

            public void set美术学类(List<String> 美术学类) {
                this.美术学类 = 美术学类;
            }

            public List<String> get心理学类() {
                return 心理学类;
            }

            public void set心理学类(List<String> 心理学类) {
                this.心理学类 = 心理学类;
            }
        }

        public static class 经济学Bean {
            private List<String> 中国语言文学类;
            private List<String> 测绘类;
            private List<String> 水利类;
            private List<String> 林业工程类;
            private List<String> 海洋科学类;
            private List<String> 音乐与舞蹈学类;
            private List<String> 植物生产类;
            private List<String> 哲学类;
            private List<String> 教育学类;
            private List<String> 海洋工程类;
            private List<String> 公安技术类;
            private List<String> 物理学类;
            private List<String> 机械类;
            private List<String> 工业工程类;
            private List<String> 政治学类;
            private List<String> 电气类;
            private List<String> 物流管理与工程类;
            private List<String> 民族学类;
            private List<String> 社会学类;
            private List<String> 护理学类;
            private List<String> 自然保护与环境生态类;
            private List<String> 纺织类;
            private List<String> 新闻传播学类;
            private List<String> 设计学类;
            private List<String> 草学类;
            private List<String> 基础医学类;
            private List<String> 食品科学与工程类;
            private List<String> 医学技术类;
            private List<String> 建筑类学;
            private List<String> 化学类;
            private List<String> 体育学类;
            private List<String> 矿业类;
            private List<String> 工商管理类;
            private List<String> 统计学类;
            private List<String> 公共管理类;
            private List<String> 中药学类;
            private List<String> 生物科学类;
            private List<String> 旅游管理类;
            private List<String> 外国语言文学类;
            private List<String> 动物生产类;
            private List<String> 林学类;
            private List<String> 安全科学与工程类;
            private List<String> 交通运输类;
            private List<String> 地球物理学类;
            private List<String> 大气科学类;
            private List<String> 经济学类;
            private List<String> 历史学类;
            private List<String> 农业工程类;
            private List<String> 材料类;
            private List<String> 计算机类;
            private List<String> 天文学类;
            private List<String> 中西医结合类;
            private List<String> 图书情报与档案管理类;
            private List<String> 水产类;
            private List<String> 化工与制药类;
            private List<String> 数学类;
            private List<String> 中医学类;
            private List<String> 法学类;
            private List<String> 公共卫生与预防医学类;
            private List<String> 马克思主义理论类;
            private List<String> 电子商务类;
            private List<String> 经济与贸易类;
            private List<String> 生物医学工程类;
            private List<String> 公安学类;
            private List<String> 戏剧与影视学类;
            private List<String> 轻工类;
            private List<String> 艺术学理论类;
            private List<String> 地质类;
            private List<String> 财政学类;
            private List<String> 金融学类;
            private List<String> 动物医学类;
            private List<String> 地理科学类;
            private List<String> 能源动力类;
            private List<String> 土木类;
            private List<String> 法医学类;
            private List<String> 自动化类;
            private List<String> 航空航天类;
            private List<String> 生物工程类;
            private List<String> 力学类;
            private List<String> 核工程类;
            private List<String> 地质学类;
            private List<String> 口腔医学类;
            private List<String> 兵器类;
            private List<String> 农业经济管理类;
            private List<String> 管理科学与工程类;
            private List<String> 临床医学类;
            private List<String> 药学类;
            private List<String> 美术学类;
            private List<String> 心理学类;

            public List<String> get中国语言文学类() {
                return 中国语言文学类;
            }

            public void set中国语言文学类(List<String> 中国语言文学类) {
                this.中国语言文学类 = 中国语言文学类;
            }

            public List<String> get测绘类() {
                return 测绘类;
            }

            public void set测绘类(List<String> 测绘类) {
                this.测绘类 = 测绘类;
            }

            public List<String> get水利类() {
                return 水利类;
            }

            public void set水利类(List<String> 水利类) {
                this.水利类 = 水利类;
            }

            public List<String> get林业工程类() {
                return 林业工程类;
            }

            public void set林业工程类(List<String> 林业工程类) {
                this.林业工程类 = 林业工程类;
            }

            public List<String> get海洋科学类() {
                return 海洋科学类;
            }

            public void set海洋科学类(List<String> 海洋科学类) {
                this.海洋科学类 = 海洋科学类;
            }

            public List<String> get音乐与舞蹈学类() {
                return 音乐与舞蹈学类;
            }

            public void set音乐与舞蹈学类(List<String> 音乐与舞蹈学类) {
                this.音乐与舞蹈学类 = 音乐与舞蹈学类;
            }

            public List<String> get植物生产类() {
                return 植物生产类;
            }

            public void set植物生产类(List<String> 植物生产类) {
                this.植物生产类 = 植物生产类;
            }

            public List<String> get哲学类() {
                return 哲学类;
            }

            public void set哲学类(List<String> 哲学类) {
                this.哲学类 = 哲学类;
            }

            public List<String> get教育学类() {
                return 教育学类;
            }

            public void set教育学类(List<String> 教育学类) {
                this.教育学类 = 教育学类;
            }

            public List<String> get海洋工程类() {
                return 海洋工程类;
            }

            public void set海洋工程类(List<String> 海洋工程类) {
                this.海洋工程类 = 海洋工程类;
            }

            public List<String> get公安技术类() {
                return 公安技术类;
            }

            public void set公安技术类(List<String> 公安技术类) {
                this.公安技术类 = 公安技术类;
            }

            public List<String> get物理学类() {
                return 物理学类;
            }

            public void set物理学类(List<String> 物理学类) {
                this.物理学类 = 物理学类;
            }

            public List<String> get机械类() {
                return 机械类;
            }

            public void set机械类(List<String> 机械类) {
                this.机械类 = 机械类;
            }

            public List<String> get工业工程类() {
                return 工业工程类;
            }

            public void set工业工程类(List<String> 工业工程类) {
                this.工业工程类 = 工业工程类;
            }

            public List<String> get政治学类() {
                return 政治学类;
            }

            public void set政治学类(List<String> 政治学类) {
                this.政治学类 = 政治学类;
            }

            public List<String> get电气类() {
                return 电气类;
            }

            public void set电气类(List<String> 电气类) {
                this.电气类 = 电气类;
            }

            public List<String> get物流管理与工程类() {
                return 物流管理与工程类;
            }

            public void set物流管理与工程类(List<String> 物流管理与工程类) {
                this.物流管理与工程类 = 物流管理与工程类;
            }

            public List<String> get民族学类() {
                return 民族学类;
            }

            public void set民族学类(List<String> 民族学类) {
                this.民族学类 = 民族学类;
            }

            public List<String> get社会学类() {
                return 社会学类;
            }

            public void set社会学类(List<String> 社会学类) {
                this.社会学类 = 社会学类;
            }

            public List<String> get护理学类() {
                return 护理学类;
            }

            public void set护理学类(List<String> 护理学类) {
                this.护理学类 = 护理学类;
            }

            public List<String> get自然保护与环境生态类() {
                return 自然保护与环境生态类;
            }

            public void set自然保护与环境生态类(List<String> 自然保护与环境生态类) {
                this.自然保护与环境生态类 = 自然保护与环境生态类;
            }

            public List<String> get纺织类() {
                return 纺织类;
            }

            public void set纺织类(List<String> 纺织类) {
                this.纺织类 = 纺织类;
            }

            public List<String> get新闻传播学类() {
                return 新闻传播学类;
            }

            public void set新闻传播学类(List<String> 新闻传播学类) {
                this.新闻传播学类 = 新闻传播学类;
            }

            public List<String> get设计学类() {
                return 设计学类;
            }

            public void set设计学类(List<String> 设计学类) {
                this.设计学类 = 设计学类;
            }

            public List<String> get草学类() {
                return 草学类;
            }

            public void set草学类(List<String> 草学类) {
                this.草学类 = 草学类;
            }

            public List<String> get基础医学类() {
                return 基础医学类;
            }

            public void set基础医学类(List<String> 基础医学类) {
                this.基础医学类 = 基础医学类;
            }

            public List<String> get食品科学与工程类() {
                return 食品科学与工程类;
            }

            public void set食品科学与工程类(List<String> 食品科学与工程类) {
                this.食品科学与工程类 = 食品科学与工程类;
            }

            public List<String> get医学技术类() {
                return 医学技术类;
            }

            public void set医学技术类(List<String> 医学技术类) {
                this.医学技术类 = 医学技术类;
            }

            public List<String> get建筑类学() {
                return 建筑类学;
            }

            public void set建筑类学(List<String> 建筑类学) {
                this.建筑类学 = 建筑类学;
            }

            public List<String> get化学类() {
                return 化学类;
            }

            public void set化学类(List<String> 化学类) {
                this.化学类 = 化学类;
            }

            public List<String> get体育学类() {
                return 体育学类;
            }

            public void set体育学类(List<String> 体育学类) {
                this.体育学类 = 体育学类;
            }

            public List<String> get矿业类() {
                return 矿业类;
            }

            public void set矿业类(List<String> 矿业类) {
                this.矿业类 = 矿业类;
            }

            public List<String> get工商管理类() {
                return 工商管理类;
            }

            public void set工商管理类(List<String> 工商管理类) {
                this.工商管理类 = 工商管理类;
            }

            public List<String> get统计学类() {
                return 统计学类;
            }

            public void set统计学类(List<String> 统计学类) {
                this.统计学类 = 统计学类;
            }

            public List<String> get公共管理类() {
                return 公共管理类;
            }

            public void set公共管理类(List<String> 公共管理类) {
                this.公共管理类 = 公共管理类;
            }

            public List<String> get中药学类() {
                return 中药学类;
            }

            public void set中药学类(List<String> 中药学类) {
                this.中药学类 = 中药学类;
            }

            public List<String> get生物科学类() {
                return 生物科学类;
            }

            public void set生物科学类(List<String> 生物科学类) {
                this.生物科学类 = 生物科学类;
            }

            public List<String> get旅游管理类() {
                return 旅游管理类;
            }

            public void set旅游管理类(List<String> 旅游管理类) {
                this.旅游管理类 = 旅游管理类;
            }

            public List<String> get外国语言文学类() {
                return 外国语言文学类;
            }

            public void set外国语言文学类(List<String> 外国语言文学类) {
                this.外国语言文学类 = 外国语言文学类;
            }

            public List<String> get动物生产类() {
                return 动物生产类;
            }

            public void set动物生产类(List<String> 动物生产类) {
                this.动物生产类 = 动物生产类;
            }

            public List<String> get林学类() {
                return 林学类;
            }

            public void set林学类(List<String> 林学类) {
                this.林学类 = 林学类;
            }

            public List<String> get安全科学与工程类() {
                return 安全科学与工程类;
            }

            public void set安全科学与工程类(List<String> 安全科学与工程类) {
                this.安全科学与工程类 = 安全科学与工程类;
            }

            public List<String> get交通运输类() {
                return 交通运输类;
            }

            public void set交通运输类(List<String> 交通运输类) {
                this.交通运输类 = 交通运输类;
            }

            public List<String> get地球物理学类() {
                return 地球物理学类;
            }

            public void set地球物理学类(List<String> 地球物理学类) {
                this.地球物理学类 = 地球物理学类;
            }

            public List<String> get大气科学类() {
                return 大气科学类;
            }

            public void set大气科学类(List<String> 大气科学类) {
                this.大气科学类 = 大气科学类;
            }

            public List<String> get经济学类() {
                return 经济学类;
            }

            public void set经济学类(List<String> 经济学类) {
                this.经济学类 = 经济学类;
            }

            public List<String> get历史学类() {
                return 历史学类;
            }

            public void set历史学类(List<String> 历史学类) {
                this.历史学类 = 历史学类;
            }

            public List<String> get农业工程类() {
                return 农业工程类;
            }

            public void set农业工程类(List<String> 农业工程类) {
                this.农业工程类 = 农业工程类;
            }

            public List<String> get材料类() {
                return 材料类;
            }

            public void set材料类(List<String> 材料类) {
                this.材料类 = 材料类;
            }

            public List<String> get计算机类() {
                return 计算机类;
            }

            public void set计算机类(List<String> 计算机类) {
                this.计算机类 = 计算机类;
            }

            public List<String> get天文学类() {
                return 天文学类;
            }

            public void set天文学类(List<String> 天文学类) {
                this.天文学类 = 天文学类;
            }

            public List<String> get中西医结合类() {
                return 中西医结合类;
            }

            public void set中西医结合类(List<String> 中西医结合类) {
                this.中西医结合类 = 中西医结合类;
            }

            public List<String> get图书情报与档案管理类() {
                return 图书情报与档案管理类;
            }

            public void set图书情报与档案管理类(List<String> 图书情报与档案管理类) {
                this.图书情报与档案管理类 = 图书情报与档案管理类;
            }

            public List<String> get水产类() {
                return 水产类;
            }

            public void set水产类(List<String> 水产类) {
                this.水产类 = 水产类;
            }

            public List<String> get化工与制药类() {
                return 化工与制药类;
            }

            public void set化工与制药类(List<String> 化工与制药类) {
                this.化工与制药类 = 化工与制药类;
            }

            public List<String> get数学类() {
                return 数学类;
            }

            public void set数学类(List<String> 数学类) {
                this.数学类 = 数学类;
            }

            public List<String> get中医学类() {
                return 中医学类;
            }

            public void set中医学类(List<String> 中医学类) {
                this.中医学类 = 中医学类;
            }

            public List<String> get法学类() {
                return 法学类;
            }

            public void set法学类(List<String> 法学类) {
                this.法学类 = 法学类;
            }

            public List<String> get公共卫生与预防医学类() {
                return 公共卫生与预防医学类;
            }

            public void set公共卫生与预防医学类(List<String> 公共卫生与预防医学类) {
                this.公共卫生与预防医学类 = 公共卫生与预防医学类;
            }

            public List<String> get马克思主义理论类() {
                return 马克思主义理论类;
            }

            public void set马克思主义理论类(List<String> 马克思主义理论类) {
                this.马克思主义理论类 = 马克思主义理论类;
            }

            public List<String> get电子商务类() {
                return 电子商务类;
            }

            public void set电子商务类(List<String> 电子商务类) {
                this.电子商务类 = 电子商务类;
            }

            public List<String> get经济与贸易类() {
                return 经济与贸易类;
            }

            public void set经济与贸易类(List<String> 经济与贸易类) {
                this.经济与贸易类 = 经济与贸易类;
            }

            public List<String> get生物医学工程类() {
                return 生物医学工程类;
            }

            public void set生物医学工程类(List<String> 生物医学工程类) {
                this.生物医学工程类 = 生物医学工程类;
            }

            public List<String> get公安学类() {
                return 公安学类;
            }

            public void set公安学类(List<String> 公安学类) {
                this.公安学类 = 公安学类;
            }

            public List<String> get戏剧与影视学类() {
                return 戏剧与影视学类;
            }

            public void set戏剧与影视学类(List<String> 戏剧与影视学类) {
                this.戏剧与影视学类 = 戏剧与影视学类;
            }

            public List<String> get轻工类() {
                return 轻工类;
            }

            public void set轻工类(List<String> 轻工类) {
                this.轻工类 = 轻工类;
            }

            public List<String> get艺术学理论类() {
                return 艺术学理论类;
            }

            public void set艺术学理论类(List<String> 艺术学理论类) {
                this.艺术学理论类 = 艺术学理论类;
            }

            public List<String> get地质类() {
                return 地质类;
            }

            public void set地质类(List<String> 地质类) {
                this.地质类 = 地质类;
            }

            public List<String> get财政学类() {
                return 财政学类;
            }

            public void set财政学类(List<String> 财政学类) {
                this.财政学类 = 财政学类;
            }

            public List<String> get金融学类() {
                return 金融学类;
            }

            public void set金融学类(List<String> 金融学类) {
                this.金融学类 = 金融学类;
            }

            public List<String> get动物医学类() {
                return 动物医学类;
            }

            public void set动物医学类(List<String> 动物医学类) {
                this.动物医学类 = 动物医学类;
            }

            public List<String> get地理科学类() {
                return 地理科学类;
            }

            public void set地理科学类(List<String> 地理科学类) {
                this.地理科学类 = 地理科学类;
            }

            public List<String> get能源动力类() {
                return 能源动力类;
            }

            public void set能源动力类(List<String> 能源动力类) {
                this.能源动力类 = 能源动力类;
            }

            public List<String> get土木类() {
                return 土木类;
            }

            public void set土木类(List<String> 土木类) {
                this.土木类 = 土木类;
            }

            public List<String> get法医学类() {
                return 法医学类;
            }

            public void set法医学类(List<String> 法医学类) {
                this.法医学类 = 法医学类;
            }

            public List<String> get自动化类() {
                return 自动化类;
            }

            public void set自动化类(List<String> 自动化类) {
                this.自动化类 = 自动化类;
            }

            public List<String> get航空航天类() {
                return 航空航天类;
            }

            public void set航空航天类(List<String> 航空航天类) {
                this.航空航天类 = 航空航天类;
            }

            public List<String> get生物工程类() {
                return 生物工程类;
            }

            public void set生物工程类(List<String> 生物工程类) {
                this.生物工程类 = 生物工程类;
            }

            public List<String> get力学类() {
                return 力学类;
            }

            public void set力学类(List<String> 力学类) {
                this.力学类 = 力学类;
            }

            public List<String> get核工程类() {
                return 核工程类;
            }

            public void set核工程类(List<String> 核工程类) {
                this.核工程类 = 核工程类;
            }

            public List<String> get地质学类() {
                return 地质学类;
            }

            public void set地质学类(List<String> 地质学类) {
                this.地质学类 = 地质学类;
            }

            public List<String> get口腔医学类() {
                return 口腔医学类;
            }

            public void set口腔医学类(List<String> 口腔医学类) {
                this.口腔医学类 = 口腔医学类;
            }

            public List<String> get兵器类() {
                return 兵器类;
            }

            public void set兵器类(List<String> 兵器类) {
                this.兵器类 = 兵器类;
            }

            public List<String> get农业经济管理类() {
                return 农业经济管理类;
            }

            public void set农业经济管理类(List<String> 农业经济管理类) {
                this.农业经济管理类 = 农业经济管理类;
            }

            public List<String> get管理科学与工程类() {
                return 管理科学与工程类;
            }

            public void set管理科学与工程类(List<String> 管理科学与工程类) {
                this.管理科学与工程类 = 管理科学与工程类;
            }

            public List<String> get临床医学类() {
                return 临床医学类;
            }

            public void set临床医学类(List<String> 临床医学类) {
                this.临床医学类 = 临床医学类;
            }

            public List<String> get药学类() {
                return 药学类;
            }

            public void set药学类(List<String> 药学类) {
                this.药学类 = 药学类;
            }

            public List<String> get美术学类() {
                return 美术学类;
            }

            public void set美术学类(List<String> 美术学类) {
                this.美术学类 = 美术学类;
            }

            public List<String> get心理学类() {
                return 心理学类;
            }

            public void set心理学类(List<String> 心理学类) {
                this.心理学类 = 心理学类;
            }
        }

        public static class 管理学Bean {
            private List<String> 中国语言文学类;
            private List<String> 测绘类;
            private List<String> 水利类;
            private List<String> 林业工程类;
            private List<String> 海洋科学类;
            private List<String> 音乐与舞蹈学类;
            private List<String> 植物生产类;
            private List<String> 哲学类;
            private List<String> 教育学类;
            private List<String> 海洋工程类;
            private List<String> 公安技术类;
            private List<String> 物理学类;
            private List<String> 机械类;
            private List<String> 工业工程类;
            private List<String> 政治学类;
            private List<String> 电气类;
            private List<String> 物流管理与工程类;
            private List<String> 民族学类;
            private List<String> 社会学类;
            private List<String> 护理学类;
            private List<String> 自然保护与环境生态类;
            private List<String> 纺织类;
            private List<String> 新闻传播学类;
            private List<String> 设计学类;
            private List<String> 草学类;
            private List<String> 基础医学类;
            private List<String> 食品科学与工程类;
            private List<String> 医学技术类;
            private List<String> 建筑类学;
            private List<String> 化学类;
            private List<String> 体育学类;
            private List<String> 矿业类;
            private List<String> 工商管理类;
            private List<String> 统计学类;
            private List<String> 公共管理类;
            private List<String> 中药学类;
            private List<String> 生物科学类;
            private List<String> 旅游管理类;
            private List<String> 外国语言文学类;
            private List<String> 动物生产类;
            private List<String> 林学类;
            private List<String> 安全科学与工程类;
            private List<String> 交通运输类;
            private List<String> 地球物理学类;
            private List<String> 大气科学类;
            private List<String> 经济学类;
            private List<String> 历史学类;
            private List<String> 农业工程类;
            private List<String> 材料类;
            private List<String> 计算机类;
            private List<String> 天文学类;
            private List<String> 中西医结合类;
            private List<String> 图书情报与档案管理类;
            private List<String> 水产类;
            private List<String> 化工与制药类;
            private List<String> 数学类;
            private List<String> 中医学类;
            private List<String> 法学类;
            private List<String> 公共卫生与预防医学类;
            private List<String> 马克思主义理论类;
            private List<String> 电子商务类;
            private List<String> 经济与贸易类;
            private List<String> 生物医学工程类;
            private List<String> 公安学类;
            private List<String> 戏剧与影视学类;
            private List<String> 轻工类;
            private List<String> 艺术学理论类;
            private List<String> 地质类;
            private List<String> 财政学类;
            private List<String> 金融学类;
            private List<String> 动物医学类;
            private List<String> 地理科学类;
            private List<String> 能源动力类;
            private List<String> 土木类;
            private List<String> 法医学类;
            private List<String> 自动化类;
            private List<String> 航空航天类;
            private List<String> 生物工程类;
            private List<String> 力学类;
            private List<String> 核工程类;
            private List<String> 地质学类;
            private List<String> 口腔医学类;
            private List<String> 兵器类;
            private List<String> 农业经济管理类;
            private List<String> 管理科学与工程类;
            private List<String> 临床医学类;
            private List<String> 药学类;
            private List<String> 美术学类;
            private List<String> 心理学类;

            public List<String> get中国语言文学类() {
                return 中国语言文学类;
            }

            public void set中国语言文学类(List<String> 中国语言文学类) {
                this.中国语言文学类 = 中国语言文学类;
            }

            public List<String> get测绘类() {
                return 测绘类;
            }

            public void set测绘类(List<String> 测绘类) {
                this.测绘类 = 测绘类;
            }

            public List<String> get水利类() {
                return 水利类;
            }

            public void set水利类(List<String> 水利类) {
                this.水利类 = 水利类;
            }

            public List<String> get林业工程类() {
                return 林业工程类;
            }

            public void set林业工程类(List<String> 林业工程类) {
                this.林业工程类 = 林业工程类;
            }

            public List<String> get海洋科学类() {
                return 海洋科学类;
            }

            public void set海洋科学类(List<String> 海洋科学类) {
                this.海洋科学类 = 海洋科学类;
            }

            public List<String> get音乐与舞蹈学类() {
                return 音乐与舞蹈学类;
            }

            public void set音乐与舞蹈学类(List<String> 音乐与舞蹈学类) {
                this.音乐与舞蹈学类 = 音乐与舞蹈学类;
            }

            public List<String> get植物生产类() {
                return 植物生产类;
            }

            public void set植物生产类(List<String> 植物生产类) {
                this.植物生产类 = 植物生产类;
            }

            public List<String> get哲学类() {
                return 哲学类;
            }

            public void set哲学类(List<String> 哲学类) {
                this.哲学类 = 哲学类;
            }

            public List<String> get教育学类() {
                return 教育学类;
            }

            public void set教育学类(List<String> 教育学类) {
                this.教育学类 = 教育学类;
            }

            public List<String> get海洋工程类() {
                return 海洋工程类;
            }

            public void set海洋工程类(List<String> 海洋工程类) {
                this.海洋工程类 = 海洋工程类;
            }

            public List<String> get公安技术类() {
                return 公安技术类;
            }

            public void set公安技术类(List<String> 公安技术类) {
                this.公安技术类 = 公安技术类;
            }

            public List<String> get物理学类() {
                return 物理学类;
            }

            public void set物理学类(List<String> 物理学类) {
                this.物理学类 = 物理学类;
            }

            public List<String> get机械类() {
                return 机械类;
            }

            public void set机械类(List<String> 机械类) {
                this.机械类 = 机械类;
            }

            public List<String> get工业工程类() {
                return 工业工程类;
            }

            public void set工业工程类(List<String> 工业工程类) {
                this.工业工程类 = 工业工程类;
            }

            public List<String> get政治学类() {
                return 政治学类;
            }

            public void set政治学类(List<String> 政治学类) {
                this.政治学类 = 政治学类;
            }

            public List<String> get电气类() {
                return 电气类;
            }

            public void set电气类(List<String> 电气类) {
                this.电气类 = 电气类;
            }

            public List<String> get物流管理与工程类() {
                return 物流管理与工程类;
            }

            public void set物流管理与工程类(List<String> 物流管理与工程类) {
                this.物流管理与工程类 = 物流管理与工程类;
            }

            public List<String> get民族学类() {
                return 民族学类;
            }

            public void set民族学类(List<String> 民族学类) {
                this.民族学类 = 民族学类;
            }

            public List<String> get社会学类() {
                return 社会学类;
            }

            public void set社会学类(List<String> 社会学类) {
                this.社会学类 = 社会学类;
            }

            public List<String> get护理学类() {
                return 护理学类;
            }

            public void set护理学类(List<String> 护理学类) {
                this.护理学类 = 护理学类;
            }

            public List<String> get自然保护与环境生态类() {
                return 自然保护与环境生态类;
            }

            public void set自然保护与环境生态类(List<String> 自然保护与环境生态类) {
                this.自然保护与环境生态类 = 自然保护与环境生态类;
            }

            public List<String> get纺织类() {
                return 纺织类;
            }

            public void set纺织类(List<String> 纺织类) {
                this.纺织类 = 纺织类;
            }

            public List<String> get新闻传播学类() {
                return 新闻传播学类;
            }

            public void set新闻传播学类(List<String> 新闻传播学类) {
                this.新闻传播学类 = 新闻传播学类;
            }

            public List<String> get设计学类() {
                return 设计学类;
            }

            public void set设计学类(List<String> 设计学类) {
                this.设计学类 = 设计学类;
            }

            public List<String> get草学类() {
                return 草学类;
            }

            public void set草学类(List<String> 草学类) {
                this.草学类 = 草学类;
            }

            public List<String> get基础医学类() {
                return 基础医学类;
            }

            public void set基础医学类(List<String> 基础医学类) {
                this.基础医学类 = 基础医学类;
            }

            public List<String> get食品科学与工程类() {
                return 食品科学与工程类;
            }

            public void set食品科学与工程类(List<String> 食品科学与工程类) {
                this.食品科学与工程类 = 食品科学与工程类;
            }

            public List<String> get医学技术类() {
                return 医学技术类;
            }

            public void set医学技术类(List<String> 医学技术类) {
                this.医学技术类 = 医学技术类;
            }

            public List<String> get建筑类学() {
                return 建筑类学;
            }

            public void set建筑类学(List<String> 建筑类学) {
                this.建筑类学 = 建筑类学;
            }

            public List<String> get化学类() {
                return 化学类;
            }

            public void set化学类(List<String> 化学类) {
                this.化学类 = 化学类;
            }

            public List<String> get体育学类() {
                return 体育学类;
            }

            public void set体育学类(List<String> 体育学类) {
                this.体育学类 = 体育学类;
            }

            public List<String> get矿业类() {
                return 矿业类;
            }

            public void set矿业类(List<String> 矿业类) {
                this.矿业类 = 矿业类;
            }

            public List<String> get工商管理类() {
                return 工商管理类;
            }

            public void set工商管理类(List<String> 工商管理类) {
                this.工商管理类 = 工商管理类;
            }

            public List<String> get统计学类() {
                return 统计学类;
            }

            public void set统计学类(List<String> 统计学类) {
                this.统计学类 = 统计学类;
            }

            public List<String> get公共管理类() {
                return 公共管理类;
            }

            public void set公共管理类(List<String> 公共管理类) {
                this.公共管理类 = 公共管理类;
            }

            public List<String> get中药学类() {
                return 中药学类;
            }

            public void set中药学类(List<String> 中药学类) {
                this.中药学类 = 中药学类;
            }

            public List<String> get生物科学类() {
                return 生物科学类;
            }

            public void set生物科学类(List<String> 生物科学类) {
                this.生物科学类 = 生物科学类;
            }

            public List<String> get旅游管理类() {
                return 旅游管理类;
            }

            public void set旅游管理类(List<String> 旅游管理类) {
                this.旅游管理类 = 旅游管理类;
            }

            public List<String> get外国语言文学类() {
                return 外国语言文学类;
            }

            public void set外国语言文学类(List<String> 外国语言文学类) {
                this.外国语言文学类 = 外国语言文学类;
            }

            public List<String> get动物生产类() {
                return 动物生产类;
            }

            public void set动物生产类(List<String> 动物生产类) {
                this.动物生产类 = 动物生产类;
            }

            public List<String> get林学类() {
                return 林学类;
            }

            public void set林学类(List<String> 林学类) {
                this.林学类 = 林学类;
            }

            public List<String> get安全科学与工程类() {
                return 安全科学与工程类;
            }

            public void set安全科学与工程类(List<String> 安全科学与工程类) {
                this.安全科学与工程类 = 安全科学与工程类;
            }

            public List<String> get交通运输类() {
                return 交通运输类;
            }

            public void set交通运输类(List<String> 交通运输类) {
                this.交通运输类 = 交通运输类;
            }

            public List<String> get地球物理学类() {
                return 地球物理学类;
            }

            public void set地球物理学类(List<String> 地球物理学类) {
                this.地球物理学类 = 地球物理学类;
            }

            public List<String> get大气科学类() {
                return 大气科学类;
            }

            public void set大气科学类(List<String> 大气科学类) {
                this.大气科学类 = 大气科学类;
            }

            public List<String> get经济学类() {
                return 经济学类;
            }

            public void set经济学类(List<String> 经济学类) {
                this.经济学类 = 经济学类;
            }

            public List<String> get历史学类() {
                return 历史学类;
            }

            public void set历史学类(List<String> 历史学类) {
                this.历史学类 = 历史学类;
            }

            public List<String> get农业工程类() {
                return 农业工程类;
            }

            public void set农业工程类(List<String> 农业工程类) {
                this.农业工程类 = 农业工程类;
            }

            public List<String> get材料类() {
                return 材料类;
            }

            public void set材料类(List<String> 材料类) {
                this.材料类 = 材料类;
            }

            public List<String> get计算机类() {
                return 计算机类;
            }

            public void set计算机类(List<String> 计算机类) {
                this.计算机类 = 计算机类;
            }

            public List<String> get天文学类() {
                return 天文学类;
            }

            public void set天文学类(List<String> 天文学类) {
                this.天文学类 = 天文学类;
            }

            public List<String> get中西医结合类() {
                return 中西医结合类;
            }

            public void set中西医结合类(List<String> 中西医结合类) {
                this.中西医结合类 = 中西医结合类;
            }

            public List<String> get图书情报与档案管理类() {
                return 图书情报与档案管理类;
            }

            public void set图书情报与档案管理类(List<String> 图书情报与档案管理类) {
                this.图书情报与档案管理类 = 图书情报与档案管理类;
            }

            public List<String> get水产类() {
                return 水产类;
            }

            public void set水产类(List<String> 水产类) {
                this.水产类 = 水产类;
            }

            public List<String> get化工与制药类() {
                return 化工与制药类;
            }

            public void set化工与制药类(List<String> 化工与制药类) {
                this.化工与制药类 = 化工与制药类;
            }

            public List<String> get数学类() {
                return 数学类;
            }

            public void set数学类(List<String> 数学类) {
                this.数学类 = 数学类;
            }

            public List<String> get中医学类() {
                return 中医学类;
            }

            public void set中医学类(List<String> 中医学类) {
                this.中医学类 = 中医学类;
            }

            public List<String> get法学类() {
                return 法学类;
            }

            public void set法学类(List<String> 法学类) {
                this.法学类 = 法学类;
            }

            public List<String> get公共卫生与预防医学类() {
                return 公共卫生与预防医学类;
            }

            public void set公共卫生与预防医学类(List<String> 公共卫生与预防医学类) {
                this.公共卫生与预防医学类 = 公共卫生与预防医学类;
            }

            public List<String> get马克思主义理论类() {
                return 马克思主义理论类;
            }

            public void set马克思主义理论类(List<String> 马克思主义理论类) {
                this.马克思主义理论类 = 马克思主义理论类;
            }

            public List<String> get电子商务类() {
                return 电子商务类;
            }

            public void set电子商务类(List<String> 电子商务类) {
                this.电子商务类 = 电子商务类;
            }

            public List<String> get经济与贸易类() {
                return 经济与贸易类;
            }

            public void set经济与贸易类(List<String> 经济与贸易类) {
                this.经济与贸易类 = 经济与贸易类;
            }

            public List<String> get生物医学工程类() {
                return 生物医学工程类;
            }

            public void set生物医学工程类(List<String> 生物医学工程类) {
                this.生物医学工程类 = 生物医学工程类;
            }

            public List<String> get公安学类() {
                return 公安学类;
            }

            public void set公安学类(List<String> 公安学类) {
                this.公安学类 = 公安学类;
            }

            public List<String> get戏剧与影视学类() {
                return 戏剧与影视学类;
            }

            public void set戏剧与影视学类(List<String> 戏剧与影视学类) {
                this.戏剧与影视学类 = 戏剧与影视学类;
            }

            public List<String> get轻工类() {
                return 轻工类;
            }

            public void set轻工类(List<String> 轻工类) {
                this.轻工类 = 轻工类;
            }

            public List<String> get艺术学理论类() {
                return 艺术学理论类;
            }

            public void set艺术学理论类(List<String> 艺术学理论类) {
                this.艺术学理论类 = 艺术学理论类;
            }

            public List<String> get地质类() {
                return 地质类;
            }

            public void set地质类(List<String> 地质类) {
                this.地质类 = 地质类;
            }

            public List<String> get财政学类() {
                return 财政学类;
            }

            public void set财政学类(List<String> 财政学类) {
                this.财政学类 = 财政学类;
            }

            public List<String> get金融学类() {
                return 金融学类;
            }

            public void set金融学类(List<String> 金融学类) {
                this.金融学类 = 金融学类;
            }

            public List<String> get动物医学类() {
                return 动物医学类;
            }

            public void set动物医学类(List<String> 动物医学类) {
                this.动物医学类 = 动物医学类;
            }

            public List<String> get地理科学类() {
                return 地理科学类;
            }

            public void set地理科学类(List<String> 地理科学类) {
                this.地理科学类 = 地理科学类;
            }

            public List<String> get能源动力类() {
                return 能源动力类;
            }

            public void set能源动力类(List<String> 能源动力类) {
                this.能源动力类 = 能源动力类;
            }

            public List<String> get土木类() {
                return 土木类;
            }

            public void set土木类(List<String> 土木类) {
                this.土木类 = 土木类;
            }

            public List<String> get法医学类() {
                return 法医学类;
            }

            public void set法医学类(List<String> 法医学类) {
                this.法医学类 = 法医学类;
            }

            public List<String> get自动化类() {
                return 自动化类;
            }

            public void set自动化类(List<String> 自动化类) {
                this.自动化类 = 自动化类;
            }

            public List<String> get航空航天类() {
                return 航空航天类;
            }

            public void set航空航天类(List<String> 航空航天类) {
                this.航空航天类 = 航空航天类;
            }

            public List<String> get生物工程类() {
                return 生物工程类;
            }

            public void set生物工程类(List<String> 生物工程类) {
                this.生物工程类 = 生物工程类;
            }

            public List<String> get力学类() {
                return 力学类;
            }

            public void set力学类(List<String> 力学类) {
                this.力学类 = 力学类;
            }

            public List<String> get核工程类() {
                return 核工程类;
            }

            public void set核工程类(List<String> 核工程类) {
                this.核工程类 = 核工程类;
            }

            public List<String> get地质学类() {
                return 地质学类;
            }

            public void set地质学类(List<String> 地质学类) {
                this.地质学类 = 地质学类;
            }

            public List<String> get口腔医学类() {
                return 口腔医学类;
            }

            public void set口腔医学类(List<String> 口腔医学类) {
                this.口腔医学类 = 口腔医学类;
            }

            public List<String> get兵器类() {
                return 兵器类;
            }

            public void set兵器类(List<String> 兵器类) {
                this.兵器类 = 兵器类;
            }

            public List<String> get农业经济管理类() {
                return 农业经济管理类;
            }

            public void set农业经济管理类(List<String> 农业经济管理类) {
                this.农业经济管理类 = 农业经济管理类;
            }

            public List<String> get管理科学与工程类() {
                return 管理科学与工程类;
            }

            public void set管理科学与工程类(List<String> 管理科学与工程类) {
                this.管理科学与工程类 = 管理科学与工程类;
            }

            public List<String> get临床医学类() {
                return 临床医学类;
            }

            public void set临床医学类(List<String> 临床医学类) {
                this.临床医学类 = 临床医学类;
            }

            public List<String> get药学类() {
                return 药学类;
            }

            public void set药学类(List<String> 药学类) {
                this.药学类 = 药学类;
            }

            public List<String> get美术学类() {
                return 美术学类;
            }

            public void set美术学类(List<String> 美术学类) {
                this.美术学类 = 美术学类;
            }

            public List<String> get心理学类() {
                return 心理学类;
            }

            public void set心理学类(List<String> 心理学类) {
                this.心理学类 = 心理学类;
            }
        }
    }
}
